[
  {
    "query": "what are the initial symptoms of Covid-19?",
    "docs": [
      "[SARS-CoV-2 infection with gastrointestinal symptoms as the first manifestation in a neonate]. Since December 2019, the outbreak of severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) infection has occurred in Wuhan, Hubei Province, China. The infected cases were noted mostly in adults, but rarely reported in children, especially neonates. Most children with SARS-CoV-2 infection present mainly with respiratory symptoms, but less commonly with gastrointestinal symptoms, and tend to have mild clinical symptoms. A neonate with SARS-CoV-2 infection, who had vomiting and milk refusal as the first symptom, was recently admitted to Wuhan Children's Hospital. After two weeks of treatment, the patient recovered gradually and was discharged. Here, this case is reported to improve the understanding of SARS-CoV-2 infection in neonates.",
      "Chapter 1 Introduction and Historical Perspective Publisher Summary The term molecular epidemiology emerged apparently independently during the 1970s to early 1980s in the literature of three separate substantive areas of epidemiology: cancer epidemiology, environmental epidemiology, and infectious disease epidemiology. Although these separate substantive areas agree that epidemiology refers to the distribution of disease in a population and the determinants of that distribution, the literature presents conflicting definitions of what makes a study a molecular epidemiologic study. In cancer and environmental epidemiology, molecular is defined almost exclusively in terms of biomarkers. However, biomarkers are only one type of molecular measure, and this definition ignores the many applications of molecular methods in genetic and infectious disease epidemiology. Early epidemiologists made tremendous strides with what are now relatively simple molecular tools, such as using microscopy for identification, showing agents not visible by microscope cause disease, and detecting protective antibodies with hemagglutination assays. In the microbiology literature, molecular epidemiology has become synonymous with the use of molecular fingerprints—regardless of whether the study was population based or met other criteria consistent with an epidemiologic study. Moreover, the molecular tools available, and the potential for applications for studies of populations, have changed substantially since the term molecular epidemiology was coined.",
      "Acute pulmonary embolism mimicking COVID - 19 pneumonia",
      "Evaluation of the clinical characteristics of suspected or confirmed cases of COVID-19 during home care with isolation: A new retrospective analysis based on O2O Summary Background The recent outbreak of the novel coronavirus in December 2019 (COVID-19) has activated top-level response nationwide. We developed a new treatment model based on the online-to-offline (O2O) model for the home isolated patients, because in the early stages the medical staff were insufficient to cope with so many patients. Methods In this single-centered, retrospective study, we enrolled 48 confirmed/suspected COVID-19 patients who underwent home isolation in Wuhan between January 6 and January 31, 2020. By WeChat and online document editing all patients were treated with medical observation scale. The clinical indications such as Fever, Muscle soreness, Dyspnea and Lack of strength were collected with this system led by medical staff in management, medicine, nursing, rehabilitation and psychology. Findings The mean(SD) age of 48 patients was 39.08(13.88) years, 35(72.9%) were women. Compared with non-hospitalized patients, inpatients were older(≥8805;70years, 2.4% vs 33.3%, P<0.04). All inpatients had fever, 50% inpatients had coughs and showed infiltration in both lungs at the time of diagnosis. 33.3% inpatients exhibited negative changes in their CT results at initial diagnosis. The body temperature of non-hospitalized patients with mild symptoms returned to normal by day 4-5. While dyspnea peaked on day 6 for non-hospitalized patients with mild symptoms, it persisted in hospitalized patients and exacerbated over time. The lack of strength and muscle soreness were both back to normal by day 4 for non-hospitalized patients. Interpretation Monitoring the trends of symptoms is more important for identifying severe cases. Excessive laboratory data and physical examination are not necessary for the evaluation of patients with mild symptoms. The system we developed is the first to convert the subjective symptoms of patients into objective scores. This type of O2O, subjective-to-objective strategy may be used in regions with similar highly infectious diseases to minimize the possibility of infection among medical staff.",
      "COVOID-19 and Long-Term Care Policy for Older People in Canada. Older people are especially vulnerable to COVID-19, including and especially people living in long-term care facilities. In this Perspective, we discuss the impact of the COVID-19 pandemic on long-term care policy in Canada. More specifically, we use the example of recent developments in Quebec, where a tragedy in a specific facility is acting as a dramatic \"focusing event\". It draws attention to the problems facing long-term care facilities, considering existing policy legacies and the opening of a \"policy window\" that may facilitate comprehensive reforms in the wake of the COVID-19 pandemic.",
      "The SARS, MERS and novel coronavirus (COVID-19) epidemics, the newest and biggest global health threats: what lessons have we learned? OBJECTIVES: To provide an overview of the three major deadly coronaviruses and identify areas for improvement of future preparedness plans, as well as provide a critical assessment of the risk factors and actionable items for stopping their spread, utilizing lessons learned from the first two deadly coronavirus outbreaks, as well as initial reports from the current novel coronavirus (COVID-19) epidemic in Wuhan, China. METHODS: Utilizing the Centers for Disease Control and Prevention (CDC, USA) website, and a comprehensive review of PubMed literature, we obtained information regarding clinical signs and symptoms, treatment and diagnosis, transmission methods, protection methods and risk factors for Middle East Respiratory Syndrome (MERS), Severe Acute Respiratory Syndrome (SARS) and COVID-19. Comparisons between the viruses were made. RESULTS: Inadequate risk assessment regarding the urgency of the situation, and limited reporting on the virus within China has, in part, led to the rapid spread of COVID-19 throughout mainland China and into proximal and distant countries. Compared with SARS and MERS, COVID-19 has spread more rapidly, due in part to increased globalization and the focus of the epidemic. Wuhan, China is a large hub connecting the North, South, East and West of China via railways and a major international airport. The availability of connecting flights, the timing of the outbreak during the Chinese (Lunar) New Year, and the massive rail transit hub located in Wuhan has enabled the virus to perforate throughout China, and eventually, globally. CONCLUSIONS: We conclude that we did not learn from the two prior epidemics of coronavirus and were ill-prepared to deal with the challenges the COVID-19 epidemic has posed. Future research should attempt to address the uses and implications of internet of things (IoT) technologies for mapping the spread of infection.",
      "Trusted writing in social media: FPM International Awards for Medical Writing in Social Media",
      "Loss of Taste and Smell as Distinguishing Symptoms of COVID-19 Olfactory and taste dysfunctions have emerged as symptoms of COVID-19. Among individuals with COVID-19 enrolled in a household study, loss of taste and/or smell was the fourth most commonly reported symptom (26/42; 62%), and among household contacts, it had the highest positive predictive value (83%; 95% CI: 55-95%) for COVID-19. These findings support consideration of loss of taste and/or smell in possible case identification and testing prioritization for COVID-19.",
      "Editorial overview: Emerging viruses: interspecies transmission",
      "Full spectrum of COVID-19 severity still being depicted"
    ],
    "relevance_map": {
      "0": 1,
      "1": 0,
      "2": 0,
      "3": 1,
      "4": 0,
      "5": 1,
      "6": 0,
      "7": 1,
      "8": 0,
      "9": 1
    },
    "query_id": "query_0",
    "num_docs": 10
  },
  {
    "query": "what kinds of complications related to COVID-19 are associated with diabetes",
    "docs": [
      "Detección de virus respiratorios en pacientes con sospecha de infección por SARS-CoV-2./ Detección de virus respiratorios en pacientes con sospecha de infección por SARS-CoV-2./ Detection of respiratory viruses in patients with suspected SARS-CoV-2 infection",
      "Dissecting the Interaction between Coronavirus Disease 2019 and Diabetes Mellitus Coronavirus disease 2019 (COVID-19) is a global pandemic that is caused by a novel coronavirus, severe acute respiratory syndrome-coronavirus-2 (SARS-CoV-2). Data from several countries have demonstrated higher morbidity and mortality among individuals with chronic metabolic diseases such as diabetes mellitus (DM). In this review, we explore the contributing factors for poorer prognosis in these individuals. As a significant proportion of patients with COVID-19 also have DM, this adds another layer of complexity to their management. We explore potential interactions between anti-diabetic medications and renin-angiotensin-aldosterone-system inhibitors with COVID-19. Suggested recommendations for the use of anti-diabetic medications in COVID-19 patients with DM are provided. We also review pertinent clinical considerations in the management of diabetic ketoacidosis in the COVID-19 patient. In addition, we aim to increase the awareness of clinicians to the metabolic effects of promising drug therapies for COVID-19. Finally, we highlight the importance of timely vaccinations for patients with DM.",
      "Clinical characteristics and outcome of ICU admitted MERS corona virus infected patients Abstract Middle East Respiratory Syndrome (MERS) is a novel respiratory illness firstly reported in Saudi Arabia in 2012. It is caused by a new corona virus, called MERS corona virus (MERS-CoV). Most people who have MERS-CoV infection developed severe acute respiratory illness. Aim of the work This work is done to determine the clinical characteristics and the outcome of intensive care unit (ICU) admitted patients with confirmed MERS-CoV infection. Patients and methods This study included 32 laboratory confirmed MERS corona virus infected patients who were admitted into ICU. It included 20 (62.50%) males and 12 (37.50%) females. The mean age was 43.99±13.03years. Diagnosis was done by real-time reverse transcription polymerase chain reaction (rRT-PCR) test for corona virus on throat swab, sputum, tracheal aspirate, or bronchoalveolar lavage specimens. Clinical characteristics, co-morbidities and outcome were reported for all subjects. Results The main symptoms among the included patients were: fever (96.87%), cough (93.75%), dyspnea (90.62%), sore throat (75%), runny nose (75%), sputum (50%), headache (43.75%), myalgia (40.62%), chest pain (37.50%), hemoptysis (37.50%), nausea and vomiting (34.37%), abdominal pain (21.87%) and diarrhea (15.62%). The presence of abdominal symptoms is significantly (P <0.05) associated with bad prognosis. Out of the included 32 patients, 18 patients (56.25%) survived and 14 patients (43.75%) expired. There was a statistically significant difference in the duration of symptoms before hospitalization, mechanical ventilation and ICU and total hospital stay between the expired group and survivors (P <0.01). Current smoking and smoking severity were statistically significantly (P <0.01) higher in the expired group compared to survivors. Also, there was a statistically (P <0.05) significant positive correlation between mortality and smoking severity (r =0.640). Most of the expired patients presented with bilateral pulmonary infiltrates or unilateral infiltrates, but most of the survivors presented with normal radiology or increased bronchovascular markings, and this difference in the results was statistically highly significant (P <0.01). There were statistically highly significant (P <0.01) differences in the mean values of APACHE II score (21.11±3.70 vs 24.21±3.82), SOFA score (5.83±2.64 vs 8.85±2.17) and CPIS (7.55±1.14 vs 8.64±1.39) between the expired group and survivors respectively. Also, there was a statistically significant decrease in PH, PaO2, O2 saturation and HCO3 (P <0.05) among the expired group in comparison with the survivors, but no statistical difference regarding PaCO2 (P >0.05). There was a statistically significant positive correlation between mortality and old age (r =0.633), obesity (r =0.712), diabetes mellitus (r =0.685), renal failure (r =0.705), chronic heart diseases (0.591), COPD (r =0.523), malignancy (r =0.692), kidney transplantation (r =0.644) and liver cirrhosis (r =0.525) (P <0.05). There was a statistically (P <0.05) positive correlation between the number of associated co-morbidities and mortality (r =0.735). Conclusions Most MERS corona patients present with fever, cough, dyspnea, sore throat, runny nose and sputum. The presence of abdominal symptoms may indicate bad prognosis. Prolonged duration of symptoms before patients’ hospitalization, prolonged duration of mechanical ventilation and hospital stay, bilateral radiological pulmonary infiltrates, and hypoxemic respiratory failure were found to be strong predictors of mortality in such patients. Also, old age, current smoking, smoking severity, presence of associated co-morbidities like obesity, diabetes mellitus, chronic heart diseases, COPD, malignancy, renal failure, renal transplantation and liver cirrhosis are associated with a poor outcome of ICU admitted MERS corona virus infected patients.",
      "Association of diabetes and hypertension with disease severity in covid-19 patients: a systematic literature review and exploratory meta-analysis AIM: The novel coronavirus infection (COVID-19), now a worldwide public health concern is associated with varied fatality. Patients with chronic underlying conditions like diabetes and hypertension have shown worst outcomes. The understanding of the association might be helpful in early vigilant monitoring and better management of COVID-19 patients at high risk. The aim of the meta-analysis was to assess the association of diabetes and hypertension with severity of disease. METHODS: A literature search was conducted using the databases PubMed and Cochrane until March 31, 2020. Seven studies were included in the meta- analysis, including 2018 CIVID-19 patients. RESULTS: Diabetes was lower in the survivors (OR: 0.56; 95%CI: 0.35-0.90; p=0.017; I2: 0.0%) and non-severe (OR: 1.66; 95%CI: 1.20-2.30; p=0.002; I2: 0.0%) patients. No association of diabetes was found with ICU care. Hypertension was positively associated with death (OR: 0.49; 95%CI: 0.34-0.73; p=0.000; I2: 0.0%), ICU care (OR: 0.42; 95%CI: 0.22-0.81; p=0.009; I2: 0.0%) and severity (OR: 2.69; 95%CI: 1.27-5.73; p=0.01; I2: 52.4%). CONCLUSIONS: Our findings suggest that diabetes and hypertension have a negative effect on health status of COVID-19 patients. However, large prevalence studies demonstrating the consequences of comorbid diabetes and hypertension are urgently needed to understand the magnitude of these vexatious comorbidities.",
      "The rise of no/low code software development—No experience needed?",
      "Phenotypic characteristics and prognosis of inpatients with COVID-19 and diabetes: the CORONADO study AIMS/HYPOTHESIS: Coronavirus disease-2019 (COVID-19) is a life-threatening infection caused by the severe acute respiratory syndrome coronavirus-2 (SARS-CoV-2) virus. Diabetes has rapidly emerged as a major comorbidity for COVID-19 severity. However, the phenotypic characteristics of diabetes in COVID-19 patients are unknown. METHODS: We conducted a nationwide multicentre observational study in people with diabetes hospitalised for COVID-19 in 53 French centres in the period 10-31 March 2020. The primary outcome combined tracheal intubation for mechanical ventilation and/or death within 7 days of admission. Age- and sex-adjusted multivariable logistic regressions were performed to assess the prognostic value of clinical and biological features with the endpoint. ORs are reported for a 1 SD increase after standardisation. RESULTS: The current analysis focused on 1317 participants: 64.9% men, mean age 69.8 ± 13.0 years, median BMI 28.4 (25th-75th percentile: 25.0-32.7) kg/m2; with a predominance of type 2 diabetes (88.5%). Microvascular and macrovascular diabetic complications were found in 46.8% and 40.8% of cases, respectively. The primary outcome was encountered in 29.0% (95% CI 26.6, 31.5) of participants, while 10.6% (9.0, 12.4) died and 18.0% (16.0, 20.2) were discharged on day 7. In univariate analysis, characteristics prior to admission significantly associated with the primary outcome were sex, BMI and previous treatment with renin-angiotensin-aldosterone system (RAAS) blockers, but not age, type of diabetes, HbA1c, diabetic complications or glucose-lowering therapies. In multivariable analyses with covariates prior to admission, only BMI remained positively associated with the primary outcome (OR 1.28 [1.10, 1.47]). On admission, dyspnoea (OR 2.10 [1.31, 3.35]), as well as lymphocyte count (OR 0.67 [0.50, 0.88]), C-reactive protein (OR 1.93 [1.43, 2.59]) and AST (OR 2.23 [1.70, 2.93]) levels were independent predictors of the primary outcome. Finally, age (OR 2.48 [1.74, 3.53]), treated obstructive sleep apnoea (OR 2.80 [1.46, 5.38]), and microvascular (OR 2.14 [1.16, 3.94]) and macrovascular complications (OR 2.54 [1.44, 4.50]) were independently associated with the risk of death on day 7. CONCLUSIONS/INTERPRETATIONS: In people with diabetes hospitalised for COVID-19, BMI, but not long-term glucose control, was positively and independently associated with tracheal intubation and/or death within 7 days. TRIAL REGISTRATION: clinicaltrials.gov NCT04324736.",
      "An 'asymptomatic' driver with COVID-19: Atypical suspected myocarditis by SARS-CoV-2",
      "Beveridgean Unemployment Gap This paper proposes a new method to estimate the unemployment gap (the actual unemployment rate minus the efficient rate). While lowering unemployment puts more people into work, it forces firms to post more vacancies and devote more resources to recruiting. This unemployment-vacancy tradeoff, governed by the Beveridge curve, determines the efficient unemployment rate. Accordingly, the unemployment gap can be measured from three sufficient statistics: the elasticity of the Beveridge curve, cost of recruiting, and social cost of unemployment. In the United States the unemployment gap is countercyclical, reaching 1.5--6.5 percentage points in slumps. Thus the US labor market appears inefficient---especially inefficiently slack in slumps.",
      "The Clinical and Chest CT Features Associated With Severe and Critical COVID-19 Pneumonia OBJECTIVE: The aim of this study was to investigate the clinical and computed tomography (CT) features associated with severe and critical coronavirus disease 2019 (COVID-19) pneumonia. MATERIALS AND METHODS: Eighty-three patients with COVID-19 pneumonia including 25 severe/critical cases and 58 ordinary cases were enrolled. The chest CT images and clinical data of them were reviewed and compared. The risk factors associated with disease severity were analyzed. RESULTS: Compared with the ordinary patients, the severe/critical patients had older ages, higher incidence of comorbidities, cough, expectoration, chest pain, and dyspnea. The incidences of consolidation, linear opacities, crazy-paving pattern, and bronchial wall thickening in severe/critical patients were significantly higher than those of the ordinary patients. Besides, severe/critical patients showed higher incidences of lymph node enlargement, pericardial effusion, and pleural effusion than the ordinary patients. The CT scores of severe/critical patients were significantly higher than those of the ordinary patients (P < 0.001). Receiver operating characteristic curve showed that the sensitivity and specificity of CT score were 80.0% and 82.8%, respectively, for the discrimination of the 2 types. The clinical factors of age older than 50 years, comorbidities, dyspnea, chest pain, cough, expectoration, decreased lymphocytes, and increased inflammation indicators were risk factors for severe/critical COVID-19 pneumonia. Computed tomography findings of consolidation, linear opacities, crazy-paving pattern, bronchial wall thickening, high CT scores, and extrapulmonary lesions were features of severe/critical COVID-19 pneumonia. CONCLUSIONS: There are significant differences in clinical symptoms, laboratory examinations, and CT manifestations between the ordinary patients and the severe/critical patients. Many factors are related to the severity of the disease, which can help clinicians to judge the severity of the patient and evaluate the prognosis.",
      "Randomized clinical trial of fibrin sealant versus titanium tacks for mesh fixation in laparoscopic umbilical hernia repair (Br J Surg 2011; 98: 1537-1545)."
    ],
    "relevance_map": {
      "0": 0,
      "1": 1,
      "2": 1,
      "3": 1,
      "4": 0,
      "5": 1,
      "6": 0,
      "7": 0,
      "8": 1,
      "9": 0
    },
    "query_id": "query_1",
    "num_docs": 10
  },
  {
    "query": "are patients taking Angiotensin-converting enzyme inhibitors (ACE) at increased risk for COVID-19?",
    "docs": [
      "An Easy and Cost-Effective Method to Perform the \"No-Touch\" Technique in Saline Breast Augmentation.",
      "Totally intracorporeal robotic en bloc resection for deep infiltrating endometriosis of the rectovaginal wall with natural orifice specimen extraction.",
      "COVID-19 Image Data Collection This paper describes the initial COVID-19 open image data collection. It was created by assembling medical images from websites and publications and currently contains 123 frontal view X-rays.",
      "Renin-angiotensin-aldosterone system inhibitors and COVID-19 infection or hospitalization: a cohort study There are plausible mechanisms by which angiotensin-converting enzyme inhibitors (ACEIs) and angiotensin receptor blockers (ARBs) may increase the risk of COVID-19 infection or affect disease severity. To examine the association between these medications and COVID-19 infection or hospitalization, we conducted a retrospective cohort study within a US integrated healthcare system. Among people aged [≥]18 years enrolled in the health plan for at least 4 months as of 2/29/2020, current ACEI and ARB use was identified from pharmacy data, and the estimated daily dose was calculated and standardized across medications. COVID-19 infections were identified through 6/14/2020 from laboratory and hospitalization data. We used logistic regression to estimate adjusted odds ratios (ORs) and 95% confidence intervals. Among 322,044 individuals, 720 developed COVID-19 infection. Among people using ACEI/ARBs, 183/56,105 developed COVID-19 (3.3 per 1000 individuals) compared with 537/265,939 without ACEI/ARB use (2.0 per 1000), yielding an adjusted OR of 0.94 (95% CI 0.75-1.16). For use of < 1 defined daily dose vs. nonuse, the adjusted OR for infection was 0.89 (95% CI 0.62-1.26); for 1 to < 2 defined daily doses, 0.97 (95% CI 0.71-1.31); and for [≥]2 defined daily doses, 0.94 (95% CI 0.72-1.23). The OR was similar for ACEIs and ARBs and in subgroups by age and sex. 29% of people with COVID-19 infection were hospitalized; the adjusted OR for hospitalization in relation to ACEI/ARB use was 0.92 (95% CI 0.54-1.57), and there was no association with dose. These findings support current recommendations that individuals on these medications continue their use.",
      "COVID-19 and hypertension",
      "[Role of age, comorbidity and renin- angiotensin-aldosterone system in COVID-19. Effects of ACE inhibitors and angiotensin receptor blockers]. The review addressed the relationship of coronavirus disease 2019 (COVID-19) with functioning of the renin-angiotensin-aldosterone axis and the causes for unfavorable prognosis depending on patients' age and comorbidities. The authors discussed in detail potential effects of angiotensin-converting enzyme inhibitors and angiotensin II type 1 receptor antagonists on the risk of infection and the course of COVID-2019 as well as the effect of SARS-COV2 virus on the cardiovascular system.",
      "Advances in the diagnosis of key gastrointestinal nematode infections of livestock, with an emphasis on small ruminants Abstract Parasitic nematodes (roundworms) of livestock have major economic impact globally. In spite of the diseases caused by these nematodes and some advances in the design of new therapeutic agents (anthelmintics) and attempts to develop vaccines against some of them, there has been limited progress in the establishment of practical diagnostic techniques. The specific and sensitive diagnosis of gastrointestinal nematode infections of livestock underpins effective disease control, which is highly relevant now that anthelmintic resistance (AR) is a major problem. Traditional diagnostic techniques have major constraints, in terms of sensitivity and specificity. The purpose of this article is to provide a brief background on gastrointestinal nematodes (Strongylida) of livestock and their control; to summarize conventional methods used for the diagnosis and discuss their constraints; to review key molecular-diagnostic methods and recent progress in the development of advanced amplification-based and sequencing technologies, and their implications for epidemiological investigations and the control of parasitic diseases.",
      "Bioinformatic characterization of angiotensin-converting enzyme 2, the entry receptor for SARS-CoV-2 The World Health Organization declared the COVID-19 epidemic a public health emergency of international concern on March 11th, 2020, and the pandemic is rapidly spreading worldwide. COVID-19 is caused by a novel coronavirus SARS-CoV-2, which enters human target cells via angiotensin converting enzyme 2 (ACE2). We used a number of bioinformatics tools to computationally characterize ACE2 by determining its cell-specific expression in trachea, lung, and small intestine, derive its putative functions, and predict transcriptional regulation. The small intestine expressed higher levels of ACE2 than any other organ. The large intestine, kidney and testis showed moderate signals, whereas the signal was weak in the lung. Single cell RNA-Seq data from trachea indicated positive signals along the respiratory tract in key protective cell types including club, goblet, proliferating, and ciliary epithelial cells; while in lung the ratio of ACE2-expressing cells was low in all cell types (<2.6%), but was highest in vascular endothelial and goblet cells. Gene ontology analysis suggested that, besides its classical role in renin-angiotensin system, ACE2 may be functionally associated with angiogenesis/blood vessel morphogenesis. Using a novel tool for the prediction of transcription factor binding sites we identified several putative binding sites within two tissue-specific promoters of the ACE2 gene. Our results also confirmed that age and gender play no significant role in the regulation of ACE2 mRNA expression in the lung. IMPORTANCE Vaccines and new medicines are urgently needed to prevent spread of COVID-19 pandemic, reduce the symptoms, shorten the duration of disease, prevent virus spread in the body, and most importantly to save lives. One of the key drug targets could be angiotensin-converting enzyme 2 (ACE2), which is a crucial receptor for the corona virus (SARS-CoV-2). It is known that SARS coronavirus infections lead to worse outcome in the elderly and in males. Therefore, one aim of the present study was to investigate whether age or sex could contribute to the regulation of ACE2 expression. We also decided to explore the transcriptional regulation of ACE2 gene expression. Since data on ACE2 distribution is still conflicting, we aimed to get a more comprehensive view of the cell types expressing the receptor of SARS-CoV-2. Finally, we studied the coexpression of ACE2 with other genes and explored its putative functions using gene ontology enrichment analysis.",
      "Genotyping of clinically relevant human adenoviruses by array-in-well hybridization assay A robust oligonucleotide array-in-well hybridization assay using novel up-converting phosphor reporter technology was applied for genotyping clinically relevant human adenovirus types. A total of 231 adenovirus-positive respiratory, ocular swab, stool and other specimens from 219 patients collected between April 2010 and April 2011 were included in the study. After a real-time PCR amplification targeting the adenovirus hexon gene, the array-in-well assay identified the presence of B03 (n = 122; 57.5% of patients), E04 (29; 13.7%), C02 (21; 9.9%), D37 (14; 6.6%), C01 (12; 5.7%), C05 (5; 2.4%), D19 (4; 1.9%), C06 (2; 0.9%), D08 (1; 0.5%), A31 (1; 0.5%) and F41 (1; 0.5%) genotypes among the clinical sample panel. The typing result was obtained for all specimens that could be amplified (n = 223; 97%), and specificity of the typing was confirmed by sequencing specimens representing each of the different genotypes. No hybridization signal was obtained in adenovirus-negative specimens or specimens with other viruses (n = 30). The array-in-well hybridization assay has great potential as a rapid and multiplex platform for the typing of clinically relevant human adenovirus genotypes in different specimen types.",
      "Angiotensin II for the Treatment of COVID-19–Related Vasodilatory Shock"
    ],
    "relevance_map": {
      "0": 0,
      "1": 0,
      "2": 0,
      "3": 1,
      "4": 1,
      "5": 1,
      "6": 0,
      "7": 1,
      "8": 0,
      "9": 1
    },
    "query_id": "query_2",
    "num_docs": 10
  },
  {
    "query": "what are best practices in hospitals and at home in maintaining quarantine?",
    "docs": [
      "Emergency trauma care during the outbreak of corona virus disease 2019 (COVID-19) in China BACKGROUND: A novel coronavirus pneumonia outbreak began in Wuhan, Hubei Province, in December 2019; the outbreak was caused by a novel coronavirus previously never observed in humans. China has imposed the strictest quarantine and closed management measures in history to control the spread of the disease. However, a high level of evidence to support the surgical management of potential trauma patients during the novel coronavirus outbreak is still lacking. To regulate the emergency treatment of trauma patients during the outbreak, we drafted this paper from a trauma surgeon perspective according to practical experience in Wuhan. MAIN BODY: The article illustrates the general principles for the triage and evaluation of trauma patients during the outbreak of COVID-19, indications for emergency surgery, and infection prevention and control for medical personnel, providing a practical algorithm for trauma care providers during the outbreak period. CONCLUSIONS: The measures of emergency trauma care that we have provided can protect the medical personnel involved in emergency care and ensure the timeliness of effective interventions during the outbreak of COVID-19.",
      "Evaluation of the clinical characteristics of suspected or confirmed cases of COVID-19 during home care with isolation: A new retrospective analysis based on O2O Summary Background The recent outbreak of the novel coronavirus in December 2019 (COVID-19) has activated top-level response nationwide. We developed a new treatment model based on the online-to-offline (O2O) model for the home isolated patients, because in the early stages the medical staff were insufficient to cope with so many patients. Methods In this single-centered, retrospective study, we enrolled 48 confirmed/suspected COVID-19 patients who underwent home isolation in Wuhan between January 6 and January 31, 2020. By WeChat and online document editing all patients were treated with medical observation scale. The clinical indications such as Fever, Muscle soreness, Dyspnea and Lack of strength were collected with this system led by medical staff in management, medicine, nursing, rehabilitation and psychology. Findings The mean(SD) age of 48 patients was 39.08(13.88) years, 35(72.9%) were women. Compared with non-hospitalized patients, inpatients were older(≥8805;70years, 2.4% vs 33.3%, P<0.04). All inpatients had fever, 50% inpatients had coughs and showed infiltration in both lungs at the time of diagnosis. 33.3% inpatients exhibited negative changes in their CT results at initial diagnosis. The body temperature of non-hospitalized patients with mild symptoms returned to normal by day 4-5. While dyspnea peaked on day 6 for non-hospitalized patients with mild symptoms, it persisted in hospitalized patients and exacerbated over time. The lack of strength and muscle soreness were both back to normal by day 4 for non-hospitalized patients. Interpretation Monitoring the trends of symptoms is more important for identifying severe cases. Excessive laboratory data and physical examination are not necessary for the evaluation of patients with mild symptoms. The system we developed is the first to convert the subjective symptoms of patients into objective scores. This type of O2O, subjective-to-objective strategy may be used in regions with similar highly infectious diseases to minimize the possibility of infection among medical staff.",
      "An Ounce of Prevention: Coronavirus (COVID-19) and Mass Gatherings Widespread, non-stop, and often sensational coverage of the coronavirus (COVID-19) has caught many governments flat-footed in efforts to protect the health and safety of their citizens. In response to the current global health event, the World Health Organization (WHO) declared COVID-19 a pandemic. Mass gatherings present a historic challenge in protecting the health and safety of attendees. The majority of the prominent mass gatherings are religious in nature. Global sporting events, such as the Olympics and the World Cup, pose unique health risks to attendees and host nations. Deferment or cancellation of such mass gatherings may exert an extraordinary economic loss to the host nation. Universal adoption of best practices for infection control is the surest way for governments to prepare for mass gatherings. In these uncertain times, it is up to intergovernmental organizations to be the voice of reason.",
      "Self-Isolation Compliance In The COVID-19 Era Influenced By Compensation: Findings From A Recent Survey In Israel. A new Coronavirus disease (COVID-19) outbreak is spreading since December 2019. In an attempt to contain the disease, health authorities call for self-quarantine of individuals suspected as exposures. Health officials assume the public will comply in high rates; however, studies suggest that a major obstacle to compliance for household quarantine is concern over loss of income. A cross sectional study of the adult population of Israel was conducted in the last week of February 2020 to assess public attitudes toward the COVID-19 outbreak. In particular, public compliance rates with self-quarantine were assessed depending on compensation for lost wages. The results suggest that when compensation was assumed, the compliance rate was 94%; yet, when compensation was removed, the compliance rate dropped to less than 57%. This study demonstrates that providing people with assurances for their livelihood during self-quarantine is an important component in compliance with public health regulations. [Editor's Note: This fast-track Ahead-of-Print article is the accepted version of the peer-reviewed manuscript. The final edited version will appear in an upcoming issue of Health Affairs.].",
      "Estimating the risk of 2019 Novel Coronavirus death during the course of the outbreak in China, 2020 Since the first case of Novel Coronavirus (2019-nCov) was identified in December 2019 in Wuhan City, China, the number of cases continues to grow across China and multiple cases have been exported to other countries. The cumulative number of reported deaths is at 637 as of February 7, 2020. Here we statistically estimated the time-delay adjusted death risk for Wuhan as well as for China excluding Wuhan to interpret the current severity of the epidemic in China. We found that the latest estimates of the death risk in Wuhan could be as high as 20% in the epicenter of the epidemic whereas we estimate it ~1% in the relatively mildly-affected areas. Because the elevated death risk estimates are likely associated with a breakdown of the medical/health system, enhanced public health interventions including social distancing and movement restrictions should be effectively implemented to bring the epidemic under control.",
      "Incidencia de la patología abdominal quirúrgica urgente durante la pandemia por SARS-CoV-2[[[en]]]Incidence of surgical abdominal emergencies during SARS-CoV-2 pandemic Resumen Introducción: Desde la aparición en diciembre de 2019 del SARS-CoV-2 en la ciudad china de Wuhan, hemos experimentado un descenso en los ingresos en nuestro Servicio y disminución de la actividad quirúrgica urgente. Por ello, el objetivo de este estudio fue analizar la incidencia de la patología abdominal urgente potencialmente quirúrgica en nuestro centro durante la epidemia por COVID-19. Métodos: Se diseñó un estudio retrospectivo que incluyó todos los pacientes ingresados por patología abdominal urgente potencialmente quirúrgica en nuestro Servicio de Cirugía General y del Aparato Digestivo desde el 24 de febrero de 2020 hasta el 19 de abril de 2020. Resultados: Se incluyeron 89 pacientes con una edad media de 58,85±22,2. La mediana de tiempo transcurrido desde el inicio de los síntomas hasta la consulta en el Servicio de Urgencias fue de 48 (P25-P75 = 24-96) horas. A su llegada a Urgencias 18 (20%) pacientes presentaban criterios de SRIS (síndrome de respuesta inflamatoria sistémica). Se realizaron 51 (57%) intervenciones quirúrgicas. La tasa de complicaciones postquirúrgicas a los 30 días fue del 31% y la tasa de mortalidad de 2%. Con respecto al mismo período de tiempo de los años 2017 a 2019, la media de ingresos desde Urgencias en nuestro Servicio descendió un 14% durante el período de epidemia. Conclusiones: Se ha producido un descenso del número de pacientes que son ingresados por patología abdominal urgente potencialmente quirúrgica durante el período de epidemia por COVID-19 en nuestro centro. Abstract Introduction: Since the appearance of SARS-CoV-2 in December 2019 in the Chinese city of Wuhan, we have experienced a reduction in admissions in our Service and a decrease in urgent surgical activity. Therefore, this study aimed to assess the incidence of potentially surgical abdominal emergency in our center during the epidemic of COVID-19. Methods: A retrospective study was designed. It included all patients admitted for urgent abdominal pathology with potential surgical treatment in our General and Digestive Surgery Department from February 24, 2020 to April 19, 2020. Results: Eighty-nine patients with a mean age of 58.85±22.2 were included. The median time from symptom onset to the Emergency Department (ED) visit was 48 (P25-P75 = 24-96) hours. On arrival at the ED, 18 (20%) patients presented with systemic inflammatory response syndrome criteria. Fifty-one (57%) surgical procedures were performed. The rate of post-surgical complications at 30 days was 31% and the mortality rate was 2%. Concerning the same period from 2017 to 2019, the mean number of admissions from the ED to our Department decreased by 14% during the epidemic period. Conclusion: There has been a decrease in the number of patients admitted for urgent, potentially surgical, abdominal pathology during the period of the COVID-19 epidemic in our center.",
      "Isolated pharmaco-mechanical thrombectomy (IPMT) for the endovascular treatment of acute axillofemoral graft occlusion. Since the long-term patency of axillofemoral (AXF) grafts is inferior to aorto-bifemoral (ABF) grafts, limb salvage procedures are crucial in this group of patients. Emerging endovascular devices have helped in the successful restoration of flow for acute limb ischemia in both native arteries as well as bypass grafts. One such device, the Trellis thrombectomy system is being used more frequently in this setting. The device has previously been used in veins, native arteries, and rarely in aortofemoral grafts. We present its first successful use for the treatment of occluded AXF bypass graft. The use of this device helped to isolate the treatment zone in the occluded graft, which allowed the use of a lower dose of thrombolytics, less systemic release of thrombolytics, and less distal embolization. Resolution of extensive clot burden was achieved and, with subsequent stenting of the graft at the distal anastomotic site, arterial flow to the leg through the AXF graft was restored and a revision surgery was avoided.",
      "Effect Of Tobacco Smoke And Respiratory Virus Infection In Preschool-aged Children",
      "Contributions and challenges of general practitioners in China fighting against the novel coronavirus crisis",
      "Protecting and Improving the Lives of Older Adults in the COVID-19 Era The COVID-19 pandemic has impacted the lives of people throughout the world, either directly, due to exposure to the virus, or indirectly, due to measures taken to mitigate the virus' effects. Older adults have been particularly hard hit, dying in disproportionately higher numbers, especially in long-term care facilities. Local, regional, and national government actions taken to mitigate the spread of COVID-19 have thus served, in part, to shield older adults from the virus, though not without adverse side effects, including increased social isolation, enhanced economic risk, revealed ageism, delayed medical treatment, and challenges getting basic needs met. This special issue of the Journal of Aging & Social Policy explores the myriad ways in which the COVID-19 pandemic has affected older adults and their families, caregivers, and communities. It proposes policies and strategies for protecting and improving the lives of older people during the pandemic. It draws lessons for aging policy and practice more generally, given underlying challenges brought to the fore by government, provider, community, and individual responses to the pandemic."
    ],
    "relevance_map": {
      "0": 1,
      "1": 1,
      "2": 1,
      "3": 1,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 1,
      "9": 0
    },
    "query_id": "query_3",
    "num_docs": 10
  },
  {
    "query": "what drugs have been active against SARS-CoV or SARS-CoV-2 in animal studies?",
    "docs": [
      "Clinical Vignettes: Donor-Derived Infections Patients undergoing solid organ transplantation (SOT) may acquire infections from the transplanted organ. Routine screening for common infections are an established part of the pretransplant evaluation of donors and recipients. Likewise, strategies exist for prophylaxis and surveillance for common donorassociated infections including hepatitis B, CMV and EBV. However, despite advances in diagnostic testing to evaluate the infectious risk of donors, unanticipated transmission of pathogens occurs, particularly when donors are asymptomatic or have subtle or unusual manifestations of a transmissible Infection. Infectious diseases (ID) providers play an integral role in donor and recipient risk assessment and can advise transplant centers on organ utilization and guide evaluation and management of the SOT recipient. Consideration of the donor cause of death and preceding clinical syndromes are important for characterizing the potential risk for recipient infection. This allows a more accurate analysis of the risk: benefit of accepting a life-saving organ and risk of infection. ID providers and transplant teams should work closely with organ procurement organizations (OPOs) to solicit additional donor information when a donor-derived infection is suspected so that reporting can be facilitated to ensure communication with the care-teams of other organ recipients from the same donors. National advisory committees work closely with federal agencies to provide oversight, guide policy development, and assess outcomes to assist with the prevention and management of donor-transmitted disease through organ transplantation. The clinical vignettes in this review highlight some of the complexities in the evaluation of potential donor transmission.",
      "Boceprevir, GC-376, and calpain inhibitors II, XII inhibit SARS-CoV-2 viral replication by targeting the viral main protease A novel coronavirus SARS-CoV-2, also called novel coronavirus 2019 (nCoV-19), started to circulate among humans around December 2019, and it is now widespread as a global pandemic. The disease caused by SARS-CoV-2 virus is called COVID-19, which is highly contagious and has an overall mortality rate of 6.96% as of May 4, 2020. There is no vaccine or antiviral available for SARS-CoV-2. In this study, we report our discovery of inhibitors targeting the SARS-CoV-2 main protease (M(pro)). Using the FRET-based enzymatic assay, several inhibitors including boceprevir, GC-376, and calpain inhibitors II, and XII were identified to have potent activity with single-digit to submicromolar IC(50) values in the enzymatic assay. The mechanism of action of the hits was further characterized using enzyme kinetic studies, thermal shift binding assays, and native mass spectrometry. Significantly, four compounds (boceprevir, GC-376, calpain inhibitors II and XII) inhibit SARS-CoV-2 viral replication in cell culture with EC(50) values ranging from 0.49 to 3.37 μM. Notably, boceprevir, calpain inhibitors II and XII represent novel chemotypes that are distinct from known M(pro) inhibitors. A complex crystal structure of SARS-CoV-2 M(pro) with GC-376, determined at 2.15 Å resolution with three monomers per asymmetric unit, revealed two unique binding configurations, shedding light on the molecular interactions and protein conformational flexibility underlying substrate and inhibitor binding by M(pro). Overall, the compounds identified herein provide promising starting points for the further development of SARS-CoV-2 therapeutics.",
      "Screening of an FDA-approved compound library identifies four small-molecule inhibitors of Middle East respiratory syndrome coronavirus replication in cell culture. Coronaviruses can cause respiratory and enteric disease in a wide variety of human and animal hosts. The 2003 outbreak of severe acute respiratory syndrome (SARS) first demonstrated the potentially lethal consequences of zoonotic coronavirus infections in humans. In 2012, a similar previously unknown coronavirus emerged, Middle East respiratory syndrome coronavirus (MERS-CoV), thus far causing over 650 laboratory-confirmed infections, with an unexplained steep rise in the number of cases being recorded over recent months. The human MERS fatality rate of ∼ 30% is alarmingly high, even though many deaths were associated with underlying medical conditions. Registered therapeutics for the treatment of coronavirus infections are not available. Moreover, the pace of drug development and registration for human use is generally incompatible with strategies to combat emerging infectious diseases. Therefore, we have screened a library of 348 FDA-approved drugs for anti-MERS-CoV activity in cell culture. If such compounds proved sufficiently potent, their efficacy might be directly assessed in MERS patients. We identified four compounds (chloroquine, chlorpromazine, loperamide, and lopinavir) inhibiting MERS-CoV replication in the low-micromolar range (50% effective concentrations [EC(50)s], 3 to 8 μM). Moreover, these compounds also inhibit the replication of SARS coronavirus and human coronavirus 229E. Although their protective activity (alone or in combination) remains to be assessed in animal models, our findings may offer a starting point for treatment of patients infected with zoonotic coronaviruses like MERS-CoV. Although they may not necessarily reduce viral replication to very low levels, a moderate viral load reduction may create a window during which to mount a protective immune response.",
      "The anti‐HIV drug nelfinavir mesylate (Viracept) is a potent inhibitor of cell fusion caused by the SARSCoV‐2 spike (S) glycoprotein warranting further evaluation as an antiviral against COVID‐19 infections Severe acute respiratory syndrome coronavirus‐2 (SARS CoV‐2) is the causative agent of the coronavirus disease‐2019 (COVID‐19) pandemic. Coronaviruses enter cells via fusion of the viral envelope with the plasma membrane and/or via fusion of the viral envelope with endosomal membranes after virion endocytosis. The spike (S) glycoprotein is a major determinant of virus infectivity. Herein, we show that the transient expression of the SARS CoV‐2 S glycoprotein in Vero cells caused extensive cell fusion (formation of syncytia) in comparison to limited cell fusion caused by the SARS S glycoprotein. Both S glycoproteins were detected intracellularly and on transfected Vero cell surfaces. These results are in agreement with published pathology observations of extensive syncytia formation in lung tissues of patients with COVID‐19. These results suggest that SARS CoV‐2 is able to spread from cell‐to‐cell much more efficiently than SARS effectively avoiding extracellular neutralizing antibodies. A systematic screening of several drugs including cardiac glycosides and kinase inhibitors and inhibitors of human immunodeficiency virus (HIV) entry revealed that only the FDA‐approved HIV protease inhibitor, nelfinavir mesylate (Viracept) drastically inhibited S‐n‐ and S‐o‐mediated cell fusion with complete inhibition at a 10‐μM concentration. In‐silico docking experiments suggested the possibility that nelfinavir may bind inside the S trimer structure, proximal to the S2 amino terminus directly inhibiting S‐n‐ and S‐o‐mediated membrane fusion. Also, it is possible that nelfinavir may act to inhibit S proteolytic processing within cells. These results warrant further investigations of the potential of nelfinavir mesylate to inhibit virus spread at early times after SARS CoV‐2 symptoms appear.",
      "Complete protection against severe acute respiratory syndrome coronavirus-mediated lethal respiratory disease in aged mice by immunization with a mouse-adapted virus lacking E protein. Zoonotic coronaviruses, including the one that caused severe acute respiratory syndrome (SARS), cause significant morbidity and mortality in humans. No specific therapy for any human coronavirus is available, making vaccine development critical for protection against these viruses. We previously showed that recombinant SARS coronavirus (SARS-CoV) (Urbani strain based) lacking envelope (E) protein expression (rU-ΔE) provided good but not perfect protection in young mice against challenge with virulent mouse-adapted SARS-CoV (MA15). To improve vaccine efficacy, we developed a second set of E-deleted vaccine candidates on an MA15 background (rMA15-ΔE). rMA15-ΔE is safe, causing no disease in 6-week-, 12-month-, or 18-month-old BALB/c mice. Immunization with this virus completely protected mice of three ages from lethal disease and effected more-rapid virus clearance. Compared to rU-ΔE, rMA15-ΔE immunization resulted in significantly greater neutralizing antibody and SARS-CoV-specific CD4 and CD8 T cell responses. After challenge, inflammatory cell infiltration, edema, and lung destruction were decreased in the lungs of rMA15-ΔE-immunized mice compared to those in rU-ΔE-immunized 12-month-old mice. Collectively, these results show that immunization with a species-adapted attenuated coronavirus lacking E protein expression is safe and provides optimal immunogenicity and long-term protection against challenge with lethal virus. This approach will be generally useful for development of vaccines protective against human coronaviruses as well as against coronaviruses that cause disease in domestic and companion animals.",
      "Downgrading disease transmission risk estimates using terminal importations As emerging and re-emerging infectious diseases like dengue, Ebola, chikungunya, and Zika threaten new populations worldwide, officials scramble to assess local severity and transmissibility, with little to no epidemiological history to draw upon. Standard methods for assessing autochthonous (local) transmission risk make either indirect estimates based on ecological suitability or direct estimates only after local cases accumulate. However, an overlooked source of epidemiological data that can meaningfully inform risk assessments prior to outbreak emergence is the absence of transmission by imported cases. Here, we present a method for updating a priori ecological estimates of transmission risk using real-time importation data. We demonstrate our method using Zika importation and transmission data from Texas in 2016, a high-risk region in the southern United States. Our updated risk estimates are lower than previously reported, with only six counties in Texas likely to sustain a Zika epidemic, and consistent with the number of autochthonous cases detected in 2017. Importation events can thereby provide critical, early insight into local transmission risks as infectious diseases expand their global reach.",
      "Molecular Basis for ADP-ribose Binding to the Macro-X Domain of SARS-CoV-2 Nsp3 The virus that causes COVID-19, SARS-CoV-2, has a large RNA genome that encodes numerous proteins that might be targets for antiviral drugs. Some of these proteins, such as the RNA-dependent RNA polymers, helicase and main protease, are well conserved between SARS-CoV-2 and the original SARS virus, but several others are not. This study examines one of the proteins encoded by SARS-CoV-2 that is most different, a macrodomain of nonstructural protein 3 (nsp3). Although 26% of the amino acids in this SARS-CoV-2 macrodomain differ from those seen in other coronaviruses, biochemical and structural data reveal that the protein retains the ability to bind ADP-ribose, which is an important characteristic of beta coronaviruses, and potential therapeutic target.",
      "Neural reflex pathways in intestinal inflammation: hypotheses to viable therapy. Studies in neuroscience and immunology have clarified much of the anatomical and cellular basis for bidirectional interactions between the nervous and immune systems. As with other organs, intestinal immune responses and the development of immunity seems to be modulated by neural reflexes. Sympathetic immune modulation and reflexes are well described, and in the past decade the parasympathetic efferent vagus nerve has been added to this immune-regulation network. This system, designated 'the inflammatory reflex', comprises an afferent arm that senses inflammation and an efferent arm that inhibits innate immune responses. Intervention in this system as an innovative principle is currently being tested in pioneering trials of vagus nerve stimulation using implantable devices to treat IBD. Patients benefit from this treatment, but some of the working mechanisms remain to be established, for instance, treatment is effective despite the vagus nerve not always directly innervating the inflamed tissue. In this Review, we will focus on the direct neuronal regulatory mechanisms of immunity in the intestine, taking into account current advances regarding the innervation of the spleen and lymphoid organs, with a focus on the potential for treatment in IBD and other gastrointestinal pathologies.",
      "Non-Human Primate Models of Enteric Viral Infections There is an important role non-human primates (NHP) play in biomedical research. Phylogenetic proximity of any of the NHP species to Homo sapiens assures that much better translatability of research outcomes from model studies involving human diseases can be achieved than from those generated with other pre-clinical systems. Our group and others used during past two decades NHPs in research directed towards viral and autoimmune disorders of the gastrointestinal tract. This review summarizes progress made in the area of enteric viral infections including its applicability to human disease.",
      "Differentially expressed non-coding RNAs induced by transmissible gastroenteritis virus potentially regulate inflammation and NF-κB pathway in porcine intestinal epithelial cell line BACKGROUND: Transmissible gastroenteritis virus (TGEV) infection can activate NF-κB pathway in porcine intestinal epithelial cells and result in severe inflammation. Non-coding RNAs (ncRNAs) are not translated into proteins and play an important role in many biological and pathological processes such as inflammation, viral infection, and mitochondrial damage. However, whether ncRNAs participate in TGEV-induced inflammation in porcine intestinal epithelial cells is largely unknown. RESULTS: In this study, the next-generation sequencing (NGS) technology was used to analyze the profiles of mRNAs, miRNAs, and circRNAs in Mock- and TGEV-infected intestinal porcine epithelial cell-jejunum 2 (IPEC-J2) cell line. A total of 523 mRNAs, 65 microRNAs (miRNAs), and 123 circular RNAs (circRNAs) were differentially expressed. Kyoto Encyclopedia of Genes and Genomes (KEGG) analysis showed differentially expressed mRNAs were linked to inflammation-related pathways, including NF-κB, Toll-like receptor, NOD-like receptor, Jak-STAT, TNF, and RIG-I-like receptor pathways. The interactions among mRNA, miRNA, and circRNA were analyzed. The data showed that ssc_circ_009380 and miR-22 might have interaction relationship. Dual-luciferase reporter assay confirmed that miR-22 directly bound to ssc_circ_009380. We also observed that overexpression of miR-22 led to a reduction of p-IκB-α and accumulation of p65 in nucleus in TGEV-infected IPEC-J2 cells. In contrast, inhibition of miR-22 had the opposite effects. Moreover, silencing of ssc_circ_009380 inhibited accumulation of p65 in nucleus and phosphorylation of IκB-α. CONCLUSIONS: The data revealed that differentially expressed mRNAs and ncRNAs were primarily enriched in inflammation-related pathways and ssc_circ_009380 promoted activation of NF-κB pathway by binding miR-22 during TGEV-induced inflammation. ELECTRONIC SUPPLEMENTARY MATERIAL: The online version of this article (10.1186/s12864-018-5128-5) contains supplementary material, which is available to authorized users."
    ],
    "relevance_map": {
      "0": 0,
      "1": 1,
      "2": 1,
      "3": 1,
      "4": 1,
      "5": 0,
      "6": 1,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "query_4",
    "num_docs": 10
  },
  {
    "query": "what evidence is there for dexamethasone as a treatment for COVID-19?",
    "docs": [
      "High SARS-CoV-2 Attack Rate Following Exposure at a Choir Practice - Skagit County, Washington, March 2020. On March 17, 2020, a member of a Skagit County, Washington, choir informed Skagit County Public Health (SCPH) that several members of the 122-member choir had become ill. Three persons, two from Skagit County and one from another area, had test results positive for SARS-CoV-2, the virus that causes coronavirus disease 2019 (COVID-19). Another 25 persons had compatible symptoms. SCPH obtained the choir's member list and began an investigation on March 18. Among 61 persons who attended a March 10 choir practice at which one person was known to be symptomatic, 53 cases were identified, including 33 confirmed and 20 probable cases (secondary attack rates of 53.3% among confirmed cases and 86.7% among all cases). Three of the 53 persons who became ill were hospitalized (5.7%), and two died (3.7%). The 2.5-hour singing practice provided several opportunities for droplet and fomite transmission, including members sitting close to one another, sharing snacks, and stacking chairs at the end of the practice. The act of singing, itself, might have contributed to transmission through emission of aerosols, which is affected by loudness of vocalization (1). Certain persons, known as superemitters, who release more aerosol particles during speech than do their peers, might have contributed to this and previously reported COVID-19 superspreading events (2-5). These data demonstrate the high transmissibility of SARS-CoV-2 and the possibility of superemitters contributing to broad transmission in certain unique activities and circumstances. It is recommended that persons avoid face-to-face contact with others, not gather in groups, avoid crowded places, maintain physical distancing of at least 6 feet to reduce transmission, and wear cloth face coverings in public settings where other social distancing measures are difficult to maintain.",
      "The Combination of Tocilizumab and Methylprednisolone Along With Initial Lung Recruitment Strategy in Coronavirus Disease 2019 Patients Requiring Mechanical Ventilation: A Series of 21 Consecutive Cases OBJECTIVE: To describe the outcomes with use of a combination of tocilizumab and methylprednisolone administered around the time of endotracheal intubation in patients with confirmed coronavirus disease 2019-associated hypoxemic respiratory failure requiring mechanical ventilation. DATA SOURCES: Retrospective chart review. STUDY SELECTION/DATA EXTRACTION: Twenty-one consecutive patients with confirmed coronavirus disease 2019-associated hypoxemic respiratory failure requiring mechanical ventilation. Initial ventilator parameters were positive end-expiratory pressure 14 cm H(2)o and target plateau pressure 29 cm H(2)o to maximize lung recruitment. Methylprednisolone (125 mg every 6hr for 24 hr with tapering to 60 mg every 12 hr) was administered shortly after patients were intubated (median 11 hr after intubation). DATA SYNTHESIS: No patient in the cohort died while hospitalized (mortality, 0%; 95% CI, 0%–18%) and 18 patients have been discharged from the acute care setting. Twenty of 21 patients (95%) have been liberated from mechanical ventilation after a median duration of 8 days (range, 4–30 d). Following 48 hours of methylprednisolone, the A-a o(2) gradient decreased from 455 ± 103 to 228 ± 109 mm Hg (difference 227 ± 108 mm Hg; p < 0.01). CONCLUSIONS: Our positive experience with tocilizumab in combination with methylprednisolone started early after endotracheal intubation may be one avenue for reducing the morbidity and mortality seen with severe coronavirus disease 2019 and merits further exploration in clinical studies.",
      "Emergency Palliative Care Planning and Support in a COVID-19 Pandemic.",
      "What can we learn about corticosteroid therapy as a treatment for COVID-19?",
      "NMR assignment of the nonstructural protein nsp3(1066–1181) from SARS-CoV Sequence-specific NMR assignments of the globular core comprising the residues 1066–1181 within the non-structural protein nsp3e from the SARS coronavirus have been obtained using triple-resonance NMR experiments with the uniformly [(13)C,(15)N]-labeled protein. The backbone and side chain assignments are nearly complete, providing the basis for the ongoing NMR structure determination. A preliminary identification of regular secondary structures has been derived from the (13)C chemical shifts.",
      "Targeting inflammation and cytokine storm in COVID-19",
      "Punica granatum L. Leaf Extract Attenuates Lung Inflammation in Mice with Acute Lung Injury The hydroalcoholic extract of Punica granatum (pomegranate) leaves was previously demonstrated to be anti-inflammatory in a rat model of lipopolysaccharide- (LPS-) induced acute peritonitis. Here, we investigated the anti-inflammatory effects of the ethyl acetate fraction obtained from the pomegranate leaf hydroalcoholic extract (EAFPg) on the LPS-induced acute lung injury (ALI) mouse model. Male Swiss mice received either EAFPg at different doses or dexamethasone (per os) prior to LPS intranasal instillation. Vehicle-treated mice were used as controls. Animals were culled at 4 h after LPS challenge, and the bronchoalveolar lavage fluid (BALF) and lung samples were collected for analysis. EAFPg and kaempferol effects on NO and cytokine production by LPS-stimulated RAW 264.7 macrophages were also investigated. Pretreatment with EAFPg (100–300 mg/kg) markedly reduced cell accumulation (specially neutrophils) and collagen deposition in the lungs of ALI mice. The same animals presented with reduced lung and BALF TNF-α and IL-1β expression in comparison with vehicle controls (p < 0.05). Additionally, incubation with either EAFPg or kaempferol (100 μg/ml) reduced NO production and cytokine gene expression in cultured LPS-treated RAW 264.7 macrophages. Overall, these results demonstrate that the prophylactic treatment with EAFPg attenuates acute lung inflammation. We suggest this fraction may be useful in treating ALI.",
      "Mortality, Admissions, and Patient Census at SNFs in 3 US Cities During the COVID-19 Pandemic.",
      "Systematic and Statistical Review of Coronavirus Disease 19 Treatment Trials The following systematic review and meta-analysis compile the current data regarding human controlled COVID-19 treatment trials. An electronic search of the literature compiled studies pertaining to human controlled treatment trials with COVID-19. Medications assessed included lopinavir/ritonavir, arbidol, hydroxychloroquine, tocilizumab, favipiravir, heparin, and dexamethasone. Statistical analyses were performed for common viral clearance endpoints whenever possible. Lopinavir/ritonavir showed no significant effect on viral clearance for COVID-19 cases (OR 0.95 [95% CI 0.50–1.83]). Hydroxychloroquine also showed no significant effect on COVID-19 viral clearance rates (OR 2.16 [95% CI 0.80–5.84]). Arbidol showed no 7-day (OR 1.63 [95% CI 0.76–3.50]) or 14-day viral (OR 5.37 [95% CI 0.35–83.30]) clearance difference compared to lopinavir/ritonavir. Review of literature showed no significant clinical improvement with lopinavir/ritonavir, arbidol, hydroxychloroquine, or remdesivir. Tocilizumab showed mixed results regarding survival. Favipiravir showed quicker symptom improvement compared to lopinavir/ritonavir and arbidol. Heparin and dexamethasone showed improvement with severe COVID-19 cases requiring supplemental oxygenation. Current medications do not show significant effect on COVID-19 viral clearance rates. Tocilizumab showed mixed results regarding survival. Favipiravir shows favorable results compared to other tested medications. Heparin and dexamethasone show benefit especially for severe COVID-19 cases.",
      "Running a Radiation Oncology Department at the time of coronavirus: an Italian experience Starting from Wuhan, China, SARS-CoV-2 has been a catastrophic epidemic involving many countries worldwide. After China, Italy has been heavily affected and severe measures to limit the spread have been taken in the last weeks. Radiation Oncology departments must guarantee optimal cancer treatments even in such a challenging scenario of an ongoing aggressive epidemic. Adopted preventive measures and recommendations are highlighted for patients, professionals and clinical operations to minimize the risk of infection while safely treating cancer patients."
    ],
    "relevance_map": {
      "0": 0,
      "1": 1,
      "2": 0,
      "3": 1,
      "4": 0,
      "5": 1,
      "6": 1,
      "7": 0,
      "8": 1,
      "9": 0
    },
    "query_id": "query_5",
    "num_docs": 10
  },
  {
    "query": "what is known about those infected with Covid-19 but are asymptomatic?",
    "docs": [
      "Discriminating Mild from Critical COVID-19 by Innate and Adaptive Immune Single-cell Profiling of Bronchoalveolar Lavages How innate and adaptive lung immune responses to SARS-CoV-2 synchronize during COVID-19 pneumonitis and regulate disease severity is poorly established. To address this, we applied single-cell profiling to bronchoalveolar lavages from 44 patients with mild or critical COVID-19 versus non-COVID-19 pneumonia as control. Viral RNA-tracking delineated the infection phenotype to epithelial cells, but positioned mainly neutrophils at the forefront of viral clearance activity during COVID-19. In mild disease, neutrophils could execute their antiviral function in an immunologically ‘controlled’ fashion, regulated by fully-differentiated T-helper-17 (TH17)-cells, as well as T-helper-1 (TH1)-cells, CD8+ resident-memory (TRM) and partially-exhausted (TEX) T-cells with good effector functions. This was paralleled by ‘orderly’ phagocytic disposal of dead/stressed cells by fully-differentiated macrophages, otherwise characterized by anti-inflammatory and antigen-presenting characteristics, hence facilitating lung tissue repair. In critical disease, CD4+ TH1- and CD8+ TEX-cells were characterized by inflammation-associated stress and metabolic exhaustion, while CD4+ TH17- and CD8+ TRM-cells failed to differentiate. Consequently, T-cell effector function was largely impaired thereby possibly facilitating excessive neutrophil-based inflammation. This was accompanied by impaired monocyte-to-macrophage differentiation, with monocytes exhibiting an ATP-purinergic signalling-inflammasome footprint, thereby enabling COVID-19 associated fibrosis and worsening disease severity. Our work represents a major resource for understanding the lung-localised immunity and inflammation landscape during COVID-19.",
      "COVID‐19 and the use of immunomodulatory and biologic agents for severe cutaneous disease: An Australian/New Zealand consensus statement Patients on immunomodulators, including biologic agents and new small molecular inhibitors, for cutaneous disease, represent a potentially vulnerable population during the COVID‐19 pandemic. There is currently insufficient evidence to determine whether patients on systemic immunomodulators are at increased risk of developing COVID‐19 disease or more likely to have severe disease. As such, clinicians need to assess the benefit‐to‐risk ratio on a case‐by‐case basis. In patients with suspected or confirmed COVID‐19 disease, all immunomodulators used for skin diseases should be immediately withheld, with the possible exception of systemic corticosteroid therapy, which needs to be weaned. In patients who develop symptoms or signs of an upper respiratory tract infection, but COVID‐19 is not yet confirmed, consider dose reduction or temporarily cessation for 1–2 weeks. In otherwise well patients, immunomodulators and biologics should be continued. In all patients, and their immediate close contacts, the importance of preventative measures to minimise human‐to‐human transmission cannot be overemphasised.",
      "Hemophagocytic lymphohistiocytosis. Hemophagocytic lymphohistiocytosis (HLH) is a rare syndrome of widespread inflammation due to massive amounts of cytokines released from activated macrophages. The most common trigger for HLH is infection from a virus, most commonly Epstein-Barr virus. Here we report an adult case of this rare and life-threatening syndrome.",
      "Full spectrum of COVID-19 severity still being depicted",
      "Transmission routes of Covid-19 virus in the Diamond Princess Cruise ship Background: An outbreak of COVID-19 occurred on the Diamond Princess cruise ship in January and February 2020. We analysed information about cases to infer transmission dynamics and potential modes of transmission. Methods: We collected the daily number of 197 symptomatic cases, and that of the 146 passenger cases in two categories, i.e. those who stayed and did not stay in the same stateroom. We retrieved the quarantine details and the ship's 14-day itinerary. We searched the websites of national/local health authority along the cruise routes and local news using Google for locally confirmed cases associated with the ship. We obtained the design of air conditioning and sewage treatment of the ship from literature. We back-calculated the dates of infection from the epidemic curve and compared with the start of on-board quarantine. Results: Major infections started on Jan 28 and completed by Feb 6 for passengers except those who stayed in the same stateroom with infected individual(s). No other confirmed cases were identified among the disembarked people in Hong Kong except an 80 years old passenger. No confirmed cases were reported in three other stopovers between Jan 27-31 associated with disembarked passengers or visitors from the ship, however two Okinawa taxi drivers became confirmed cases in association with driving the ship passengers. Infection among passengers after Feb 6 was limited to those who stayed in the same stateroom with an infected passenger. Infections in crew members peaked on Feb 7, suggesting significant transmission among crew members after quarantine on Feb 5. Conclusions: We infer that the ship central air conditioning system did not play a role, i.e. the long-range airborne route was absent in the outbreak. Most transmission appears to have occurred through close contact and fomites.",
      "ACE 2 Coding Variants: A Potential X-linked Risk Factor for COVID-19 Disease Viral genetic variants are widely known to influence disease progression among infected humans. Given the recent and rapid emergence of pandemic SARS-CoV-2 infection, the cause of COVID-19 disease, viral protein variants have attracted research interest. However, little has yet been written about genetic risk factors among human hosts. Human genetic variation has proven to affect disease progression and outcome for important diseases such as HIV infection and malaria infestation. The fact that the human ACE2 protein is encoded on the X chromosome means that males who carry rare ACE2 coding variants will express those variants in all ACE2-expressing cells, whereas females will typically express those variants in a mosaic distribution determined by early X-inactivation events. This sex-based difference in ACE2 expression has unique implications for epidemiological studies designed to assess host genetic factors influencing progression from asymptomatic SARS-coV-2 infection to COVID-19. Here we present theoretical modelling of rare ACE2 coding variants documented to occur naturally in several human superpopulations and subpopulations, and show that rare variants predicted to affect the binding of ACE2 to the SARS-CoV-2 spike protein exist in people. Though the rs4646116 (p.Lys26Arg) allele is found in 1 in 70 Ashkenazi Jewish males, and in 1 in 172 non-Finnish European males, this allele is found at higher frequencies in females. Furthermore, the class of missense ACE2 alleles predicted to affect SARS-CoV-2 binding are found in aggregate among 1.43% and 2.16% of Ashkenazi males and females, respectively, as well as in 0.58% and 1.24% of European males and females outside of Finland. These alleles are rarer in other population groups, and almost absent from East Asians genotyped to date. Though we are aware that full genome-wide and exome-wide sequencing studies may ultimately be required to assess human genetic susceptibility to SARS-CoV-2 fully, we argue on the basis of strong prior probabilities that genotyping of this class of alleles is justified in cases of atypical SARS-CoV-2 diseases, such as asymptomatic super-spreaders (if any are identified), and in neonatal/paediatric-onset COVID-19 disease. Even relatively rare susceptibility factors (1% or fewer carriers) may become quantitatively important in the context of hundreds of thousands of infections. A small number of asymptomatic carriers, or a small number of super-spreaders, or a small segment of the population that is disproportionately likely to require intensive care, can magnify the medical, social and economic impacts of a pandemic of this size. The speed of the pandemic and the large number of affected cases worldwide justify efforts to identify all possible risk factors for adverse outcomes, including efforts to identify genetic susceptibility factors in human hosts.",
      "In vitro evaluation of palm fronds as feedstuff on ruminal digestibility and gas production/ Avaliação in vitro das folhas de palmeiras como alimento de digestibilidade de ruminais e produção de gás This study was carried out to evaluate using palm fronds only or supplemented with fibrolytic enzymes as alternative roughage on the ruminal nutrients digestibility and gas production. Treatments were: clover hay (Trifolium alexandrinum), palm fronds only and palm fronds plus fibrolytic enzymes (enzymes were mixed with palm fronds in rate of 4 g kg-1 of dry matter (DM). The results showed a reduction (p < 0.05) in gas production, ammoniac nitrogen (NH3-N, DM and organic matter (OM) digestibility in palm fronds compared with clover hay. While supplementing palm fronds with fibrolytic enzymes improved DM and OM digestibility compared with palm fronds only without (p < 0.05) differences with clover hay. Also, supplementing palm fronds with fibrolytic enzymes reduced (p < 0.05) gas production compared with other treatments. It could be concluded that adding fibrolytic enzymes improved the utilization of palm fronds as alternative roughage without negative effect on nutrients digestibility and reduced gas production which improve the environmental aspects of feeding ruminant animals.(AU)",
      "From COVID-19 research to vaccine application: why might it take 17 months not 17 years and what are the wider lessons? It is often said that it takes 17 years to move medical research from bench to bedside. In a coronavirus disease (COVID-19) world, such time-lags feel intolerable. In these extraordinary circumstances could years be made into months? If so, could those lessons be used to accelerate medical research when the crisis eases? To measure time-lags in health and biomedical research as well as to identify ways of reducing them, we developed and published (in 2015) a matrix consisting of overlapping tracks (or stages/phases) in the translation from discovery research to developed products, policies and practice. The matrix aids analysis by highlighting the time and actions required to develop research (and its translation) both (1) along each track and (2) from one track to another, e.g. from the discovery track to the research-in-humans track. We noted four main approaches to reducing time-lags, namely increasing resources, working in parallel, starting or working at risk, and improving processes. Examining these approaches alongside the matrix helps interpret the enormous global effort to develop a vaccine for the 2019 novel coronavirus SARS-CoV-2, the causative agent of COVID-19. Rapid progress in the discovery/basic and human research tracks is being made through a combination of large-scale funding, work being conducted in parallel (between different teams globally and through working in overlapping tracks), working at greater (but proportionate) risk to safety than usual, and adopting various new processes. The overlapping work of some of the teams involves continuing animal research whilst entering vaccine candidates into Phase I trials alongside planning their Phase II trials. The additional funding available helps to reduce some of the usual financial risks in moving so quickly. Going forward through the increasingly large human trials for safety, dosage and efficacy, it will be vital to overlap work in parallel in the often challenging public policy and clinical tracks. Thus, regulatory and reimbursement bodies are beginning and preparing rapid action to pull vaccines proving to be safe and effective through to extraordinarily rapid application to the general population. Monitoring the development of a COVID-19 vaccine using the matrix (modified as necessary) could help identify which of the approaches speeding development and deployment could be usefully applied more widely in the future.",
      "COVID-19: What paramedics need to know!",
      "Modelling the epidemiological trend and behavior of COVID-19 in Italy As of March 16, 2020, over 185,000 across the world, Italy became the red hotspot for the COVID-19 pandemic after China. With over 35,000 cases and 2900 deaths reported in the month of March in Italy, it is necessary to stimulate epidemic trend to understand the behavior of COVID-19 in Italy. By S.E.I.R. simulation, we estimated the most representative epidemic parameters occurred from March 1 to 14, 2020, thus being able to evaluate the consistency of the containment rules and identify possible Sars-Cov-2 local mutations. Our estimations are based on some assumptions and limitations exited."
    ],
    "relevance_map": {
      "0": 0,
      "1": 0,
      "2": 0,
      "3": 1,
      "4": 1,
      "5": 1,
      "6": 0,
      "7": 0,
      "8": 1,
      "9": 1
    },
    "query_id": "query_6",
    "num_docs": 10
  },
  {
    "query": "has social distancing had an impact on slowing the spread of COVID-19?",
    "docs": [
      "Zn(2+) Inhibits Coronavirus and Arterivirus RNA Polymerase Activity In Vitro and Zinc Ionophores Block the Replication of These Viruses in Cell Culture Increasing the intracellular Zn(2+) concentration with zinc-ionophores like pyrithione (PT) can efficiently impair the replication of a variety of RNA viruses, including poliovirus and influenza virus. For some viruses this effect has been attributed to interference with viral polyprotein processing. In this study we demonstrate that the combination of Zn(2+) and PT at low concentrations (2 µM Zn(2+) and 2 µM PT) inhibits the replication of SARS-coronavirus (SARS-CoV) and equine arteritis virus (EAV) in cell culture. The RNA synthesis of these two distantly related nidoviruses is catalyzed by an RNA-dependent RNA polymerase (RdRp), which is the core enzyme of their multiprotein replication and transcription complex (RTC). Using an activity assay for RTCs isolated from cells infected with SARS-CoV or EAV—thus eliminating the need for PT to transport Zn(2+) across the plasma membrane—we show that Zn(2+) efficiently inhibits the RNA-synthesizing activity of the RTCs of both viruses. Enzymatic studies using recombinant RdRps (SARS-CoV nsp12 and EAV nsp9) purified from E. coli subsequently revealed that Zn(2+) directly inhibited the in vitro activity of both nidovirus polymerases. More specifically, Zn(2+) was found to block the initiation step of EAV RNA synthesis, whereas in the case of the SARS-CoV RdRp elongation was inhibited and template binding reduced. By chelating Zn(2+) with MgEDTA, the inhibitory effect of the divalent cation could be reversed, which provides a novel experimental tool for in vitro studies of the molecular details of nidovirus replication and transcription.",
      "A Focus on Covid-19: Fast and Accurate Information to Guide Management for Pandemic-Related Issues in Cardiac Patients",
      "Interrogation of safety and efficacy of home-use light-based devices. We read with interest the short paper describing, and commend the authors on sharing their experience the continued use of phototherapy in COVID-19 affected Italy. Phototherapy is undoubtedly a long-established, relatively safe means of reducing the burden of inflammatory skin disease avoiding large doses of immunosuppression. Home phototherapy devices and services have a long-established use in many countries throughout the world, as described in previous issues of this journal.",
      "Increased Detection coupled with Social Distancing and Health Capacity Planning Reduce the Burden of COVID-19 Cases and Fatalities: A Proof of Concept Study using a Stochastic Computational Simulation Model Objective: In absence of any vaccine, the Corona Virus Disease 2019 (COVID-19) pandemic is being contained through a non-pharmaceutical measure termed Social Distancing (SD). However, whether SD alone is enough to flatten the epidemic curve is debatable. Using a Stochastic Computational Simulation Model, we investigated the impact of increasing SD, hospital beds and COVID-19 detection rates in preventing COVID-19 cases and fatalities. Research Design and Methods: The Stochastic Simulation Model was built using the EpiModel package in R. As a proof of concept study, we ran the simulation on Kasaragod, the most affected district in Kerala. We added 3 compartments to the SEIR model to obtain a SEIQHRF (Susceptible-Exposed-Infectious-Quarantined-Hospitalised-Recovered-Fatal) model. Results: Implementing SD only delayed the appearance of peak prevalence of COVID-19 cases. Doubling of hospital beds could not reduce the fatal cases probably due to its overwhelming number compared to the hospital beds. Increasing detection rates could significantly flatten the curve and reduce the peak prevalence of cases (increasing detection rate by 5 times could reduce case number to half). Conclusions: An effective strategy to contain the epidemic spread of COVID-19 in India is to increase detection rates in combination with SD measures and increase in hospital beds.",
      "Transmission of Respiratory Infectious Diseases between Neighboring Cities using Agent-based Model and Compartmental Model We formulate an agent-based model and a compartmental model (SEIR) that simulate the spread of a respiratory infectious disease between two neighboring cities. We consider preventive measures such as implementation of social distancing and lockdown in a city, as well as the effect of protective gears or practices. The chance of travelling to another city and within the city during lockdown, and initial percentage of exposed and infected individuals on both cities influence the increase in the number of newly-infected individuals on both models. Our simulations show that (i) increase in exposed individuals results in increase in number of new infections, hence the need for increased testing-isolation efforts; (ii) protection level of 75-100% effectiveness impedes disease transmission; (iii) travelling within city or to other city can be an option given that strict preventive measures (e.g., non-pharmaceutical interventions) are observed; and (iv) the ideal set-up for neighboring cities is to implement lockdown when there is high risk of disease local transmission while individuals observe social distancing, maximizing protective measures, and isolating those that are exposed. The results of the agent-based and compartmental models show similar qualitative dynamics; the differences are due to different spatio-temporal heterogeneity and stochasticity. These models can aid decision makers in designing infectious disease-related policies to protect individuals while continuing population movement.",
      "The effect of control strategies to reduce social mixing on outcomes of the COVID-19 epidemic in Wuhan, China: a modelling study BACKGROUND: In December, 2019, severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), a novel coronavirus, emerged in Wuhan, China. Since then, the city of Wuhan has taken unprecedented measures in response to the outbreak, including extended school and workplace closures. We aimed to estimate the effects of physical distancing measures on the progression of the COVID-19 epidemic, hoping to provide some insights for the rest of the world. METHODS: To examine how changes in population mixing have affected outbreak progression in Wuhan, we used synthetic location-specific contact patterns in Wuhan and adapted these in the presence of school closures, extended workplace closures, and a reduction in mixing in the general community. Using these matrices and the latest estimates of the epidemiological parameters of the Wuhan outbreak, we simulated the ongoing trajectory of an outbreak in Wuhan using an age-structured susceptible-exposed-infected-removed (SEIR) model for several physical distancing measures. We fitted the latest estimates of epidemic parameters from a transmission model to data on local and internationally exported cases from Wuhan in an age-structured epidemic framework and investigated the age distribution of cases. We also simulated lifting of the control measures by allowing people to return to work in a phased-in way and looked at the effects of returning to work at different stages of the underlying outbreak (at the beginning of March or April). FINDINGS: Our projections show that physical distancing measures were most effective if the staggered return to work was at the beginning of April; this reduced the median number of infections by more than 92% (IQR 66-97) and 24% (13-90) in mid-2020 and end-2020, respectively. There are benefits to sustaining these measures until April in terms of delaying and reducing the height of the peak, median epidemic size at end-2020, and affording health-care systems more time to expand and respond. However, the modelled effects of physical distancing measures vary by the duration of infectiousness and the role school children have in the epidemic. INTERPRETATION: Restrictions on activities in Wuhan, if maintained until April, would probably help to delay the epidemic peak. Our projections suggest that premature and sudden lifting of interventions could lead to an earlier secondary peak, which could be flattened by relaxing the interventions gradually. However, there are limitations to our analysis, including large uncertainties around estimates of R0 and the duration of infectiousness. FUNDING: Bill & Melinda Gates Foundation, National Institute for Health Research, Wellcome Trust, and Health Data Research UK.",
      "Disruption of healthcare: Will the COVID pandemic worsen non-COVID outcomes and disease outbreaks?",
      "Evaluating the effectiveness of social distancing interventions against COVID-19 SARS-CoV-2 has infected over 140,000 people as of March 14, 2020. We use a mathematical model to investigate the effectiveness of social distancing interventions lasting six weeks in a middle-sized city in the US. We explore four social distancing strategies by reducing the contacts of adults over 60 years old, adults over 60 years old and children, all adults (25, 75 or 95% compliance), and everyone in the population. Our results suggest that social distancing interventions can avert cases by 20% and hospitalizations and deaths by 90% even with modest compliance within adults as long as the intervention is kept in place, but the epidemic is set to rebound once the intervention is lifted. Our models suggest that social distancing interventions will buy crucial time but need to occur in conjunction with testing and contact tracing of all suspected cases to mitigate transmission of SARS-CoV-2.",
      "Modeling the dynamics of COVID19 spread during and after social distancing Non-pharmaceutical intervention measures, such as social distancing, have so far been the only means to slow the spread of COVID19. In the United States, strict social distancing has resulted in different types infection dynamics. In some states, such as New York, extensive infection spread was followed by a pronounced decline of infection levels. In other states, such as California, less infection spread occurred before strict social distancing, and a different pattern was observed. Instead of a pronounced infection decline, a long-lasting plateau is evident, characterized by similar daily new infection levels. While these plateau dynamics cannot be readily reproduced with standard SIR infection models, we show that network models, in which individuals and their social contacts are explicitly tracked, can reproduce the plateau if network connections are cut due to social distancing measures. The reason is that in networks characterized by a degree of 2D spatial structure, infection tends to spread quadratically with time, but as edges are randomly removed, the infection spreads along nearly one-dimensional infection \"corridors\", resulting in plateau dynamics. Interestingly, the plateau dynamics are predicted to eventually transition into an infection decline phase without any further increase in social distancing measures. Additionally, the models suggest that a potential second wave becomes significantly less pronounced if social distancing is only relaxed once the dynamics have transitioned to the decline phase. The network models analyzed here allow us to interpret and reconcile different infection dynamics during social distancing observed in various US states.",
      "Impact of non-pharmaceutical interventions on URIs and influenza in crowded, urban households. OBJECTIVES We compared the impact of three household interventions-education, education with alcohol-based hand sanitizer, and education with hand sanitizer and face masks-on incidence and secondary transmission of upper respiratory infections (URIs) and influenza, knowledge of transmission of URIs, and vaccination rates. METHODS A total of 509 primarily Hispanic households participated. Participants reported symptoms twice weekly, and nasal swabs were collected from those with an influenza-like illness (ILI). Households were followed for up to 19 months and home visits were made at least every two months. RESULTS We recorded 5034 URIs, of which 669 cases reported ILIs and 78 were laboratory-confirmed cases of influenza. Demographic factors significantly associated with infection rates included age, gender, birth location, education, and employment. The Hand Sanitizer group was significantly more likely to report that no household member had symptoms (p < 0.01), but there were no significant differences in rates of infection by intervention group in multivariate analyses. Knowledge improved significantly more in the Hand Sanitizer group (p < 0.0001). The proportion of households that reported > or = 50% of members receiving influenza vaccine increased during the study (p < 0.001). Despite the fact that compliance with mask wearing was poor, mask wearing as well as increased crowding, lower education levels of caretakers, and index cases 0-5 years of age (compared with adults) were associated with significantly lower secondary transmission rates (all p < 0.02). CONCLUSIONS In this population, there was no detectable additional benefit of hand sanitizer or face masks over targeted education on overall rates of URIs, but mask wearing was associated with reduced secondary transmission and should be encouraged during outbreak situations. During the study period, community concern about methicillin-resistant Staphylococcus aureus was occurring, perhaps contributing to the use of hand sanitizer in the Education control group, and diluting the intervention's measurable impact."
    ],
    "relevance_map": {
      "0": 0,
      "1": 0,
      "2": 0,
      "3": 1,
      "4": 1,
      "5": 1,
      "6": 0,
      "7": 1,
      "8": 1,
      "9": 0
    },
    "query_id": "query_7",
    "num_docs": 10
  },
  {
    "query": "is remdesivir an effective treatment for COVID-19",
    "docs": [
      "COVID-19: Review of Epidemiology and Potential Treatments Against 2019 Novel Coronavirus An epidemic of extreme respiratory deterrence, pneumonia and shortness of breath, the SARS-CoV-2 viral infection began in Wuhan, Hubei Province, China in December 2019, and rapidly spread across China and beyond, with human to human transmission. On February 12, 2020, World Health Organization officially named the new coronavirus disease as coronavirus disease 19 (COVID-19). Most COVID-19 patients were diagnosed with pneumonia and many were treated using Chinese medicines and other secondary therapies. As of April 22, 2020, the total figure of infected patients has crossed 2.6 million people worldwide with over 180,000 deaths and 700,000 patients that have recovered. Preliminary reports suggest that certain drugs, such as chloroquine and antiviral nucleotide analogues such as remdesivir, which inhibit viral replication, can target the new coronavirus, although their usefulness in the clinic is still under debate. An expert US committee developed the US NIH guidelines for COVID-19 treatment, which was just released and will be regularly updated. This manuscript reviews the epidemiology, etiology, mortality, COVID-19 clinical symptoms, and potential therapeutic drugs, while highlighting the seriousness and damage-induced by SARS-CoV-2.",
      "Modelling SARS-CoV-2 Dynamics: Implications for Therapy The scientific community is focussed on developing antiviral therapies to mitigate the impacts of the ongoing novel coronavirus disease (COVID-19) outbreak. This will be facilitated by improved understanding of viral dynamics within infected hosts. Here, using a mathematical model in combination with published viral load data collected from the same specimen (throat / nasal swabs or nasopharyngeal / sputum / tracheal aspirate), we compare within-host dynamics for patients infected in the current outbreak with analogous dynamics for MERS-CoV and SARS-CoV infections. Our quantitative analyses revealed that SARS-CoV-2 infection dynamics are more severe than those for mild cases of MERS-CoV, but are similar to severe cases, and that the viral dynamics of SARS-CoV infection are similar to those of MERS-CoV in mild cases but not in severe case. Consequently, SARS-CoV-2 generates infection dynamics that are more severe than SARS-CoV. Furthermore, we used our viral dynamics model to predict the effectiveness of unlicensed drugs that have different methods of action. The effectiveness was measured by AUC of viral load. Our results indicated that therapies that block de novo infections or virus production are most likely to be effective if initiated before the peak viral load (which occurs around three days after symptom onset on average), but therapies that promote cytotoxicity are likely to have only limited effects. Our unique mathematical approach provides insights into the pathogenesis of SARS-CoV-2 in humans, which are useful for development of antiviral therapies.",
      "A rat genetic linkage map and comparative maps for mouse or human homologous rat genes",
      "Qualitative and Quantitative Radiological Measures of Fracture Healing. The formulation of appropriate postoperative strategies, following fracture repair, currently involves an understanding of radiological and clinical outcome measures. This study has evaluated several modalities used to assess the progression of bone healing in a sheep tibial segmental defect model. Measures of defect optical density and volumetric data including bone density (BD), bone volume (BV) and bone mass (BM) were compared with qualitative data involving visual appraisal of radiographs [% bridging callus and modified radiographic union score tibia (mRUST)] and a clinical outcome measure (locomotory function). Percent bridging callus and mRUST measures displayed strong correlation (r = 0.999), while locomotory function was weakly correlated with bridging callus (r = 0.029) and mRUST (r = 0.046). There was moderate to strong correlation between the qualitative and quantitative data. Bone density, BV and BM showed strong correlations within this dataset (BD-BV, r = 0.814; BD-BM, r = 0.818; BV-BM, r = 1.000). Likewise, optical density measures were strongly correlated with BD (r = 0.824), BV (r = 0.957) and BM (r = 0.959). The utilization of both qualitative and quantitative data, in assessment of the progression of fracture healing, has provided valuable insight. Measures of optical density have been shown to make a substantial contribution to this assessment and which should be considered for use in studies evaluating fracture healing.",
      "A Practical Guide to the Diagnosis, Treatment, and Prevention of Neonatal Infections Neonatal infections continue to cause morbidity and mortality in infants. Among approximately 400,000 infants followed nationally, the incidence rates of early-onset sepsis infection within 3 days of life are 0.98 cases per 1000 live births. Newborn infants are at increased risk for infections because they have relative immunodeficiency. This article provides evidence-based practical approaches to the diagnosis, management, and prevention of neonatal infections.",
      "Afectación clínica y sintomatológica en pacientes mayores de 65 años por COVID-19./ [Clinical involvement and symptoms of patients older than 65 years with COVID-19]",
      "An Update on Current Therapeutic Drugs Treating COVID-19 The current pandemic of coronavirus disease 2019 (COVID-19) caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) has presented unprecedented challenges to the healthcare systems in almost every country around the world. Currently, there are no proven effective vaccines or therapeutic agents against the virus. Current clinical management includes infection prevention and control measures and supportive care including supplemental oxygen and mechanical ventilatory support. Evolving research and clinical data regarding the virologic SARS-CoV-2 suggest a potential list of repurposed drugs with appropriate pharmacological effects and therapeutic efficacies in treating COVID-19 patients. In this review, we will update and summarize the most common and plausible drugs for the treatment of COVID-19 patients. These drugs and therapeutic agents include antiviral agents (remdesivir, hydroxychloroquine, chloroquine, lopinavir, umifenovir, favipiravir, and oseltamivir), and supporting agents (Ascorbic acid, Azithromycin, Corticosteroids, Nitric oxide, IL-6 antagonists), among others. We hope that this review will provide useful and most updated therapeutic drugs to prevent, control, and treat COVID-19 patients until the approval of vaccines and specific drugs targeting SARS-CoV-2.",
      "Effectiveness of a nosocomial infection control training in improving knowledge in patient-hired attendants and outsourced workers in Taiwan. Nosocomial infection represents an important indicator of healthcare quality and patient safety. Based on the experience gained during the outbreak of Severe Acute Respiratory Syndrome (SARS) in Taiwan in 2003, we gained greater awareness of the potential threat from patient-hired attendants and outsourced workers as bacteria carriers and transmitters. This study built a training model and evaluated training effectiveness in terms of improved knowledge. The training model included nosocomial infection control guidelines, a training CD, training program, evaluation form, and descriptive procedures for conducting training and evaluation. The training course for this study was conducted in 17 hospitals in Taiwan, with a total of 1,467 participants attending 27 seminars and 1,265 effective samples (return rate = 86.2%). Results of the study showed a statistical difference of < .001 before and after the training course on participant understanding of nosocomial infection control. Advantages of applying this training model include knowledge enhancement and reduced implementation time, manpower input and budget outlay. In addition to greater flexibility, the model can also positively influence clinical practice, improve patient safety and reduce hospital nosocomial infection rates. This program is worth promoting in hospitals and other healthcare institutions.",
      "Cardiovascular Safety of Potential Drugs for the Treatment of Coronavirus Disease 2019 Coronavirus disease 2019 (COVID-19) has become a global pandemic. It is still uncontrolled in most countries and no therapies are currently available. Various drugs are under investigation for its treatment. The disease is known to have worse outcomes in patients who have underlying cardiovascular disease. Chloroquine/hydroxychloroquine, azithromycin, remdesivir and lopinavir/ritonavir are currently being studied in trials and show some promise. Conduction disorders, heart failure and mortality have been reported with the use of these drugs. It is important to have a knowledge of potential cardiotoxic effects of these drugs before using them for COVID-19 patients for better allocation of healthcare resources and improvement in clinical outcomes.",
      "A Review of SARS-CoV-2 and the Ongoing Clinical Trials The sudden outbreak of 2019 novel coronavirus (2019-nCoV, later named SARS-CoV-2) in Wuhan, China, which rapidly grew into a global pandemic, marked the third introduction of a virulent coronavirus into the human society, affecting not only the healthcare system, but also the global economy. Although our understanding of coronaviruses has undergone a huge leap after two precedents, the effective approaches to treatment and epidemiological control are still lacking. In this article, we present a succinct overview of the epidemiology, clinical features, and molecular characteristics of SARS-CoV-2. We summarize the current epidemiological and clinical data from the initial Wuhan studies, and emphasize several features of SARS-CoV-2, which differentiate it from SARS-CoV and Middle East respiratory syndrome coronavirus (MERS-CoV), such as high variability of disease presentation. We systematize the current clinical trials that have been rapidly initiated after the outbreak of COVID-19 pandemic. Whereas the trials on SARS-CoV-2 genome-based specific vaccines and therapeutic antibodies are currently being tested, this solution is more long-term, as they require thorough testing of their safety. On the other hand, the repurposing of the existing therapeutic agents previously designed for other virus infections and pathologies happens to be the only practical approach as a rapid response measure to the emergent pandemic, as most of these agents have already been tested for their safety. These agents can be divided into two broad categories, those that can directly target the virus replication cycle, and those based on immunotherapy approaches either aimed to boost innate antiviral immune responses or alleviate damage induced by dysregulated inflammatory responses. The initial clinical studies revealed the promising therapeutic potential of several of such drugs, including favipiravir, a broad-spectrum antiviral drug that interferes with the viral replication, and hydroxychloroquine, the repurposed antimalarial drug that interferes with the virus endosomal entry pathway. We speculate that the current pandemic emergency will be a trigger for more systematic drug repurposing design approaches based on big data analysis."
    ],
    "relevance_map": {
      "0": 1,
      "1": 1,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 1,
      "7": 0,
      "8": 1,
      "9": 1
    },
    "query_id": "query_8",
    "num_docs": 10
  },
  {
    "query": "are there any clinical trials available for the coronavirus",
    "docs": [
      "Cardiovascular Safety of Potential Drugs for the Treatment of Coronavirus Disease 2019 Coronavirus disease 2019 (COVID-19) has become a global pandemic. It is still uncontrolled in most countries and no therapies are currently available. Various drugs are under investigation for its treatment. The disease is known to have worse outcomes in patients who have underlying cardiovascular disease. Chloroquine/hydroxychloroquine, azithromycin, remdesivir and lopinavir/ritonavir are currently being studied in trials and show some promise. Conduction disorders, heart failure and mortality have been reported with the use of these drugs. It is important to have a knowledge of potential cardiotoxic effects of these drugs before using them for COVID-19 patients for better allocation of healthcare resources and improvement in clinical outcomes.",
      "The COVID-19 pandemic and health inequalities This essay examines the implications of the COVID-19 pandemic for health inequalities. It outlines historical and contemporary evidence of inequalities in pandemics—drawing on international research into the Spanish influenza pandemic of 1918, the H1N1 outbreak of 2009 and the emerging international estimates of socio-economic, ethnic and geographical inequalities in COVID-19 infection and mortality rates. It then examines how these inequalities in COVID-19 are related to existing inequalities in chronic diseases and the social determinants of health, arguing that we are experiencing a syndemic pandemic. It then explores the potential consequences for health inequalities of the lockdown measures implemented internationally as a response to the COVID-19 pandemic, focusing on the likely unequal impacts of the economic crisis. The essay concludes by reflecting on the longer-term public health policy responses needed to ensure that the COVID-19 pandemic does not increase health inequalities for future generations.",
      "Iranian heart association task force on cardiopulmonary resuscitation guidelines on the COVID-19 outbreak",
      "COVID-19: Review of Epidemiology and Potential Treatments Against 2019 Novel Coronavirus An epidemic of extreme respiratory deterrence, pneumonia and shortness of breath, the SARS-CoV-2 viral infection began in Wuhan, Hubei Province, China in December 2019, and rapidly spread across China and beyond, with human to human transmission. On February 12, 2020, World Health Organization officially named the new coronavirus disease as coronavirus disease 19 (COVID-19). Most COVID-19 patients were diagnosed with pneumonia and many were treated using Chinese medicines and other secondary therapies. As of April 22, 2020, the total figure of infected patients has crossed 2.6 million people worldwide with over 180,000 deaths and 700,000 patients that have recovered. Preliminary reports suggest that certain drugs, such as chloroquine and antiviral nucleotide analogues such as remdesivir, which inhibit viral replication, can target the new coronavirus, although their usefulness in the clinic is still under debate. An expert US committee developed the US NIH guidelines for COVID-19 treatment, which was just released and will be regularly updated. This manuscript reviews the epidemiology, etiology, mortality, COVID-19 clinical symptoms, and potential therapeutic drugs, while highlighting the seriousness and damage-induced by SARS-CoV-2.",
      "Chloroquine as prophylactic agent against COVID-19? • Efficacy of hydroxychloroquine and chloroquine in COVID-19 treatment; • Use of hydroxychloroquine or chloroquine in COVID-19 prophylaxis.",
      "Rereading Arrowsmith in the COVID-19 Pandemic.",
      "Azithromycin added to hydroxychloroquine for patients admitted to intensive care due to coronavirus disease 2019 (COVID-19)-protocol of randomised controlled trial AZIQUINE-ICU BACKGROUND: Novel coronavirus SARS-CoV-2 is known to be susceptible in vitro to exposure to hydroxychloroquine and its effect has been found to be potentiated by azithromycin. We hypothesise that early administration of hydroxychloroquine alone or in combination with azithromycin can prevent respiratory deterioration in patients admitted to intensive care due to rapidly progressive COVID-19 infection. METHODS: Design: Prospective, multi-centre, double-blind, randomised, controlled trial (RCT). PARTICIPANTS: Adult (> 18 years) within 24 h of admission to the intensive care unit with proven or suspected COVID-19 infection, whether or not mechanically ventilated. Exclusion criteria include duration symptoms of febrile disease for &#8805; 1 week, treatment limitations in place or moribund patients, allergy or intolerance of any study treatment, and pregnancy. INTERVENTIONS: Patients will be randomised in 1:1:1 ratio to receive Hydroxychloroquine 800 mg orally in two doses followed by 400 mg daily in two doses and azithromycin 500 mg orally in one dose followed by 250 mg in one dose for a total of 5 days (HC-A group) or hydroxychloroquine + placebo (HC group) or placebo + placebo (C-group) in addition to the best standard of care, which may evolve during the trial period but will not differ between groups. Primary outcome is the composite percentage of patients alive and not on end-of-life pathway who are free of mechanical ventilation at day 14. SECONDARY OUTCOMES: The percentage of patients who were prevented from needing intubation until day 14, ICU length of stay, and mortality (in hospital) at day 28 and 90. DISCUSSION: Although both investigational drugs are often administered off label to patients with severe COVID-19, at present, there is no data from RCTs on their safety and efficacy. In vitro and observational trial suggests their potential to limit viral replication and the damage to lungs as the most common reason for ICU admission. Therefore, patients most likely to benefit from the treatment are those with severe but early disease. This trial is designed and powered to investigate whether the treatment in this cohort of patients leads to improved clinical patient-centred outcomes, such as mechanical ventilation-free survival. TRIAL REGISTRATION: Clinical trials.gov: NCT04339816 (Registered on 9 April 2020, amended on 22 June 2020); Eudra CT number: 2020-001456-18 (Registered on 29 March 2020).",
      "Boceprevir, GC-376, and calpain inhibitors II, XII inhibit SARS-CoV-2 viral replication by targeting the viral main protease A novel coronavirus SARS-CoV-2, also called novel coronavirus 2019 (nCoV-19), started to circulate among humans around December 2019, and it is now widespread as a global pandemic. The disease caused by SARS-CoV-2 virus is called COVID-19, which is highly contagious and has an overall mortality rate of 6.96% as of May 4, 2020. There is no vaccine or antiviral available for SARS-CoV-2. In this study, we report our discovery of inhibitors targeting the SARS-CoV-2 main protease (M(pro)). Using the FRET-based enzymatic assay, several inhibitors including boceprevir, GC-376, and calpain inhibitors II, and XII were identified to have potent activity with single-digit to submicromolar IC(50) values in the enzymatic assay. The mechanism of action of the hits was further characterized using enzyme kinetic studies, thermal shift binding assays, and native mass spectrometry. Significantly, four compounds (boceprevir, GC-376, calpain inhibitors II and XII) inhibit SARS-CoV-2 viral replication in cell culture with EC(50) values ranging from 0.49 to 3.37 μM. Notably, boceprevir, calpain inhibitors II and XII represent novel chemotypes that are distinct from known M(pro) inhibitors. A complex crystal structure of SARS-CoV-2 M(pro) with GC-376, determined at 2.15 Å resolution with three monomers per asymmetric unit, revealed two unique binding configurations, shedding light on the molecular interactions and protein conformational flexibility underlying substrate and inhibitor binding by M(pro). Overall, the compounds identified herein provide promising starting points for the further development of SARS-CoV-2 therapeutics.",
      "Olfaction and anosmia in rhinosinusitis Olfactory disorders can cause serious consequences from the inability to detect many olfactory warning signals (eg, smoke, spoiled food, and gas leaks) and can significantly impact nutritional status, eating satisfaction, and many other issues related to quality of life. More than 200,000 people a year seek treatment for impaired olfactory ability, and available evidence suggests this figure is a significant underestimate of those affected. Rhinitis and rhinosinusitis are the primary etiologies for olfactory loss or distortion among patients presenting to chemosensory clinics, and they are among the most common chronic medical conditions in the United States, affecting an estimated 33 million people. Both allergic and nonallergic rhinitis/rhinosinusitis can result in diminished, distorted, or absent olfactory ability. Current therapies are only partially or transiently effective in reversing olfactory loss. The underlying mechanisms by which rhinitis/rhinosinusitis impact olfactory ability are likely to be multifactorial and might include altered air flow and odor deposition, changes in mucus composition, and effects of inflammatory mediators on receptor cell differentiation, maturation, or function.",
      "Retrospective Comparison of Single-Port Sleeve Gastrectomy Versus Three-Port Laparoscopic Sleeve Gastrectomy: a Propensity Score Adjustment Analysis. PURPOSE Evaluate the efficacy of single-port sleeve gastrectomy (SPSG) and then compare it to a less-invasive sleeve approach (three-port) (3PSG) according to a propensity score (PS) matching analysis. MATERIALS AND METHODS We analyzed all patients who underwent SG through a three-port or a single-port laparoscopic approach. RESULTS After 2 years, the follow-up was completed in 84% patients treated with 3PSG and 95% patients of the SPSG group. Excess weight loss (EWL) was comparable for the first year of follow-up within the two groups except for the controls at 3 months in which the SPSG group showed a higher EWL (p = 0.0243). CONCLUSION We demonstrated the efficacy of SPSG in bariatric surgery even compared to another, less invasive, laparoscopic SG approach (three-port)."
    ],
    "relevance_map": {
      "0": 1,
      "1": 0,
      "2": 0,
      "3": 1,
      "4": 1,
      "5": 0,
      "6": 1,
      "7": 1,
      "8": 0,
      "9": 0
    },
    "query_id": "query_9",
    "num_docs": 10
  }
]