[
  {
    "query": "0-dimensional biomaterials show inductive properties.",
    "docs": [
      "Nanotechnologies are emerging platforms that could be useful in measuring, understanding, and manipulating stem cells. Examples include magnetic nanoparticles and quantum dots for stem cell labeling and in vivo tracking; nanoparticles, carbon nanotubes, and polyplexes for the intracellular delivery of genes/oligonucleotides and protein/peptides; and engineered nanometer-scale scaffolds for stem cell differentiation and transplantation. This review examines the use of nanotechnologies for stem cell tracking, differentiation, and transplantation. We further discuss their utility and the potential concerns regarding their cytotoxicity.",
      "OBJECTIVES To examine the effect of routinely administered psychiatric questionnaires on the recognition, management, and outcome of psychiatric disorders in non-psychiatric settings. DATA SOURCES Embase, Medline, PsycLIT, Cinahl, Cochrane Controlled Trials Register, and hand searches of key journals. METHODS A systematic review of randomised controlled trials of the administration and routine feedback of psychiatric screening and outcome questionnaires to clinicians in non-psychiatric settings. Narrative overview of key design features and end points, together with a random effects quantitative synthesis of comparable studies. MAIN OUTCOME MEASURES Recognition of psychiatric disorders after feedback of questionnaire results; interventions for psychiatric disorders; and outcome of psychiatric disorders. RESULTS Nine randomised studies were identified that examined the use of common psychiatric instruments in primary care and general hospital settings. Studies compared the effect of the administration of these instruments followed by the feedback of the results to clinicians, with administration with no feedback. Meta-analytic pooling was possible for four of these studies (2457 participants), which measured the effect of feedback on the recognition of depressive disorders. Routine administration and feedback of scores for all patients (irrespective of score) did not increase the overall rate of recognition of mental disorders such as anxiety and depression (relative risk of detection of depression by clinician after feedback 0.95, 95% confidence interval 0.83 to 1.09). Two studies showed that routine administration followed by selective feedback for only high scorers increased the rate of recognition of depression (relative risk of detection of depression after feedback 2.64, 1.62 to 4.31). This increased recognition, however, did not translate into an increased rate of intervention. Overall, studies of routine administration of psychiatric measures did not show an effect on patient outcome. CONCLUSIONS The routine measurement of outcome is a costly exercise. Little evidence shows that it is of benefit in improving psychosocial outcomes of those with psychiatric disorder managed in non-psychiatric settings.",
      "The importance of genetic factors in etiology of chronic lymphocytic leukemia (CLL) is suggested by family and population studies. However, the spectrum of malignancies sharing common genetic factors with CLL and the effects of sex and age on familial risk are unknown. We used the Swedish Family-Cancer Database to test for increased familial risks of CLL and other lymphoproliferative tumors. Cancer diagnoses from 1958 to 1998 were assessed in 14 336 first-degree relatives of 5918 CLL cases and in 28 876 first-degree relatives of 11 778 controls. Cancer risks in relatives of cases were compared with those in relatives of controls using marginal survival models. Relatives of cases were at significantly increased risk for CLL (relative risk [RR] = 7.52; 95% confidence interval [CI], 3.63-15.56), for non-Hodgkin lymphoma (RR = 1.45; 95% CI, 0.98-2.16), and for Hodgkin lymphoma (RR = 2.35; 95% CI, 1.08-5.08). CLL risks were similar in parents, siblings, and offspring of cases, in male and female relatives, and were not affected by the case's age at diagnosis. Anticipation was not significant when analyzed using life table methods. We conclude that the familial component of CLL is shared with other lymphoproliferative malignances, suggesting common genetic pathways. However, because clinically diagnosed CLL is uncommon, absolute excess risk to relatives is small.",
      "Lipid droplets are ubiquitous triglyceride and sterol ester storage organelles required for energy storage homeostasis and biosynthesis. Although little is known about lipid droplet formation and regulation, it is clear that members of the PAT (perilipin, adipocyte differentiation related protein, tail interacting protein of 47 kDa) protein family coat the droplet surface and mediate interactions with lipases that remobilize the stored lipids. We identified key Drosophila candidate genes for lipid droplet regulation by RNA interference (RNAi) screening with an image segmentation-based optical read-out system, and show that these regulatory functions are conserved in the mouse. Those include the vesicle-mediated Coat Protein Complex I (COPI) transport complex, which is required for limiting lipid storage. We found that COPI components regulate the PAT protein composition at the lipid droplet surface, and promote the association of adipocyte triglyceride lipase (ATGL) with the lipid droplet surface to mediate lipolysis. Two compounds known to inhibit COPI function, Exo1 and Brefeldin A, phenocopy COPI knockdowns. Furthermore, RNAi inhibition of ATGL and simultaneous drug treatment indicate that COPI and ATGL function in the same pathway. These data indicate that the COPI complex is an evolutionarily conserved regulator of lipid homeostasis, and highlight an interaction between vesicle transport systems and lipid droplets.",
      "This study investigated whether there are race differences in the structure of informal caregiving networks. Data on 3,793 functionally impaired persons age 65 and over from the 1989 National Long-Term Care Survey were analyzed. The size of the total caregiver network and the unpaid network did not differ by race, but the likelihood of there being a non-immediate family member among unpaid caregivers was higher among disabled older blacks. These findings raise questions about whether race differences in nursing home utilization and paid long-term care services, documented in other studies, can be explained by differences in caregiving arrangements.",
      "BACKGROUND The purpose of this study was to test the hypothesis that vasodilator responses of porcine coronary resistance arteries are increased by exercise training. METHODS AND RESULTS Yucatan miniature swine were randomly divided into groups of exercise-trained (ET) and sedentary (SED) control pigs. ET pigs were placed on a progressive treadmill training program lasting 16 to 20 weeks, and SED pigs remained inactive during the same time period. Coronary resistance arteries 64 to 157 microns in diameter were isolated for in vitro evaluation of relaxation responses to the endothelium-independent dilators sodium nitroprusside (1 x 10(-10) to 1 x 10(-4) mol/L) and adenosine (1 x 10(-10) to 1 x 10(-5) mol/L) and to bradykinin (1 x 10(-13) to 3 x 10(-7) mol/L), an endothelium-dependent agent. Relaxation responses to adenosine and sodium nitroprusside were not altered by exercise training. Endothelium-dependent relaxation to bradykinin was enhanced in coronary resistance arteries from ET pigs (IC50: ET, 0.07 +/- 0.02 nmol/L; SED, 1.59 +/- 0.09 nmol/L). To determine whether prostanoids and/or the nitric oxide synthase pathway were involved in the ET-induced changes in bradykinin-induced vasodilation, responses to bradykinin were examined in coronary resistance arteries from both ET and SED pigs in the presence of indomethacin and in the presence of nitro-monomethyl L-arginine (L-NMMA). Both indomethacin and L-NMMA produced significant inhibition of the bradykinin-induced relaxation in vessels from both groups. Despite decreased bradykinin-induced relaxation after indomethacin, bradykinin-induced vasodilation was still enhanced in vessels from the ET group. L-NMMA caused greater inhibition of the bradykinin-induced relaxation in coronary resistance arteries from ET pigs relative to arteries from SED pigs and eliminated the training-induced enhancement of the bradykinin responses. CONCLUSIONS These results suggest that exercise training enhances bradykinin-induced vasodilation through increased endothelium-derived relaxing factor/nitric oxide production by the L-arginine/nitric oxide synthase pathway.",
      "BACKGROUND Influenza A virus (IAV) infection primarily targets respiratory epithelial cells and produces clinical outcomes ranging from mild upper respiratory infection to severe pneumonia. Recent studies have shown the importance of lung antioxidant defense systems against injury by IAV. Nuclear factor-erythroid 2 related factor 2 (Nrf2) activates the majority of antioxidant genes. METHODS Alveolar type II (ATII) cells and alveolar macrophages (AM) were isolated from human lungs not suitable for transplantation and donated for medical research. In some studies ATII cells were transdifferentiated to alveolar type I-like (ATI-like) cells. Alveolar epithelial cells were infected with A/PR/8/34 (PR8) virus. We analyzed PR8 virus production, influenza A nucleoprotein levels, ROS generation and expression of antiviral genes. Immunocytofluorescence was used to determine Nrf2 translocation and western blotting to detect Nrf2, HO-1 and caspase 1 and 3 cleavage. We also analyzed ingestion of PR8 virus infected apoptotic ATII cells by AM, cytokine levels by ELISA, glutathione levels, necrosis and apoptosis by TUNEL assay. Moreover, we determined the critical importance of Nrf2 using adenovirus Nrf2 (AdNrf2) or Nrf2 siRNA to overexpress or knockdown Nrf2, respectively. RESULTS We found that IAV induced oxidative stress, cytotoxicity and apoptosis in ATI-like and ATII cells. We also found that AM can ingest PR8 virus-induced apoptotic ATII cells (efferocytosis) but not viable cells, whereas ATII cells did not ingest these apoptotic cells. PR8 virus increased ROS production, Nrf2, HO-1, Mx1 and OAS1 expression and Nrf2 translocation to the nucleus. Nrf2 knockdown with siRNA sensitized ATI-like cells and ATII cells to injury induced by IAV and overexpression of Nrf2 with AdNrf2 protected these cells. Furthermore, Nrf2 overexpression followed by infection with PR8 virus decreased virus replication, influenza A nucleoprotein expression, antiviral response and oxidative stress. However, AdNrf2 did not increase IFN-λ1 (IL-29) levels. CONCLUSIONS Our results indicate that IAV induces alveolar epithelial injury and that Nrf2 protects these cells from the cytopathic effects of IAV likely by increasing the expression of antioxidant genes. Identifying the pathways involved in protecting cells from injury during influenza infection may be particularly important for developing new therapeutic strategies.",
      "Since it was discovered that the anti-hypertensive agent ifenprodil has neuroprotective activity through its effects on NMDA (N-methyl-D-aspartate) receptors, a determined effort has been made to understand the mechanism of action and to develop improved therapeutic compounds on the basis of this knowledge. Neurotransmission mediated by NMDA receptors is essential for basic brain development and function. These receptors form heteromeric ion channels and become activated after concurrent binding of glycine and glutamate to the GluN1 and GluN2 subunits, respectively. A functional hallmark of NMDA receptors is that their ion-channel activity is allosterically regulated by binding of small compounds to the amino-terminal domain (ATD) in a subtype-specific manner. Ifenprodil and related phenylethanolamine compounds, which specifically inhibit GluN1 and GluN2B NMDA receptors, have been intensely studied for their potential use in the treatment of various neurological disorders and diseases, including depression, Alzheimer's disease and Parkinson's disease. Despite considerable enthusiasm, mechanisms underlying the recognition of phenylethanolamines and ATD-mediated allosteric inhibition remain limited owing to a lack of structural information. Here we report that the GluN1 and GluN2B ATDs form a heterodimer and that phenylethanolamine binds at the interface between GluN1 and GluN2B, rather than within the GluN2B cleft. The crystal structure of the heterodimer formed between the GluN1b ATD from Xenopus laevis and the GluN2B ATD from Rattus norvegicus shows a highly distinct pattern of subunit arrangement that is different from the arrangements observed in homodimeric non-NMDA receptors and reveals the molecular determinants for phenylethanolamine binding. Restriction of domain movement in the bi-lobed structure of the GluN2B ATD, by engineering of an inter-subunit disulphide bond, markedly decreases sensitivity to ifenprodil, indicating that conformational freedom in the GluN2B ATD is essential for ifenprodil-mediated allosteric inhibition of NMDA receptors. These findings pave the way for improving the design of subtype-specific compounds with therapeutic value for neurological disorders and diseases.",
      "Methanosphaera stadtmaniae is a non-motile, Gram-positive spherical-shaped organism that obtains energy for growth by using hydrogen to reduce methanol to methane. It does not produce methane from hydrogen and carbon dioxide, formate, acetate or methylamines and cannot grow with hydrogen and carbon monoxide, nitrate, fumarate, sulfate or choline. Its pH optimum is 6.5 to 6.9 and its temperature optimum is 36° to 40° C. It is not inhibited by bile salts, inhibitors of the synthesis of folic acid coenzymes, cephalothin or clindamycin but is inhibited by metronidazole, bacitracin, monensin, lasalocid, or bromoethanesulfonate. It requires acetate, carbon dioxide, isoleucine, ammonium, and thiamin for growth and biotin is stimulatory. It does not contain cytochromes and the mol % G+C of its DNA is 25.8. The composition of its cell wall and 16 S rRNA and its immunological fingerprint are consistent with characterization of the organism as a member of a new genus of the family Methanobacteriaceae. The habitat of the type strain is the human large intestine.",
      "Aire-expressing medullary thymic epithelial cells (mTECs) play a key role in preventing autoimmunity by expressing tissue-restricted antigens to help purge the emerging T cell receptor repertoire of self-reactive specificities. Here we demonstrate a novel role for a CD4+3− inducer cell population, previously linked to development of organized secondary lymphoid structures and maintenance of T cell memory in the functional regulation of Aire-mediated promiscuous gene expression in the thymus. CD4+3− cells are closely associated with mTECs in adult thymus, and in fetal thymus their appearance is temporally linked with the appearance of Aire+ mTECs. We show that RANKL signals from this cell promote the maturation of RANK-expressing CD80−Aire− mTEC progenitors into CD80+Aire+ mTECs, and that transplantation of RANK-deficient thymic stroma into immunodeficient hosts induces autoimmunity. Collectively, our data reveal cellular and molecular mechanisms leading to the generation of Aire+ mTECs and highlight a previously unrecognized role for CD4+3−RANKL+ inducer cells in intrathymic self-tolerance."
    ],
    "relevance_map": {
      "0": 1,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "1",
    "num_docs": 10
  },
  {
    "query": "1,000 genomes project enables mapping of genetic sequence variation consisting of rare variants with larger penetrance effects than common variants.",
    "docs": [
      "Genome-wide association studies (GWAS) have now identified at least 2,000 common variants that appear associated with common diseases or related traits (http://www.genome.gov/gwastudies), hundreds of which have been convincingly replicated. It is generally thought that the associated markers reflect the effect of a nearby common (minor allele frequency >0.05) causal site, which is associated with the marker, leading to extensive resequencing efforts to find causal sites. We propose as an alternative explanation that variants much less common than the associated one may create \"synthetic associations\" by occurring, stochastically, more often in association with one of the alleles at the common site versus the other allele. Although synthetic associations are an obvious theoretical possibility, they have never been systematically explored as a possible explanation for GWAS findings. Here, we use simple computer simulations to show the conditions under which such synthetic associations will arise and how they may be recognized. We show that they are not only possible, but inevitable, and that under simple but reasonable genetic models, they are likely to account for or contribute to many of the recently identified signals reported in genome-wide association studies. We also illustrate the behavior of synthetic associations in real datasets by showing that rare causal mutations responsible for both hearing loss and sickle cell anemia create genome-wide significant synthetic associations, in the latter case extending over a 2.5-Mb interval encompassing scores of \"blocks\" of associated variants. In conclusion, uncommon or rare genetic variants can easily create synthetic associations that are credited to common variants, and this possibility requires careful consideration in the interpretation and follow up of GWAS signals.",
      "PURPOSE This study examined the prevalence, correlates, and negative consequences of unmet need for personal assistance with activities of daily living (ADLs) among older adults. DESIGN AND METHODS The authors analyzed cross-sectional data from the 1994 National Health Interview Survey's Supplement on Aging. Data were weighted to be representative of the noninstitutionalized population aged 70 years and older. RESULTS Overall, 20.7% of those needing help to perform 1 or more ADLs (an estimated 629,000 persons) reported receiving inadequate assistance; for individual ADLs, the prevalence of unmet need ranged from 10.2% (eating) to 20.1% (transferring). The likelihood of having 1 or more unmet needs was associated with lower household income, multiple ADL difficulties, and living alone. Nearly half of those with unmet needs reported experiencing a negative consequence (e.g., unable to eat when hungry) as a result of their unmet need. IMPLICATIONS Greater, targeted efforts are needed to reduce the prevalence and consequences of unmet need for ADL assistance in elderly persons.",
      "Previous studies have detected associations between mitochondrial haplogroups and schizophrenia (SZ). However, no study has examined the relationship between major mitochondrial DNA (mtDNA) haplogroups and SZ in the Chinese population. The aim of this study was to assess the association between mtDNA haplogroups and SZ genesis in the Chinese Han population. We used a case-control study and sequenced the mtDNA hypervariable regions (HVR1, HVR2, and HVR3) in the Han population. We analyzed mtDNA haplogroups and HVR polymorphisms in 298 SZ patients and 298 controls. The haplotypes were classified into 10 major haplogroups: A, B, CZ, D, F, G, M, N, N9a, and R. Statistical analysis revealed that only N9a showed a nominally significant association with protection from SZ [1.68% vs. 6.38%, p=0.004, OR=0.251 (0.092-0.680); after adjustment for age and sex: p=0.006, OR=0.246 (0.090-0.669)]. Three HVR polymorphisms were found to be nominally significantly different between subjects with SZ and controls, and all except one (m.204T>C) are linked to the N9a haplogroup. Our results indicate that mtDNA haplogroup N9a might be a protective factor for SZ.",
      "Atypical antipsychotics such as olanzapine often induce excessive weight gain and type 2 diabetes. However, the mechanisms underlying these drug-induced metabolic perturbations remain poorly understood. Here, we used an experimental model that reproduces olanzapine-induced hyperphagia and obesity in female C57BL/6 mice. We found that olanzapine treatment acutely increased food intake, impaired glucose tolerance, and altered physical activity and energy expenditure in mice. Furthermore, olanzapine-induced hyperphagia and weight gain were blunted in mice lacking the serotonin 2C receptor (HTR2C). Finally, we showed that treatment with the HTR2C-specific agonist lorcaserin suppressed olanzapine-induced hyperphagia and weight gain. Lorcaserin treatment also improved glucose tolerance in olanzapine-fed mice. Collectively, our studies suggest that olanzapine exerts some of its untoward metabolic effects via antagonism of HTR2C.",
      "Exercise increases plasma TNF-alpha, IL-1beta, and IL-6, yet the stimuli and sources of TNF-alpha and IL-1beta remain largely unknown. We tested the role of oxidative stress and the potential contribution of monocytes in this cytokine (especially IL-1beta) response in previously untrained individuals. Six healthy nonathletes performed two 45-min bicycle exercise sessions at 70% of Vo(2 max) before and after a combination of antioxidants (vitamins E, A, and C for 60 days; allopurinol for 15 days; and N-acetylcysteine for 3 days). Blood was drawn at baseline, end-exercise, and 30 and 120 min postexercise. Plasma cytokines were determined by ELISA and monocyte intracellular cytokine level by flow cytometry. Before antioxidants, TNF-alpha increased by 60%, IL-1beta by threefold, and IL-6 by sixfold secondary to exercise (P < 0.05). After antioxidants, plasma IL-1beta became undetectable, the TNF-alpha response to exercise was abolished, and the IL-6 response was significantly blunted (P < 0.05). Exercise did not increase the percentage of monocytes producing the cytokines or their mean fluorescence intensity. We conclude that in untrained humans oxidative stress is a major stimulus for exercise-induced cytokine production and that monocytes play no role in this process.",
      "The development and maintenance of an epithelium requires finely balanced rates of growth and cell death. However, the mechanical and biochemical mechanisms that ensure proper feedback control of tissue growth, which when deregulated contribute to tumorigenesis, are poorly understood. Here we use the fly notum as a model system to identify a novel process of crowding-induced cell delamination that balances growth to ensure the development of well-ordered cell packing. In crowded regions of the tissue, a proportion of cells undergo a serial loss of cell–cell junctions and a progressive loss of apical area, before being squeezed out by their neighbours. This path of delamination is recapitulated by a simple computational model of epithelial mechanics, in which stochastic cell loss relieves overcrowding as the system tends towards equilibrium. We show that this process of delamination is mechanistically distinct from apoptosis-mediated cell extrusion and precedes the first signs of cell death. Overall, this analysis reveals a simple mechanism that buffers epithelia against variations in growth. Because live-cell delamination constitutes a mechanistic link between epithelial hyperplasia and cell invasion, this is likely to have important implications for our understanding of the early stages of cancer development.",
      "Our eyes send different 'images' of the outside world to the brain — an image of contours (line drawing), a colour image (watercolour painting) or an image of moving objects (movie). This is commonly referred to as parallel processing, and starts as early as the first synapse of the retina, the cone pedicle. Here, the molecular composition of the transmitter receptors of the postsynaptic neurons defines which images are transferred to the inner retina. Within the second synaptic layer — the inner plexiform layer — circuits that involve complex inhibitory and excitatory interactions represent filters that select 'what the eye tells the brain'.",
      "Leukemia in donor cells (donor cell leukemia; DCL) has been reported as a rare but severe complication of allogeneic stem cell transplantation (SCT). However, the incidence, potential pathogenetic factors, therapeutic options and outcome of patients suffering from DCL and the leukemia risk of their donors are not well defined. A questionnaire survey was carried out within European Blood and Marrow Transplantation Group (EBMT) centers. Ninety-one EBMT centers participated in this survey, covering 10489 allogeneic SCT between 12/1982 and 09/2003. Fourteen cases of DCL, most with a myeloid phenotype (7 cases of acute myeloid leukemia, 3 each of acute lymphocytic leukemia and 1 case of chronic myeloid leukemia) were identified. Demonstration of donor cell origin included molecular analysis of chimerism in most cases. DCL type and cytogenetic alterations were independent from the original disease. The median time between transplantation and diagnosis of DCL was 17 months (4-164). No type of conditioning, donor, graft manipulation, graft-versus-host disease prophylaxis or subsequent complications were identified as risk factors for DCL. Chemotherapy induced remissions in DCL and 2 of 5 patients remain alive in remission after a second transplant. None of the stem cell donors developed hematologic malignancies (median follow-up period of 9 years; range 6-30 years). DCL is an extremely rare complication of allogeneic SCT in which treatment attempts with chemotherapy and a second SCT are justified. Donors are not at an increased risk of developing hematologic malignancies.",
      "Autoimmune polyendocrinopathy-candidiasis-ectodermal dystrophy (APECED) is the only described systemic autoimmune disease with established monogenic background, and the first autoimmune disorder localized outside the major histocompatibility complex (MHC) region. The primary biochemical defect in APECED is unknown. We have isolated a novel gene, AIRE, encoding for a putative nuclear protein featuring two PHD-type zinc-finger motifs, suggesting its involvement in transcriptional regulation. Five mutations in AIRE are reported in individuals with this disorder. This is the first report of a single-gene defect causing a systemic human autoimmune disease, providing a tool for exploring the molecular basis of autoimmunity.",
      "A long-term cell culture epithelioid cell line was established from a recurrent squamous carcinoma of the nasopharynx of a Chinese male 17 1/2 years after radiation therapy. The cell line, designated NPC/HK1, has been passed 72 times over a period 1 year. The cells have been shown by light and electron microscopies to be of the squamous epithelial type. When they were transplanted subcutaneously into the back of athymic nude BALB/c (nu/nu) mice, tumors developed at the sites of inoculation, which on histological examination were shown to be well-differentiated squamous carcinomas, similar in morphology to the recurrent human tumor from which they were derived. Karyotypic analysis of cells from the cell line demonstrates an aneuploid human type with a modal chromosome number of 74 with both numerical and structural aberrations. Viral particles or Epstein-Barr viral nuclear antigen (EBNA) has not been demonstrated in the cells from the primary culture or several of the subcultures tested. The presence of EBNA in touch smears prepared from the biopsy tissue was inconclusive. Infection of the subcultured cells with EBV from P3HR1 and B95-8 cells was unsuccessful."
    ],
    "relevance_map": {
      "0": 1,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "3",
    "num_docs": 10
  },
  {
    "query": "1/2000 in UK have abnormal PrP positivity.",
    "docs": [
      "OBJECTIVES To carry out a further survey of archived appendix samples to understand better the differences between existing estimates of the prevalence of subclinical infection with prions after the bovine spongiform encephalopathy epizootic and to see whether a broader birth cohort was affected, and to understand better the implications for the management of blood and blood products and for the handling of surgical instruments. DESIGN Irreversibly unlinked and anonymised large scale survey of archived appendix samples. SETTING Archived appendix samples from the pathology departments of 41 UK hospitals participating in the earlier survey, and additional hospitals in regions with lower levels of participation in that survey. SAMPLE 32,441 archived appendix samples fixed in formalin and embedded in paraffin and tested for the presence of abnormal prion protein (PrP). RESULTS Of the 32,441 appendix samples 16 were positive for abnormal PrP, indicating an overall prevalence of 493 per million population (95% confidence interval 282 to 801 per million). The prevalence in those born in 1941-60 (733 per million, 269 to 1596 per million) did not differ significantly from those born between 1961 and 1985 (412 per million, 198 to 758 per million) and was similar in both sexes and across the three broad geographical areas sampled. Genetic testing of the positive specimens for the genotype at PRNP codon 129 revealed a high proportion that were valine homozygous compared with the frequency in the normal population, and in stark contrast with confirmed clinical cases of vCJD, all of which were methionine homozygous at PRNP codon 129. CONCLUSIONS This study corroborates previous studies and suggests a high prevalence of infection with abnormal PrP, indicating vCJD carrier status in the population compared with the 177 vCJD cases to date. These findings have important implications for the management of blood and blood products and for the handling of surgical instruments.",
      "Mammalian target of rapamycin (mTOR) is an atypical protein kinase that controls growth and metabolism in response to nutrients, growth factors and cellular energy levels, and it is frequently dysregulated in cancer and metabolic disorders. Rapamycin is an allosteric inhibitor of mTOR, and was approved as an immuno-suppressant in 1999. In recent years, interest has focused on its potential as an anticancer drug. However, the performance of rapamycin and its analogues (rapalogues) has been undistinguished despite isolated successes in subsets of cancer, suggesting that the full therapeutic potential of targeting mTOR has yet to be exploited. A new generation of ATP-competitive inhibitors that directly target the mTOR catalytic site display potent and comprehensive mTOR inhibition and are in early clinical trials.",
      "Nonalcoholic fatty liver disease (NAFLD) is an increasingly prevalent chronic liver disease for which no approved therapies are available. Despite intensive research, the cellular mechanisms that mediate NAFLD pathogenesis and progression are poorly understood. Although obesity, diabetes, insulin resistance, and related metabolic syndrome, all consequences of a Western diet lifestyle, are well-recognized risk factors for NAFLD development, dysregulated bile acid metabolism is emerging as a novel mechanism contributing to NAFLD pathogenesis. Notably, NAFLD patients exhibit a deficiency in fibroblast growth factor 19 (FGF19), an endocrine hormone in the gut-liver axis that controls de novo bile acid synthesis, lipogenesis, and energy homeostasis. Using a mouse model that reproduces the clinical progression of human NAFLD, including the development of simple steatosis, nonalcoholic steatohepatitis (NASH), and advanced \"burnt-out\" NASH with hepatocellular carcinoma, we demonstrate that FGF19 as well as an engineered nontumorigenic FGF19 analogue, M70, ameliorate bile acid toxicity and lipotoxicity to restore liver health. Mass spectrometry-based lipidomics analysis of livers from mice treated with FGF19 or M70 revealed significant reductions in the levels of toxic lipid species (i.e., diacylglycerols, ceramides and free cholesterol) and an increase in levels of unoxidized cardiolipins, an important component of the inner mitochondrial membrane. Furthermore, treatment with FGF19 or M70 rapidly and profoundly reduced levels of liver enzymes, resolved the histologic features of NASH, and enhanced insulin sensitivity, energy homeostasis, and lipid metabolism. Whereas FGF19 induced hepatocellular carcinoma formation following prolonged exposure in these mice, animals expressing M70 showed no evidence of liver tumorigenesis in this model. Conclusion: We have engineered an FGF19 hormone that is capable of regulating multiple pathways to deliver antisteatotic, anti-inflammatory, and antifibrotic activities and that represents a potentially promising therapeutic for patients with NASH. (Hepatology Communications 2017;1:1024-1042).",
      "The process of aging results in a host of changes at the cellular and molecular levels, which include senescence, telomere shortening, and changes in gene expression. Epigenetic patterns also change over the lifespan, suggesting that epigenetic changes may constitute an important component of the aging process. The epigenetic mark that has been most highly studied is DNA methylation, the presence of methyl groups at CpG dinucleotides. These dinucleotides are often located near gene promoters and associate with gene expression levels. Early studies indicated that global levels of DNA methylation increase over the first few years of life and then decrease beginning in late adulthood. Recently, with the advent of microarray and next-generation sequencing technologies, increases in variability of DNA methylation with age have been observed, and a number of site-specific patterns have been identified. It has also been shown that certain CpG sites are highly associated with age, to the extent that prediction models using a small number of these sites can accurately predict the chronological age of the donor. Together, these observations point to the existence of two phenomena that both contribute to age-related DNA methylation changes: epigenetic drift and the epigenetic clock. In this review, we focus on healthy human aging throughout the lifetime and discuss the dynamics of DNA methylation as well as how interactions between the genome, environment, and the epigenome influence aging rates. We also discuss the impact of determining 'epigenetic age' for human health and outline some important caveats to existing and future studies.",
      "The ARV1-encoded protein mediates sterol transport from the endoplasmic reticulum (ER) to the plasma membrane. Yeast ARV1 mutants accumulate multiple lipids in the ER and are sensitive to pharmacological modulators of both sterol and sphingolipid metabolism. Using fluorescent and electron microscopy, we demonstrate sterol accumulation, subcellular membrane expansion, elevated lipid droplet formation, and vacuolar fragmentation in ARV1 mutants. Motif-based regression analysis of ARV1 deletion transcription profiles indicates activation of Hac1p, an integral component of the unfolded protein response (UPR). Accordingly, we show constitutive splicing of HAC1 transcripts, induction of a UPR reporter, and elevated expression of UPR targets in ARV1 mutants. IRE1, encoding the unfolded protein sensor in the ER lumen, exhibits a lethal genetic interaction with ARV1, indicating a viability requirement for the UPR in cells lacking ARV1. Surprisingly, ARV1 mutants expressing a variant of Ire1p defective in sensing unfolded proteins are viable. Moreover, these strains also exhibit constitutive HAC1 splicing that interacts with DTT-mediated perturbation of protein folding. These data suggest that a component of UPR induction in arv1Δ strains is distinct from protein misfolding. Decreased ARV1 expression in murine macrophages also results in UPR induction, particularly up-regulation of activating transcription factor-4, CHOP (C/EBP homologous protein), and apoptosis. Cholesterol loading or inhibition of cholesterol esterification further elevated CHOP expression in ARV1 knockdown cells. Thus, loss or down-regulation of ARV1 disturbs membrane and lipid homeostasis, resulting in a disruption of ER integrity, one consequence of which is induction of the UPR.",
      "In type 1 diabetes (T1D), there is an intense inflammatory response that destroys the β cells in the pancreatic islets of Langerhans, the site where insulin is produced and released. A therapy for T1D that targets the specific autoimmune response in this disease while leaving the remainder of the immune system intact, has long been sought. Proinsulin is a major target of the adaptive immune response in T1D. We hypothesized that an engineered DNA plasmid encoding proinsulin (BHT-3021) would preserve β cell function in T1D patients through reduction of insulin-specific CD8⁺ T cells. We studied 80 subjects over 18 years of age who were diagnosed with T1D within the past 5 years. Subjects were randomized 2:1 to receive intramuscular injections of BHT-3021 or BHT-placebo, weekly for 12 weeks, and then monitored for safety and immune responses in a blinded fashion. Four dose levels of BHT-3021 were evaluated: 0.3, 1.0, 3.0, and 6.0 mg. C-peptide was used both as an exploratory efficacy measure and as a safety measure. Islet-specific CD8⁺ T cell frequencies were assessed with multimers of monomeric human leukocyte antigen class I molecules loaded with peptides from pancreatic and unrelated antigens. No serious adverse events related to BHT-3021 were observed. C-peptide levels improved relative to placebo at all doses, at 1 mg at the 15-week time point (+19.5% BHT-3021 versus -8.8% BHT-placebo, P < 0.026). Proinsulin-reactive CD8⁺ T cells, but not T cells against unrelated islet or foreign molecules, declined in the BHT-3021 arm (P < 0.006). No significant changes were noted in interferon-γ, interleukin-4 (IL-4), or IL-10 production in CD4 T cells. Thus, we demonstrate that a plasmid encoding proinsulin reduces the frequency of CD8⁺ T cells reactive to proinsulin while preserving C-peptide over the course of dosing.",
      "BACKGROUND ST2 is an interleukin (IL)-1 receptor family member with membrane-bound (ST2L) and soluble (sST2) isoforms, and sST2 is a biomarker for poor outcome in patients with myocardial infarction (MI). IL-33, the recently discovered ligand for ST2, activates nuclear factor kappaB and thus may regulate apoptotic cell death. We tested the hypothesis that IL-33 is cardioprotective after MI through ST2 signaling. METHODS AND RESULTS IL-33 protected cultured cardiomyocytes from hypoxia-induced apoptosis, and this cardioprotection was partially inhibited by sST2. IL-33 induced expression of the antiapoptotic factors XIAP, cIAP1, and survivin. To define the cardioprotective role of IL-33 in vivo, we performed a blinded and randomized study of ischemia/reperfusion in rats. IL-33 reduced cardiomyocyte apoptosis, suppressed caspase-3 activity, and increased expression of IAP family member proteins. IL-33 decreased both infarct and fibrosis volumes at 15 days; furthermore, both echocardiographic and hemodynamic studies revealed that IL-33 improved ventricular function. To determine whether cardioprotection by IL-33 is mediated through ST2 signaling, a randomized and blinded study of ST2(-/-) versus wild-type littermate mice was performed in 98 mice subjected to MI. At 4 weeks after MI, IL-33 reduced ventricular dilation and improved contractile function in wild-type mice but not in ST2(-/-) mice. Finally, IL-33 improved survival after MI in wild-type but not in ST2(-/-) mice. CONCLUSIONS IL-33 prevents cardiomyocyte apoptosis and improves cardiac function and survival after MI through ST2 signaling.",
      "PURPOSE To investigate hypoxia measured by pimonidazole binding, glucose transporter 1 (GLUT1) and carbonic anhydrase IX (CA-IX) expression, proliferation, and vascularity in liver metastases of colorectal cancer and to compare GLUT1 and CA-IX expression in corresponding primary tumors. METHODS AND MATERIALS Twenty-five patients with liver metastases of colorectal cancer, planned for metastasectomy, were included. The hypoxia marker pimonidazole and proliferation marker iododeoxyuridine were administered before surgery. After immunofluorescent staining of the frozen metastases, pimonidazole binding, vascularity, and proliferation were analyzed quantitatively. Thirteen paraffin-embedded primary tumors were stained immunohistochemically for GLUT1 and CA-IX expression, which was analyzed semiquantitatively in primary tumors and corresponding liver metastases. RESULTS In liver metastases, pimonidazole binding showed a pattern consistent with diffusion-limited hypoxia. The mean pimonidazole-positive fraction was 0.146; the mean distance from vessels to pimonidazole-positive areas was 80 microm. When expressed, often co-localization was observed between pimonidazole binding and GLUT1 or CA-IX expression, but microregional areas of mismatch were also observed. No correlation between the level of pimonidazole binding and GLUT1 or CA-IX expression was observed. In some patients, a large fraction (up to 30%) of proliferating cells was present in pimonidazole-stained areas. Expression of CA-IX in primary tumors and metastases showed a significant correlation, which was absent for GLUT1 expression. CONCLUSIONS Compared with other tumor types, liver metastases of colorectal cancer contain large amounts of hypoxic cells. The lack of correlation with pimonidazole binding brings into question the value of GLUT1 and CA-IX as endogenous markers of hypoxia.",
      "The Set1-containing complex COMPASS, which is the yeast homolog of the human MLL complex, is required for mono-, di-, and trimethylation of lysine 4 of histone H3. We have performed a comparative global proteomic screen to better define the role of COMPASS in histone trimethylation. We report that both Cps60 and Cps40 components of COMPASS are required for proper histone H3 trimethylation, but not for proper regulation of telomere-associated gene silencing. Purified COMPASS lacking Cps60 can mono- and dimethylate but is not capable of trimethylating H3(K4). Chromatin immunoprecipitation (ChIP) studies indicate that the loss subunits of COMPASS required for histone trimethylation do not affect the localization of Set1 to chromatin for the genes tested. Collectively, our results suggest a molecular requirement for several components of COMPASS for proper histone H3 trimethylation and regulation of telomere-associated gene expression, indicating multiple roles for different forms of histone methylation by COMPASS.",
      "Poly(ADP-ribosyl)ation plays a major role in DNA repair, where it regulates chromatin relaxation as one of the critical events in the repair process. However, the molecular mechanism by which poly(ADP-ribose) modulates chromatin remains poorly understood. Here we identify the poly(ADP-ribose)-regulated protein APLF as a DNA-damage-specific histone chaperone. APLF preferentially binds to the histone H3/H4 tetramer via its C-terminal acidic motif, which is homologous to the motif conserved in the histone chaperones of the NAP1L family (NAP1L motif). We further demonstrate that APLF exhibits histone chaperone activities in a manner that is dependent on its acidic domain and that the NAP1L motif is critical for the repair capacity of APLF in vivo. Finally, we identify structural analogs of APLF in lower eukaryotes with the ability to bind histones and localize to the sites of DNA-damage-induced poly(ADP-ribosyl)ation. Collectively, these findings define the involvement of histone chaperones in poly(ADP-ribose)-regulated DNA repair reactions."
    ],
    "relevance_map": {
      "0": 1,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "5",
    "num_docs": 10
  },
  {
    "query": "5% of perinatal mortality is due to low birth weight.",
    "docs": [
      "CONTEXT One key target of the United Nations Millennium Development goals is to reduce the prevalence of underweight among children younger than 5 years by half between 1990 and 2015. OBJECTIVE To estimate trends in childhood underweight by geographic regions of the world. DESIGN, SETTING, AND PARTICIPANTS Time series study of prevalence of underweight, defined as weight 2 SDs below the mean weight for age of the National Center for Health Statistics and World Health Organization (WHO) reference population. National prevalence rates derived from the WHO Global Database on Child Growth and Malnutrition, which includes data on approximately 31 million children younger than 5 years who participated in 419 national nutritional surveys in 139 countries from 1965 through 2002. MAIN OUTCOME MEASURES Linear mixed-effects modeling was used to estimate prevalence rates and numbers of underweight children by region in 1990 and 2015 and to calculate the changes (ie, increase or decrease) to these values between 1990 and 2015. RESULTS Worldwide, underweight prevalence was projected to decline from 26.5% in 1990 to 17.6% in 2015, a change of -34% (95% confidence interval [CI], -43% to -23%). In developed countries, the prevalence was estimated to decrease from 1.6% to 0.9%, a change of -41% (95% CI, -92% to 343%). In developing regions, the prevalence was forecasted to decline from 30.2% to 19.3%, a change of -36% (95% CI, -45% to -26%). In Africa, the prevalence of underweight was forecasted to increase from 24.0% to 26.8%, a change of 12% (95% CI, 8%-16%). In Asia, the prevalence was estimated to decrease from 35.1% to 18.5%, a change of -47% (95% CI, -58% to -34%). Worldwide, the number of underweight children was projected to decline from 163.8 million in 1990 to 113.4 million in 2015, a change of -31% (95% CI, -40% to -20%). Numbers are projected to decrease in all subregions except the subregions of sub-Saharan, Eastern, Middle, and Western Africa, which are expected to experience substantial increases in the number of underweight children. CONCLUSIONS An overall improvement in the global situation is anticipated; however, neither the world as a whole, nor the developing regions, are expected to achieve the Millennium Development goals. This is largely due to the deteriorating situation in Africa where all subregions, except Northern Africa, are expected to fail to meet the goal.",
      "Analysis of excitatory synaptic transmission in the rat hypothalamic supraoptic nucleus revealed that glutamate clearance and, as a consequence, glutamate concentration and diffusion in the extracellular space, is associated with the degree of astrocytic coverage of its neurons. Reduction in glutamate clearance, whether induced pharmacologically or associated with a relative decrease of glial coverage in the vicinity of synapses, affected transmitter release through modulation of presynaptic metabotropic glutamate receptors. Astrocytic wrapping of neurons, therefore, contributes to the regulation of synaptic efficacy in the central nervous system.",
      "PURPOSE The circadian clock gene Bmal1 is involved in cancer cell proliferation and DNA damage sensitivity. The aim of this study was to explore the effect of Bmal1 on oxaliplatin sensitivity and to determine its clinical significance in colorectal cancer. EXPERIMENTAL DESIGN Three colorectal cancer cell lines, HCT116, THC8307 and HT29, were used. The Bmal1-mediated control of colorectal cancer cell proliferation was tested in vitro and in vivo. MTT and colony formation assays were performed to determine the sensitivity of colorectal cancer cells to oxaliplatin. Flow cytometry was used to examine changes in the cell-cycle distribution and apoptosis rate. Proteins expressed downstream of Bmal1 upon its overexpression were determined by Western blotting. Immunohistochemistry was used to analyze Bmal1 expression in 82 archived colorectal cancer tumors from patients treated with oxaliplatin-based regimens. RESULTS Bmal1 overexpression inhibited colorectal cancer cell proliferation and increased colorectal cancer sensitivity to oxaliplatin in three colorectal cancer cell lines and HCT116 cells model in vivo. Furthermore, the overall survival of patients with colorectal cancer with high Bmal1 levels in their primary tumors was significantly longer than that of patients with low Bmal1 levels (27 vs. 19 months; P = 0.043). The progression-free survival of patients with high Bmal1 expression was also significantly longer than that of patients with low Bmal1 expression (11 vs. 5 months; P = 0.015). Mechanistically, the effect of Bmal1 was associated with its ability to regulate G2-M arrest by activating the ATM pathway. CONCLUSION Bmal1 shows the potential as a novel prognostic biomarker and may represent a new therapeutic target in colorectal cancer.",
      "Neural stem cells are precursors of neurons and glial cells. During brain development, these cells proliferate, migrate and differentiate into specific lineages. Recently neural stem cells within the adult central nervous system were identified. Informations are now emerging about regulation of stem cell proliferation, migration and differentiation by numerous soluble factors such as chemokines and cytokines. However, the signal transduction mechanisms downstream of these factors are less clear. Here, we review potential evidences for a novel central role of the transcription factor nuclear factor kappa B (NF-kappaB) in these crucial signal transduction processes. NF-kappaB is an inducible transcription factor detected in neurons, glia and neural stem cells. NF-kappaB was discovered by David Baltimore's laboratory as a transcription factor in lymphocytes. NF-kappaB is involved in many biological processes such as inflammation and innate immunity, development, apoptosis and anti-apoptosis. It has been recently shown that members of the NF-kappaB family are widely expressed by neurons, glia and neural stem cells. In the nervous system, NF-kappaB plays a crucial role in neuronal plasticity, learning, memory consolidation, neuroprotection and neurodegeneration. Recent data suggest an important role of NF-kappaB on proliferation, migration and differentiation of neural stem cells. NF-kappaB is composed of three subunits: two DNA-binding and one inhibitory subunit. Activation of NF-kappaB takes place in the cytoplasm and results in degradation of the inhibitory subunit, thus enabling the nuclear import of the DNA-binding subunits. Within the nucleus, several target genes could be activated. In this review, we suggest a model explaining the multiple action of NF-kappaB on neural stem cells. Furthermore, we discuss the potential role of NF-kappaB within the so-called brain cancer stem cells.",
      "Bacteriophage T4 Dda helicase has recently been shown to be active as a monomer for unwinding of short duplex oligonucleotides and for displacing streptavidin from 3′-biotinylated oligonucleotides. However, its activity for streptavidin displacement and DNA unwinding has been shown to increase as the number of Dda molecules bound to the substrate molecule increases. A substrate was designed to address the ability of Dda to displace DNA binding proteins. A DNA binding site for the Escherichia coli trp repressor was introduced into an oligonucleotide substrate for Dda helicase containing single-stranded overhang. Here we show that a Dda monomer is insufficient to displace the E.coli trp repressor from dsDNA under single turnover conditions, although the substrate is unwound and the repressor displaced when the single-stranded overhang is long enough to accommodate two Dda molecules. The quantity of product formed increases when the substrate is able to accommodate more than two Dda molecules. These results indicate that multiple Dda molecules act to displace DNA binding proteins in a manner that correlates with the DNA unwinding activity and streptavidin displacement activity. We suggest a cooperative inchworm model to describe the activities of Dda helicase.",
      "Background  Extensive debate exists in the healthcare community over whether outcomes of medical care at teaching hospitals and other healthcare units are better or worse than those at the respective nonteaching ones. Thus, our goal was to systematically evaluate the evidence pertaining to this question. Methods and Findings  We reviewed all studies that compared teaching versus nonteaching healthcare structures for mortality or any other patient outcome, regardless of health condition. Studies were retrieved from PubMed, contact with experts, and literature cross-referencing. Data were extracted on setting, patients, data sources, author affiliations, definition of compared groups, types of diagnoses considered, adjusting covariates, and estimates of effect for mortality and for each other outcome. Overall, 132 eligible studies were identified, including 93 on mortality and 61 on other eligible outcomes (22 addressed both). Synthesis of the available adjusted estimates on mortality yielded a summary relative risk of 0.96 (95% confidence interval [CI], 0.93–1.00) for teaching versus nonteaching healthcare structures and 1.04 (95% CI, 0.99–1.10) for minor teaching versus nonteaching ones. There was considerable heterogeneity between studies (I2 = 72% for the main analysis). Results were similar in studies using clinical and those using administrative databases. No differences were seen in the 14 studies fully adjusting for volume/experience, severity, and comorbidity (relative risk 1.01). Smaller studies did not differ in their results from larger studies. Differences were seen for some diagnoses (e.g., significantly better survival for breast cancer and cerebrovascular accidents in teaching hospitals and significantly better survival from cholecystectomy in nonteaching hospitals), but these were small in magnitude. Other outcomes were diverse, but typically teaching healthcare structures did not do better than nonteaching ones. Conclusions  The available data are limited by their nonrandomized design, but overall they do not suggest that a healthcare facility's teaching status on its own markedly improves or worsens patient outcomes. Differences for specific diseases cannot be excluded, but are likely to be small.",
      "The available evidence suggests that the lethality of glioblastoma is driven by small subpopulations of cells that self-renew and exhibit tumorigenicity. It remains unclear whether tumorigenicity exists as a static property of a few cells or as a dynamically acquired property. We used tumor-sphere and xenograft formation as assays for tumorigenicity and examined subclones isolated from established and primary glioblastoma lines. Our results indicate that glioblastoma tumorigenicity is largely deterministic, yet the property can be acquired spontaneously at low frequencies. Further, these dynamic transitions are governed by epigenetic reprogramming through the lysine-specific demethylase 1 (LSD1). LSD depletion increases trimethylation of histone 3 lysine 4 at the avian myelocytomatosis viral oncogene homolog (MYC) locus, which elevates MYC expression. MYC, in turn, regulates oligodendrocyte lineage transcription factor 2 (OLIG2), SRY (sex determining region Y)-box 2 (SOX2), and POU class 3 homeobox 2 (POU3F2), a core set of transcription factors required for reprogramming glioblastoma cells into stem-like states. Our model suggests epigenetic regulation of key transcription factors governs transitions between tumorigenic states and provides a framework for glioblastoma therapeutic development.",
      "Observational clinical and ex vivo studies have established a strong association between atrial fibrillation and inflammation. However, whether inflammation is the cause or the consequence of atrial fibrillation and which specific inflammatory mediators may increase the atria's susceptibility to fibrillation remain elusive. Here we provide experimental and clinical evidence for the mechanistic involvement of myeloperoxidase (MPO), a heme enzyme abundantly expressed by neutrophils, in the pathophysiology of atrial fibrillation. MPO-deficient mice pretreated with angiotensin II (AngII) to provoke leukocyte activation showed lower atrial tissue abundance of the MPO product 3-chlorotyrosine, reduced activity of matrix metalloproteinases and blunted atrial fibrosis as compared to wild-type mice. Upon right atrial electrophysiological stimulation, MPO-deficient mice were protected from atrial fibrillation, which was reversed when MPO was restored. Humans with atrial fibrillation had higher plasma concentrations of MPO and a larger MPO burden in right atrial tissue as compared to individuals devoid of atrial fibrillation. In the atria, MPO colocalized with markedly increased formation of 3-chlorotyrosine. Our data demonstrate that MPO is a crucial prerequisite for structural remodeling of the myocardium, leading to an increased vulnerability to atrial fibrillation.",
      "The fate of cells in the epiblast at prestreak and early primitive streak stages has been studied by injecting horseradish peroxidase (HRP) into single cells in situ of 6.7-day mouse embryos and identifying the labelled descendants at midstreak to neural plate stages after one day of culture. Ectoderm was composed of descendants of epiblast progenitors that had been located in the embryonic axis anterior to the primitive streak. Embryonic mesoderm was derived from all areas of the epiblast except the distal tip and the adjacent region anterior to it: the most anterior mesoderm cells originated posteriorly, traversing the primitive streak early; labelled cells in the posterior part of the streak at the neural plate stage were derived from extreme anterior axial and paraxial epiblast progenitors; head process cells were derived from epiblast at or near the anterior end of the primitive streak. Endoderm descendants were most frequently derived from a region that included, but extended beyond, the region producing the head process: descendants of epiblast were present in endoderm by the midstreak stage, as well as at later stages. Yolk sac and amnion mesoderm developed from posterolateral and posterior epiblast. The resulting fate map is essentially the same as those of the chick and urodele and indicates that, despite geometrical differences, topological fate relationships are conserved among these vertebrates. Clonal descendants were not necessarily confined to a single germ layer or to extraembryonic mesoderm, indicating that these lineages are not separated at the beginning of gastrulation. The embryonic axis lengthened up to the neural plate stage by (1) elongation of the primitive streak through progressive incorporation of the expanding lateral and initially more anterior regions of epiblast and, (2) expansion of the region of epiblast immediately cranial to the anterior end of the primitive streak. The population doubling time of labelled cells was 7.5 h; a calculated 43% were in, or had completed, a 4th cell cycle, and no statistically significant regional differences in the number of descendants were found. This clonal analysis also showed that (1) growth in the epiblast was noncoherent and in most regions anisotropic and directed towards the primitive streak and (2) the midline did not act as a barrier to clonal spread, either in the epiblast in the anterior half of the axis or in the primitive streak. These results taken together with the fate map indicate that, while individual cells in the epiblast sheet behave independently with respect to their neighbours, morphogenetic movement during germ layer formation is coordinated in the population as a whole.",
      "Tuberculosis (TB) is more prevalent in the world today than at any other time in human history. Mycobacterium tuberculosis, the pathogen responsible for TB, uses diverse strategies to survive in a variety of host lesions and to evade immune surveillance. A key question is how robust are our approaches to discovering new TB drugs, and what measures could be taken to reduce the long and protracted clinical development of new drugs. The emergence of multi-drug-resistant strains of M. tuberculosis makes the discovery of new molecular scaffolds a priority, and the current situation even necessitates the re-engineering and repositioning of some old drug families to achieve effective control. Whatever the strategy used, success will depend largely on our proper understanding of the complex interactions between the pathogen and its human host. In this review, we discuss innovations in TB drug discovery and evolving strategies to bring newer agents more quickly to patients."
    ],
    "relevance_map": {
      "0": 1,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "13",
    "num_docs": 10
  },
  {
    "query": "A deficiency of vitamin B12 increases blood levels of homocysteine.",
    "docs": [
      "BACKGROUND Homocysteine is a risk factor for coronary artery disease (CAD), although a causal relation remains to be proven. The importance of determining direct causality rests in the fact that plasma homocysteine can be safely and inexpensively reduced by 25% with folic acid. This reduction is maximally achieved by doses of 0.4 mg/d. High-dose folic acid (5 mg/d) improves endothelial function in CAD, although the mechanism is controversial. It has been proposed that improvement occurs through reduction in total (tHcy) or free (non-protein bound) homocysteine (fHcy). We investigated the effects of folic acid on endothelial function before a change in homocysteine in patients with CAD. METHODS AND RESULTS A randomized, placebo-controlled study of folic acid (5 mg/d) for 6 weeks was undertaken in 33 patients. Endothelial function, assessed by flow-mediated dilatation (FMD), was measured before, at 2 and 4 hours after the first dose of folic acid, and after 6 weeks of treatment. Plasma folate increased markedly by 1 hour (200 compared with 25.8 nmol/L; P<0.001). FMD improved at 2 hours (83 compared with 47 microm; P<0.001) and was largely complete by 4 hours (101 compared with 51 microm; P<0.001). tHcy did not significantly differ acutely (4-hour tHcy, 9.56 compared with 9.79 micromol/L; P=NS). fHcy did not differ at 3 hours but was slightly reduced at 4 hours (1.55 compared with 1.78 micromol/L; P=0.02). FMD improvement did not correlate with reductions in either fHcy or tHcy at any time. CONCLUSIONS These data suggest that folic acid improves endothelial function in CAD acutely by a mechanism largely independent of homocysteine.",
      "The cellular and molecular mechanisms that enable us to sense cold are not well understood. Insights into this process have come from the use of pharmacological agents, such as menthol, that elicit a cooling sensation. Here we have characterized and cloned a menthol receptor from trigeminal sensory neurons that is also activated by thermal stimuli in the cool to cold range. This cold- and menthol-sensitive receptor, CMR1, is a member of the TRP family of excitatory ion channels, and we propose that it functions as a transducer of cold stimuli in the somatosensory system. These findings, together with our previous identification of the heat-sensitive channels VR1 and VRL-1, demonstrate that TRP channels detect temperatures over a wide range and are the principal sensors of thermal stimuli in the mammalian peripheral nervous system.",
      "Spatial boundaries of homeotic gene expression are initiated and maintained by two sets of transcriptional repressors: the gap gene products and the Polycomb group proteins. Previously, the Hunchback (HB) protein has been implicated in setting the anterior expression limit of the UBX homeotic protein in parasegment 6. Here we investigate DNA elements and trans-acting repressors that control spatial expression of the Abdominal-A (ABD-A) homeotic protein. Analysis of a 1.7-kb enhancer element [iab-2(1.7)] from the iab-2 regulatory region shows that in contrast to Ubx enhancer elements, both HB and Krüppel (KR) are required to set the ABD-A anterior boundary in parasegment 7. DNase I footprinting and site-directed mutagenesis show that HB and KR are direct regulators of this iab-2 enhancer. The single KR site can be moved to a new location 100 bp away and still maintain repressive activity, whereas relocation by 300 bp abolishes activity. These results suggest that KR repression occurs through a local quenching mechanism. We also show that the gap repressor Giant (GT) initially establishes a posterior expression limit at PS9, which shifts posteriorly after the blastoderm stage. Finally, we show that this iab-2 enhancer contains multiple binding sites for the Polycomb group protein Pleiohomeotic (PHO). These iab-2 PHO sites are required in vivo for chromosome pairing-dependent repression of a mini-white reporter. However, the PHO sites are not sufficient to maintain repression of a homeotic reporter gene anterior to PS7. Full maintenance at late embryonic stages requires additional sequences adjacent to the iab-2(1.7) enhancer.",
      "The architecture and adhesiveness of a cell microenvironment is a critical factor for the regulation of spindle orientation in vivo. Using a combination of theory and experiments, we have investigated spindle orientation in HeLa (human) cells. Here we show that spindle orientation can be understood as the result of the action of cortical force generators, which interact with spindle microtubules and are activated by cortical cues. We develop a simple physical description of this spindle mechanics, which allows us to calculate angular profiles of the torque acting on the spindle, as well as the angular distribution of spindle orientations. Our model accounts for the preferred spindle orientation and the shape of the full angular distribution of spindle orientations observed in a large variety of different cellular microenvironment geometries. It also correctly describes asymmetric spindle orientations, which are observed for certain distributions of cortical cues. We conclude that, on the basis of a few simple assumptions, we can provide a quantitative description of the spindle orientation of adherent cells.",
      "Cancer stem cells have been proposed to be important for initiation, maintenance and recurrence of various malignancies, including acute myeloid leukemia (AML). We have previously reported that CD34+CD38− human primary AML stem cells residing in the endosteal region of the bone marrow are relatively chemotherapy resistant. Using a NOD/SCID/IL2rγnull mouse model of human AML, we now show that the AML stem cells in the endosteal region are cell cycle quiescent and that these stem cells can be induced to enter the cell cycle by treatment with granulocyte colony-stimulating factor (G-CSF). In combination with cell cycle-dependent chemotherapy, G-CSF treatment significantly enhances induction of apoptosis and elimination of human primary AML stem cells in vivo. The combination therapy leads to significantly increased survival of secondary recipients after transplantation of leukemia cells compared with chemotherapy alone.",
      "The small GTPase Rac1 orchestrates actin-dependent remodeling essential for numerous cellular processes including synapse development. While precise spatiotemporal regulation of Rac1 is necessary for its function, little is known about the mechanisms that enable Rac1 activators (GEFs) and inhibitors (GAPs) to act in concert to regulate Rac1 signaling. Here, we identify a regulatory complex composed of a Rac-GEF (Tiam1) and a Rac-GAP (Bcr) that cooperate to control excitatory synapse development. Disruption of Bcr function within this complex increases Rac1 activity and dendritic spine remodeling, resulting in excessive synaptic growth that is rescued by Tiam1 inhibition. Notably, EphB receptors utilize the Tiam1-Bcr complex to control synaptogenesis. Following EphB activation, Tiam1 induces Rac1-dependent spine formation, whereas Bcr prevents Rac1-mediated receptor internalization, promoting spine growth over retraction. The finding that a Rac-specific GEF/GAP complex is required to maintain optimal levels of Rac1 signaling provides an important insight into the regulation of small GTPases.",
      "We review the cellular mechanisms implicated in cholesterol trafficking and distribution. Recent studies have provided new information about the distribution of sterols within cells, including analysis of its transbilayer distribution. The cholesterol interaction with other lipids and its engagement in various trafficking processes will determine its proper level in a specific membrane; making the cholesterol distribution uneven among the various intracellular organelles. The cholesterol content is important since cholesterol plays an essential role in membranes by controlling their physicochemical properties as well as key cellular events such as signal transduction and protein trafficking. Cholesterol movement between cellular organelles is highly dynamic, and can be achieved by vesicular and non-vesicular processes. Various studies have analyzed the proteins that play a significant role in these processes, giving us new information about the relative importance of these two trafficking pathways in cholesterol transport. Although still poorly characterized in many trafficking routes, several potential sterol transport proteins have been described in detail; as a result, molecular mechanisms for sterol transport among membranes start to be appreciated.",
      "BACKGROUND Polar bears (Ursus maritimus) are among those species most susceptible to the rapidly changing arctic climate, and their survival is of global concern. Despite this, little is known about polar bear species history. Future conservation strategies would significantly benefit from an understanding of basic evolutionary information, such as the timing and conditions of their initial divergence from brown bears (U. arctos) or their response to previous environmental change. RESULTS We used a spatially explicit phylogeographic model to estimate the dynamics of 242 brown bear and polar bear matrilines sampled throughout the last 120,000 years and across their present and past geographic ranges. Our results show that the present distribution of these matrilines was shaped by a combination of regional stability and rapid, long-distance dispersal from ice-age refugia. In addition, hybridization between polar bears and brown bears may have occurred multiple times throughout the Late Pleistocene. CONCLUSIONS The reconstructed matrilineal history of brown and polar bears has two striking features. First, it is punctuated by dramatic and discrete climate-driven dispersal events. Second, opportunistic mating between these two species as their ranges overlapped has left a strong genetic imprint. In particular, a likely genetic exchange with extinct Irish brown bears forms the origin of the modern polar bear matriline. This suggests that interspecific hybridization not only may be more common than previously considered but may be a mechanism by which species deal with marginal habitats during periods of environmental deterioration.",
      "Cells deficient in a major DNA double-strand break repair pathway (nonhomologous DNA end joining [NHEJ]) have increased spontaneous chromosome breaks; however, the source of these chromosome breaks has remained undefined. Here, we show that the observed spontaneous chromosome breaks are partially suppressed by reducing the cellular oxygen tension. Conversely, elevating the level of reactive oxygen species by overexpressing the antioxidant enzyme superoxide dismutase 1 (SOD1), in a transgenic mouse, increases chromosome breakage. The effect of SOD1 can also be modulated by cellular oxygen tension. The elevated chromosome breakage correlates histologically with a significant increase in the amount of neuronal cell death in Ku86(-/-) SOD1 transgenic embryos over that seen in Ku86(-/-) embryos. Therefore, oxygen metabolism is a major source of the genomic instability observed in NHEJ-deficient cells and, presumably, in all cells.",
      "Mouse bone marrow hematopoietic stem cells were isolated with the use of a variety of phenotypic markers. These cells can proliferate and differentiate with approximately unit efficiency into myelomonocytic cells, B cells, or T cells. Thirty of these cells are sufficient to save 50 percent of lethally irradiated mice, and to reconstitute all blood cell types in the survivors."
    ],
    "relevance_map": {
      "0": 1,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "36",
    "num_docs": 10
  },
  {
    "query": "A high microerythrocyte count raises vulnerability to severe anemia in homozygous alpha (+)- thalassemia trait subjects.",
    "docs": [
      "BACKGROUND The heritable haemoglobinopathy alpha(+)-thalassaemia is caused by the reduced synthesis of alpha-globin chains that form part of normal adult haemoglobin (Hb). Individuals homozygous for alpha(+)-thalassaemia have microcytosis and an increased erythrocyte count. Alpha(+)-thalassaemia homozygosity confers considerable protection against severe malaria, including severe malarial anaemia (SMA) (Hb concentration < 50 g/l), but does not influence parasite count. We tested the hypothesis that the erythrocyte indices associated with alpha(+)-thalassaemia homozygosity provide a haematological benefit during acute malaria. METHODS AND FINDINGS Data from children living on the north coast of Papua New Guinea who had participated in a case-control study of the protection afforded by alpha(+)-thalassaemia against severe malaria were reanalysed to assess the genotype-specific reduction in erythrocyte count and Hb levels associated with acute malarial disease. We observed a reduction in median erythrocyte count of approximately 1.5 x 10(12)/l in all children with acute falciparum malaria relative to values in community children (p < 0.001). We developed a simple mathematical model of the linear relationship between Hb concentration and erythrocyte count. This model predicted that children homozygous for alpha(+)-thalassaemia lose less Hb than children of normal genotype for a reduction in erythrocyte count of >1.1 x 10(12)/l as a result of the reduced mean cell Hb in homozygous alpha(+)-thalassaemia. In addition, children homozygous for alpha(+)-thalassaemia require a 10% greater reduction in erythrocyte count than children of normal genotype (p = 0.02) for Hb concentration to fall to 50 g/l, the cutoff for SMA. We estimated that the haematological profile in children homozygous for alpha(+)-thalassaemia reduces the risk of SMA during acute malaria compared to children of normal genotype (relative risk 0.52; 95% confidence interval [CI] 0.24-1.12, p = 0.09). CONCLUSIONS The increased erythrocyte count and microcytosis in children homozygous for alpha(+)-thalassaemia may contribute substantially to their protection against SMA. A lower concentration of Hb per erythrocyte and a larger population of erythrocytes may be a biologically advantageous strategy against the significant reduction in erythrocyte count that occurs during acute infection with the malaria parasite Plasmodium falciparum. This haematological profile may reduce the risk of anaemia by other Plasmodium species, as well as other causes of anaemia. Other host polymorphisms that induce an increased erythrocyte count and microcytosis may confer a similar advantage.",
      "Intrahost genetic diversity was analysed in naturally infected mosquitoes and birds to determine whether West Nile virus (WNV) exists in nature as a quasispecies and to quantify selective pressures within and between hosts. WNV was sampled from ten infected birds and ten infected mosquito pools collected on Long Island, NY, USA, during the peak of the 2003 WNV transmission season. A 1938 nt fragment comprising the 3' 1159 nt of the WNV envelope (E) coding region and the 5' 779 nt of the non-structural protein 1 (NS1) coding region was amplified and cloned and 20 clones per specimen were sequenced. Results from this analysis demonstrate that WNV infections are derived from a genetically diverse population of genomes in nature. The mean nucleotide diversity was 0.016 % within individual specimens and the mean percentage of clones that differed from the consensus sequence was 19.5 %. WNV sequences in mosquitoes were significantly more genetically diverse than WNV in birds. No host-dependent bias for particular types of mutations was observed and estimates of genetic diversity did not differ significantly between E and NS1 coding sequences. Non-consensus clones obtained from two avian specimens had highly similar genetic signatures, providing preliminary evidence that WNV genetic diversity may be maintained throughout the enzootic transmission cycle, rather than arising independently during each infection. Evidence of purifying selection was obtained from both intra- and interhost WNV populations. Combined, these data support the observation that WNV populations may be structured as a quasispecies and document strong purifying natural selection in WNV populations.",
      "PURPOSE To describe the long-term (≥ 10 years) benefits of clinical human papillomavirus (HPV) DNA testing for cervical precancer and cancer risk prediction. METHODS Cervicovaginal lavages collected from 19,512 women attending a health maintenance program were retrospectively tested for HPV using a clinical test. HPV positives were tested for HPV16 and HPV18 individually using a research test. A Papanicolaou (Pap) result classified as atypical squamous cells of undetermined significance (ASC-US) or more severe was considered abnormal. Women underwent follow-up prospectively with routine annual Pap testing up to 18 years. Cumulative incidence rates (CIRs) of ≥ grade 3 cervical intraepithelial neoplasia (CIN3+) or cancer for enrollment test results were calculated. RESULTS A baseline negative HPV test provided greater reassurance against CIN3+ over the 18-year follow-up than a normal Pap (CIR, 0.90% v 1.27%). Although both baseline Pap and HPV tests predicted who would develop CIN3+ within the first 2 years of follow-up, only HPV testing predicted who would develop CIN3+ 10 to 18 years later (P = .004). HPV16- and HPV18-positive women with normal Pap were at elevated risk of CIN3+ compared with other HPV-positive women with normal Pap and were at similar risk of CIN3+ compared with women with a low-grade squamous intraepithelial Pap. CONCLUSION HPV testing to rule out cervical disease followed by Pap testing and possibly combined with the detection of HPV16 and HPV18 among HPV positives to identify those at immediate risk of CIN3+ would be an efficient algorithm for cervical cancer screening, especially in women age 30 years or older.",
      "Objective:A number of case reports describe multiple family members with gastroesophageal reflux disease and Barrett's esophagus. The wider importance of familial factors in gastroesophageal reflux disease has not been established. Therefore, we have studied the prevalence of reflux symptoms and medication use among relatives of patients with documented gastroesophageal reflux disease. Methods:A postal questionnaire study of the first degree relatives of six groups of matched patients. The groups comprised patients with 1) no dyspeptic symptoms; 2) reflux symptoms and a normal pH study; 3) reflux symptoms, an abnormal pH study, and a lower esophageal sphincter (LOS) pressure more than 10 mm Hg; 4) reflux symptoms, an abnormal pH study, and a LOS pressure less than 10 mm Hg; 5) Barrett's esophagus; and 6) peptic stricture. Results:Four hundred eighteen subjects replied (78% response). Infrequent reflux symptoms were equally common in all groups of relatives. Frequent reflux symptoms, however, were more common among relatives of patients with an abnormal pH study and normal (26%, p= 0.007) or low LOS pressure (27%, p= 0.01) or Barrett's esophagus (30%, p= 0.003), compared with relatives of nondyspeptic patients (9%). Frequent reflux symptoms were no more common among relatives of patients with a normal pH study (16%) or peptic stricture (18%). Reflux medication use showed a similar pattern. Conclusions:Familial clustering of reflux symptoms is seen in relatives of patients with reflux symptoms and increased esophageal acid exposure and in relatives of patients with Barrett's esophagus.",
      "Proper regulation of energy storage in adipose tissue is crucial for maintaining insulin sensitivity and molecules contributing to this process have not been fully revealed. Here we show that type II transmembrane protein tenomodulin (TNMD) is upregulated in adipose tissue of insulin-resistant versus insulin-sensitive individuals, who were matched for body mass index (BMI). TNMD expression increases in human preadipocytes during differentiation, whereas silencing TNMD blocks adipogenesis. Upon high-fat diet feeding, transgenic mice overexpressing Tnmd develop increased epididymal white adipose tissue (eWAT) mass, and preadipocytes derived from Tnmd transgenic mice display greater proliferation, consistent with elevated adipogenesis. In Tnmd transgenic mice, lipogenic genes are upregulated in eWAT, as is Ucp1 in brown fat, while liver triglyceride accumulation is attenuated. Despite expanded eWAT, transgenic animals display improved systemic insulin sensitivity, decreased collagen deposition and inflammation in eWAT, and increased insulin stimulation of Akt phosphorylation. Our data suggest that TNMD acts as a protective factor in visceral adipose tissue to alleviate insulin resistance in obesity.",
      "OBJECTIVE Nociceptive and neuropathic components both contribute to pain. Since these components require different pain management strategies, correct pain diagnosis before and during treatment is highly desirable. As low back pain (LBP) patients constitute an important subgroup of chronic pain patients, we addressed the following issues: (i) to establish a simple, validated screening tool to detect neuropathic pain (NeP) components in chronic LBP patients, (ii) to determine the prevalence of neuropathic pain components in LBP in a large-scale survey, and (iii) to determine whether LBP patients with an NeP component suffer from worse, or different, co-morbidities. METHODS In co-operation with the German Research Network on Neuropathic Pain we developed and validated the painDETECT questionnaire (PD-Q) in a prospective, multicentre study and subsequently applied it to approximately 8000 LBP patients. RESULTS The PD-Q is a reliable screening tool with high sensitivity, specificity and positive predictive accuracy; these were 84% in a palm-top computerised version and 85%, 80% and 83%, respectively, in a corresponding pencil-and-paper questionnaire. In an unselected cohort of chronic LBP patients, 37% were found to have predominantly neuropathic pain. Patients with NeP showed higher ratings of pain intensity, with more (and more severe) co-morbidities such as depression, panic/anxiety and sleep disorders. This also affected functionality and use of health-care resources. On the basis of given prevalence of LBP in the general population, we calculated that 14.5% of all female and 11.4% of all male Germans suffer from LBP with a predominant neuropathic pain component. CONCLUSION Simple, patient-based, easy-to-use screening questionnaires can determine the prevalence of neuropathic pain components both in individual LBP patients and in heterogeneous cohorts of such patients. Since NeP correlates with more intense pain, more severe co-morbidity and poorer quality of life, accurate diagnosis is a milestone in choosing appropriate therapy.",
      "Despite rapid progress in characterizing transcription factor-driven reprogramming of somatic cells to an induced pluripotent stem cell (iPSC) state, many mechanistic questions still remain. To gain insight into the earliest events in the reprogramming process, we systematically analyzed the transcriptional and epigenetic changes that occur during early factor induction after discrete numbers of divisions. We observed rapid, genome-wide changes in the euchromatic histone modification, H3K4me2, at more than a thousand loci including large subsets of pluripotency-related or developmentally regulated gene promoters and enhancers. In contrast, patterns of the repressive H3K27me3 modification remained largely unchanged except for focused depletion specifically at positions where H3K4 methylation is gained. These chromatin regulatory events precede transcriptional changes within the corresponding loci. Our data provide evidence for an early, organized, and population-wide epigenetic response to ectopic reprogramming factors that clarify the temporal order through which somatic identity is reset during reprogramming.",
      "BACKGROUND Radiographic contrast agents can cause a reduction in renal function that may be due to reactive oxygen species. Whether the reduction can be prevented by the administration of antioxidants is unknown. METHODS We prospectively studied 83 patients with chronic renal insufficiency (mean [+/-SD] serum creatinine concentration, 2.4+/-1.3 mg per deciliter [216+/-116 micromol per liter]) who were undergoing computed tomography with a nonionic, low-osmolality contrast agent. Patients were randomly assigned either to receive the antioxidant acetylcysteine (600 mg orally twice daily) and 0.45 percent saline intravenously, before and after administration of the contrast agent, or to receive placebo and saline. RESULTS Ten of the 83 patients (12 percent) had an increase of at least 0.5 mg per deciliter (44 micromol per liter) in the serum creatinine concentration 48 hours after administration of the contrast agent: 1 of the 41 patients in the acetylcysteine group (2 percent) and 9 of the 42 patients in the control group (21 percent; P=0.01; relative risk, 0.1; 95 percent confidence interval, 0.02 to 0.9). In the acetylcysteine group, the mean serum creatinine concentration decreased significantly (P<0.001), from 2.5+/-1.3 to 2.1+/-1.3 mg per deciliter (220+/-118 to 186+/-112 micromol per liter) 48 hours after the administration of the contrast medium, whereas in the control group, the mean serum creatinine concentration increased nonsignificantly (P=0.18), from 2.4+/-1.3 to 2.6+/-1.5 mg per deciliter (212+/-114 to 226+/-133 micromol per liter) (P<0.001 for the comparison between groups). CONCLUSIONS Prophylactic oral administration of the antioxidant acetylcysteine, along with hydration, prevents the reduction in renal function induced by contrast agents in patients with chronic renal insufficiency.",
      "Post-translational modification of chemokines mediated by the dipeptidyl peptidase DPP4 (CD26) has been shown to negatively regulate lymphocyte trafficking, and its inhibition enhances T cell migration and tumor immunity by preserving functional chemokine CXCL10. By extending those initial findings to pre-clinical models of hepatocellular carcinoma and breast cancer, we discovered a distinct mechanism by which inhibition of DPP4 improves anti-tumor responses. Administration of the DPP4 inhibitor sitagliptin resulted in higher concentrations of the chemokine CCL11 and increased migration of eosinophils into solid tumors. Enhanced tumor control was preserved in mice lacking lymphocytes and was ablated after depletion of eosinophils or treatment with degranulation inhibitors. We further demonstrated that tumor-cell expression of the alarmin IL-33 was necessary and sufficient for eosinophil-mediated anti-tumor responses and that this mechanism contributed to the efficacy of checkpoint-inhibitor therapy. These findings provide insight into IL-33- and eosinophil-mediated tumor control, revealed when endogenous mechanisms of DPP4 immunoregulation are inhibited. Eosinophils have been described mainly in allergy settings but are increasingly appreciated as being involved in other aspects of immunity. Albert and colleagues use a clinically approved inhibitor of the dipeptidyl peptidase DPP4 to facilitate the recruitment of eosinophils to mouse tumors, where they are essential in tumor destruction.",
      "This paper proposes and tests a technique for imaging orientationally invariant indices of axon diameter and density in white matter using diffusion magnetic resonance imaging. Such indices potentially provide more specific markers of white matter microstructure than standard indices from diffusion tensor imaging. Orientational invariance allows for combination with tractography and presents new opportunities for mapping brain connectivity and quantifying disease processes. The technique uses a four-compartment tissue model combined with an optimized multishell high-angular-resolution pulsed-gradient-spin-echo acquisition. We test the method in simulation, on fixed monkey brains using a preclinical scanner and on live human brains using a clinical 3T scanner. The human data take about one hour to acquire. The simulation experiments show that both monkey and human protocols distinguish distributions of axon diameters that occur naturally in white matter. We compare the axon diameter index with the mean axon diameter weighted by axon volume. The index differs from this mean and is protocol dependent, but correlation is good for the monkey protocol and weaker, but discernible, for the human protocol where greater diffusivity and lower gradient strength limit sensitivity to only the largest axons. Maps of axon diameter and density indices from the monkey and human data in the corpus callosum and corticospinal tract reflect known trends from histology. The results show orientationally invariant sensitivity to natural axon diameter distributions for the first time with both specialist and clinical hardware. This demonstration motivates further refinement, validation, and evaluation of the precise nature of the indices and the influence of potential confounds."
    ],
    "relevance_map": {
      "0": 1,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "42",
    "num_docs": 10
  },
  {
    "query": "A total of 1,000 people in the UK are asymptomatic carriers of vCJD infection.",
    "docs": [
      "OBJECTIVES To carry out a further survey of archived appendix samples to understand better the differences between existing estimates of the prevalence of subclinical infection with prions after the bovine spongiform encephalopathy epizootic and to see whether a broader birth cohort was affected, and to understand better the implications for the management of blood and blood products and for the handling of surgical instruments. DESIGN Irreversibly unlinked and anonymised large scale survey of archived appendix samples. SETTING Archived appendix samples from the pathology departments of 41 UK hospitals participating in the earlier survey, and additional hospitals in regions with lower levels of participation in that survey. SAMPLE 32,441 archived appendix samples fixed in formalin and embedded in paraffin and tested for the presence of abnormal prion protein (PrP). RESULTS Of the 32,441 appendix samples 16 were positive for abnormal PrP, indicating an overall prevalence of 493 per million population (95% confidence interval 282 to 801 per million). The prevalence in those born in 1941-60 (733 per million, 269 to 1596 per million) did not differ significantly from those born between 1961 and 1985 (412 per million, 198 to 758 per million) and was similar in both sexes and across the three broad geographical areas sampled. Genetic testing of the positive specimens for the genotype at PRNP codon 129 revealed a high proportion that were valine homozygous compared with the frequency in the normal population, and in stark contrast with confirmed clinical cases of vCJD, all of which were methionine homozygous at PRNP codon 129. CONCLUSIONS This study corroborates previous studies and suggests a high prevalence of infection with abnormal PrP, indicating vCJD carrier status in the population compared with the 177 vCJD cases to date. These findings have important implications for the management of blood and blood products and for the handling of surgical instruments.",
      "Dendritic cells (DCs) are crucial for mounting allergic airway inflammation, but it is unclear which subset of DCs performs this task. By using CD64 and MAR-1 staining, we reliably separated CD11b(+) monocyte-derived DCs (moDCs) from conventional DCs (cDCs) and studied antigen uptake, migration, and presentation assays of lung and lymph node (LN) DCs in response to inhaled house dust mite (HDM). Mainly CD11b(+) cDCs but not CD103(+) cDCs induced T helper 2 (Th2) cell immunity in HDM-specific T cells in vitro and asthma in vivo. Studies in Flt3l(-/-) mice, lacking all cDCs, revealed that moDCs were also sufficient to induce Th2 cell-mediated immunity but only when high-dose HDM was given. The main function of moDCs was the production of proinflammatory chemokines and allergen presentation in the lung during challenge. Thus, we have identified migratory CD11b(+) cDCs as the principal subset inducing Th2 cell-mediated immunity in the LN, whereas moDCs orchestrate allergic inflammation in the lung.",
      "BACKGROUND Cali, Colombia, has a high incidence of interpersonal violence deaths. Various alcohol control policies have been implemented to reduce alcohol-related problems. The objective of this study was to determine whether different alcohol control policies were associated with changes in the incidence rate of homicides. METHODS Ecologic study conducted during 2004-08 using a time-series design. Policies were implemented with variations in hours of restriction of sales and consumption of alcohol. Most restrictive policies prohibited alcohol between 2 a.m. and 10 a.m. for 446 non-consecutive days. Moderately restrictive policies prohibited alcohol between 3 a.m. and 10 a.m. for 1277 non-consecutive days. Lax policies prohibited alcohol between 4 a.m. and 10 a.m. for 104 non-consecutive days. In conditional autoregressive negative binomial regressions, rates of homicides and unintentional injury deaths (excluding traffic events) were compared between different periods of days when different policies were in effect. RESULTS There was an increased risk of homicides in periods when the moderately restrictive policies were in effect compared with periods when the most restrictive policies were in effect [incidence rate ratio (IRR) 1.15, 90% confidence interval (CI) 1.05-1.26, P = 0.012], and there was an even higher risk of homicides in periods when the lax policies were in effect compared with periods when the most restrictive policies were in effect (IRR 1.42, 90% CI 1.26-1.61, P < 0.001). Less restrictive policies were not associated with increased risk of unintentional injury deaths. CONCLUSION Extended hours of sales and consumption of alcohol were associated with increased risk of homicides. Strong restrictions on alcohol availability could reduce the incidence of interpersonal violence events in communities where homicides are high.",
      "A novel differentiation-dependent cDNA (DIF-2) has been isolated from human mononuclear phagocytes by differential display. The full-length cDNA was cloned and sequenced. DIF-2 consists of 156 amino acids and has a predicted isoelectric point of 8.84. The mRNA is expressed in freshly isolated monocytes and is downregulated significantly when monocytes are subjected to differentiation. A similar differentiation-dependent downregulation is observed in normal hepatocytes compared to undifferentiated HepG2 cells. The mRNA expression in monocytes is sensitive to lipopolysaccharide and ceramide which both strongly increase DIF-2 transcription, while lysophosphatidylcholine results in a weaker upregulation of DIF-2 expression. A DIF-2 homologous gene has been previously isolated from mouse fibroblasts and was shown to be a serum growth factor-inducible immediate early gene. Our results indicate that DIF-2 represents a gene which is regulated in differentiation processes and strongly responsive to lipopolysaccharide, ceramide and lysophosphatidylcholine.",
      "PURPOSE To identify factors affecting the short-term prognosis of patients with acutely exacerbated chronic obstructive pulmonary disease (COPD). PATIENTS AND METHODS The 590 patients having COPD as primary disease who were hospitalized in the pneumology unit of a university hospital from 1981 to 1990 were studied. A standardized protocol for the treatment of acutely exacerbated COPD was adopted for all the patients. The patient records were retrospectively analyzed by two observers, and 23 clinical and laboratory variables defining the patient status on admission were collected. Age and arterial gas data were also taken into account, and the outcome mortality was recorded. Interobserver reproducibility was tested by computing the kappa coefficient and Spearman's rho for dichotomous and continuous variables, respectively. The relationship of clinical and laboratory factors to the outcome was assessed first by univariate analysis and then by a logistic regression analysis assessing the independent predictive role of variables previously shown to be univariately correlated with mortality. RESULTS The mortality rate was 14.4%. The logistic regression analysis identified four independent predictors of death: age (odds ratio [OR] 1.07; 95% confidence interval [CI] 1.04 to 1.11), alveolar-arterial oxygen gradient greater than 41 mm Hg (OR 2.33; 95% CI 1.39 to 3.90), ventricular arrhythmias (OR 1.91; 95% CI 1.10 to 3.31), and atrial fibrillation (OR 2.27; 95% CI 1.14 to 4.51). CONCLUSIONS Patients with acutely exacerbated COPD having a high risk of death can be identified at the time of admission. Variables reflecting heart dysfunction are important determinants of this risk. Among pulmonary function data, only alveolar-arterial oxygen gradient contributes to the predictive model.",
      "Megakaryocytes undergo a unique differentiation program, becoming polyploid through repeated cycles of DNA synthesis without concomitant cell division. However, the mechanism underlying this polyploidization remains totally unknown. It has been postulated that polyploidization is due to a skipping of mitosis after each round of DNA replication. We carried out immunohistochemical studies on mouse bone marrow megakaryocytes during thrombopoietin- induced polyploidization and found that during this process megakaryocytes indeed enter mitosis and progress through normal prophase, prometaphase, metaphase, and up to anaphase A, but not to anaphase B, telophase, or cytokinesis. It was clearly observed that multiple spindle poles were formed as the polyploid megakaryocytes entered mitosis; the nuclear membrane broke down during prophase; the sister chromatids were aligned on a multifaced plate, and the centrosomes were symmetrically located on either side of each face of the plate at metaphase; and a set of sister chromatids moved into the multiple centrosomes during anaphase A. We further noted that the pair of spindle poles in anaphase were located in close proximity to each other, probably because of the lack of outward movement of spindle poles during anaphase B. Thus, the reassembling nuclear envelope may enclose all the sister chromatids in a single nucleus at anaphase and then skip telophase and cytokinesis. These observations clearly indicate that polyploidization of megakaryocytes is not simply due to a skipping of mitosis, and that the megakaryocytes must have a unique regulatory mechanism in anaphase, e.g., factors regulating anaphase such as microtubule motor proteins might be involved in this polyploidization process.",
      "Glucocorticoids repress NFkappaB-mediated activation of proinflammatory genes such as interleukin-8 (IL-8) and ICAM-1. Our experiments suggest that the glucocorticoid receptor (GR) confers this effect by associating through protein-protein interactions with NFkappaB bound at each of these genes. That is, we show that the GR zinc binding region (ZBR), which includes the DNA binding and dimerization functions of the receptor, binds directly to the dimerization domain of the RelA subunit of NFkappaB in vitro and that the ZBR is sufficient to associate with RelA bound at NFkappaB response elements in vivo. Moreover, we demonstrate in vivo and in vitro that GR does not disrupt DNA binding by NFkappaB. In transient transfections, we found that the GR ligand binding domain is essential for repression of NFkappaB but not for association with it and that GR can repress an NFkappaB derivative bearing a heterologous activation domain. We used chromatin immunoprecipitation assays in untransfected A549 cells to infer the mechanism by which the tethered GR represses NFkappaB-activated transcription. As expected, we found that the inflammatory signal TNFalpha stimulated preinitiation complex (PIC) assembly at the IL-8 and ICAM-1 promoters and that the largest subunit of RNA polymerase II (pol II) in those complexes became phosphorylated at serines 2 and 5 in its carboxy-terminal domain (CTD) heptapeptide repeats (YSPTSPS); these modifications are required for transcription initiation. Remarkably, GR did not inhibit PIC assembly under repressing conditions, but rather interfered with phosphorylation of serine 2 of the pol II CTD.",
      "LIN28B is a RNA-binding protein regulating predominantly let-7 microRNAs with essential functions in inflammation, wound healing, embryonic stem cells, and cancer. LIN28B expression is associated with tumor initiation, progression, resistance, and poor outcome in several solid cancers, including lung cancer. However, the functional role of LIN28B, especially in non-small cell lung adenocarcinomas, remains elusive. Here, we investigated the effects of LIN28B expression on lung tumorigenesis using LIN28B transgenic overexpression in an autochthonous KRASG12V-driven mouse model. We found that LIN28B overexpression significantly increased the number of CD44+/CD326+ tumor cells, upregulated VEGF-A and miR-21 and promoted tumor angiogenesis and epithelial-to-mesenchymal transition (EMT) accompanied by enhanced AKT phosphorylation and nuclear translocation of c-MYC. Moreover, LIN28B accelerated tumor initiation and enhanced proliferation which led to a shortened overall survival. In addition, we analyzed lung adenocarcinomas of the Cancer Genome Atlas (TCGA) and found LIN28B expression in 24% of KRAS-mutated cases, which underscore the relevance of our model.",
      "Altered DNA methylation occurs ubiquitously in human cancer from the earliest measurable stages. A cogent approach to understanding the mechanism and timing of altered DNA methylation is to analyze it in the context of carcinogenesis by a defined agent. Epstein-Barr virus (EBV) is a human oncogenic herpesvirus associated with lymphoma and nasopharyngeal carcinoma, but also used commonly in the laboratory to immortalize human B-cells in culture. Here we have performed whole-genome bisulfite sequencing of normal B-cells, activated B-cells, and EBV-immortalized B-cells from the same three individuals, in order to identify the impact of transformation on the methylome. Surprisingly, large-scale hypomethylated blocks comprising two-thirds of the genome were induced by EBV immortalization but not by B-cell activation per se. These regions largely corresponded to hypomethylated blocks that we have observed in human cancer, and they were associated with gene-expression hypervariability, similar to human cancer, and consistent with a model of epigenomic change promoting tumor cell heterogeneity. We also describe small-scale changes in DNA methylation near CpG islands. These results suggest that methylation disruption is an early and critical step in malignant transformation.",
      "Emerging evidence suggests that pulmonary iron accumulation is implicated in a spectrum of chronic lung diseases. However, the mechanism(s) involved in pulmonary iron deposition and its role in the in vivo pathogenesis of lung diseases remains unknown. Here we show that a point mutation in the murine ferroportin gene, which causes hereditary hemochromatosis type 4 (Slc40a1C326S), increases iron levels in alveolar macrophages, epithelial cells lining the conducting airways and lung parenchyma, and in vascular smooth muscle cells. Pulmonary iron overload is associated with oxidative stress, restrictive lung disease with decreased total lung capacity and reduced blood oxygen saturation in homozygous Slc40a1C326S/C326S mice compared to wild-type controls. These findings implicate iron in lung pathology, which is so far not considered a classical iron-related disorder."
    ],
    "relevance_map": {
      "0": 1,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "48",
    "num_docs": 10
  },
  {
    "query": "ADAR1 binds to Dicer to cleave pre-miRNA.",
    "docs": [
      "Adenosine deaminases acting on RNA (ADARs) are involved in RNA editing that converts adenosine residues to inosine specifically in double-stranded RNAs. In this study, we investigated the interaction of the RNA editing mechanism with the RNA interference (RNAi) machinery and found that ADAR1 forms a complex with Dicer through direct protein-protein interaction. Most importantly, ADAR1 increases the maximum rate (Vmax) of pre-microRNA (miRNA) cleavage by Dicer and facilitates loading of miRNA onto RNA-induced silencing complexes, identifying a new role of ADAR1 in miRNA processing and RNAi mechanisms. ADAR1 differentiates its functions in RNA editing and RNAi by the formation of either ADAR1/ADAR1 homodimer or Dicer/ADAR1 heterodimer complexes, respectively. As expected, the expression of miRNAs is globally inhibited in ADAR1(-/-) mouse embryos, which, in turn, alters the expression of their target genes and might contribute to their embryonic lethal phenotype.",
      "Spatial boundaries of homeotic gene expression are initiated and maintained by two sets of transcriptional repressors: the gap gene products and the Polycomb group proteins. Previously, the Hunchback (HB) protein has been implicated in setting the anterior expression limit of the UBX homeotic protein in parasegment 6. Here we investigate DNA elements and trans-acting repressors that control spatial expression of the Abdominal-A (ABD-A) homeotic protein. Analysis of a 1.7-kb enhancer element [iab-2(1.7)] from the iab-2 regulatory region shows that in contrast to Ubx enhancer elements, both HB and Krüppel (KR) are required to set the ABD-A anterior boundary in parasegment 7. DNase I footprinting and site-directed mutagenesis show that HB and KR are direct regulators of this iab-2 enhancer. The single KR site can be moved to a new location 100 bp away and still maintain repressive activity, whereas relocation by 300 bp abolishes activity. These results suggest that KR repression occurs through a local quenching mechanism. We also show that the gap repressor Giant (GT) initially establishes a posterior expression limit at PS9, which shifts posteriorly after the blastoderm stage. Finally, we show that this iab-2 enhancer contains multiple binding sites for the Polycomb group protein Pleiohomeotic (PHO). These iab-2 PHO sites are required in vivo for chromosome pairing-dependent repression of a mini-white reporter. However, the PHO sites are not sufficient to maintain repression of a homeotic reporter gene anterior to PS7. Full maintenance at late embryonic stages requires additional sequences adjacent to the iab-2(1.7) enhancer.",
      "We characterize the changes in chromatin structure, DNA methylation and transcription during and after homologous DNA repair (HR). We find that HR modifies the DNA methylation pattern of the repaired segment. HR also alters local histone H3 methylation as well chromatin structure by inducing DNA-chromatin loops connecting the 5' and 3' ends of the repaired gene. During a two-week period after repair, transcription-associated demethylation promoted by Base Excision Repair enzymes further modifies methylation of the repaired DNA. Subsequently, the repaired genes display stable but diverse methylation profiles. These profiles govern the levels of expression in each clone. Our data argue that DNA methylation and chromatin remodelling induced by HR may be a source of permanent variation of gene expression in somatic cells.",
      "Acute fatty liver of pregnancy (AFLP) and the syndrome of hemolysis, elevated liver enzyme levels, and low platelet count (HELLP) are rare but major disorders of the third trimester of pregnancy. Over a 10-year period, 46 women (median age, 30 years; range, 17-41 years) developed hepatic dysfunction severe enough to require transfer to our Liver Failure Unit. Three quarters of the women were nulliparous, and 5 had twin pregnancies; the median gestational age was 35 weeks (range, 24-40 weeks). At admission, 32 patients (70%) were preeclamptic and 21 (46%) were encephalopathic and/or ventilated. Thirty-two patients (70%) had clinical features and laboratory values consistent with AFLP, and 7 (15%) had HELLP syndrome. One patient had preeclamptic liver rupture requiring liver transplantation. In 6 other patients, causes of severe liver dysfunction unrelated to pregnancy were found. Infectious complications occurred in 17 of the patients with AFLP (53%) and in 2 of those with HELLP syndrome (29%). Major intra-abdominal bleeding occurred in 12 women (10 with AFLP), 9 of whom required laparotomies for clot evacuation. Four patients with AFLP (12.5%) had a fatal outcome, with a corresponding perinatal mortality rate of 9%. There were no maternal or perinatal deaths associated with HELLP syndrome. In contrast to results of many previous studies, the results of this large series suggest a relatively favorable maternal and perinatal outcome in severe AFLP and HELLP syndrome. Further improvements in outcome are likely to be achieved through the prevention of the bleeding and infectious complications associated with these disorders.",
      "Oxidative phosphorylation (OXPHOS) is the major pathway for ATP production in humans. Deficiencies in OXPHOS can arise from mutations in either mitochondrial or nuclear genomes and comprise the largest collection of inborn errors of metabolism. At present we lack a complete catalog of human genes and pathways essential for OXPHOS. Here we introduce a genome-wide CRISPR \"death screen\" that actively selects dying cells to reveal human genes required for OXPHOS, inspired by the classic observation that human cells deficient in OXPHOS survive in glucose but die in galactose. We report 191 high-confidence hits essential for OXPHOS, including 72 underlying known OXPHOS diseases. Our screen reveals a functional module consisting of NGRN, WBSCR16, RPUSD3, RPUSD4, TRUB2, and FASTKD2 that regulates the mitochondrial 16S rRNA and intra-mitochondrial translation. Our work yields a rich catalog of genes required for OXPHOS and, more generally, demonstrates the power of death screening for functional genomic analysis.",
      "Successful cancer treatment requires understanding host immune response against tumor cells. PD-1 belongs to the CD28 superfamily of receptors that work as “checkpoints” of immune activation. PD-1 maintains immune self-tolerance to prevent autoimmunity and controls T-cell reaction during infection to prevent excessive tissue damage. Tumor cells that arise from normal tissue acquire mutations that can be targeted by lymphocytes. Accumulating lines of evidence suggest that tumor cells evade host immune attack by expressing physiological PD-1 ligands and stimulating PD-1 on the lymphocytes. Based on this idea, researchers have successfully demonstrated that systemic administration of monoclonal antibodies that inhibit the binding of PD-1 to the ligands reactivated T cells and augmented the anti-cancer immune response. In this review, I summarize the basics of T-cell biology and its regulation by PD-1 and discuss the current understanding and questions about this multifaceted molecule.",
      "BACKGROUND The bidirectional relationships between metabolic syndrome (MetS) and schizophrenia (SCZ) play a crucial role in clinical treatment of both diseases but such bidirectional causal effects have not been comprehensively elucidated. AIMS To investigate the influence of MetS on incident SCZ and the opposite direction as well as their predictors for each direction with a population-based cohort sample. METHOD We enrolled 76,545 subjects who had participated in a community-based health screening program during 1999-2004. After excluding those with the existing MetS or SCZ at baseline, the two normal prospective cohorts corresponding to each independent variable of MetS or SCZ, respectively, were followed over time to ascertain incident outcome of SCZ and MetS. The crude and adjusted hazard ratios for the effect of the predictor on each incident outcome were estimated after controlling for the possible confounding factors. RESULTS The overall incidence rate (per 10(5)person-years) of SCZ was 61.15. The incidence rate in patients with MetS was lower than those without (44.24 versus 64.20), indicating the presence of MetS failed to find an increased risk of developing incident SCZ. However, participants with abnormal waist circumference (WC) were two times (95% CI: 1.37 to 2.93) more likely to yield incident SCZ compared to those with normal WC. In the opposite direction, the incidence of MetS was statistically higher in patients with SCZ than those without SCZ (11.25% vs 7.94%, respectively), suggesting SCZ conferred a higher risk for yielding incident MetS (adjusted hazard ratio=1.89, 95% CI: 1.36, 2.63). CONCLUSIONS After examining the bidirectional causal relationships between SCZ and MetS with the theoretically sound and large population-based prospective cohort study, central obesity, one of the individual components of MetS, was corroborated as an independent predictor for incident SCZ. Patients diagnosed with SCZ were at greater risk of having incident cases of MetS. Such significant temporal bidirectional relationships between SCZ and central obesity suggest a reciprocal interaction exits between SCZ and central obesity.",
      "BACKGROUND The aim of the study was to report the 2-year outcome after a displaced 3-part fracture of the proximal humerus in elderly patients randomized to treatment with a locking plate or nonoperative treatment. PATIENTS AND METHODS We included 60 patients, mean age 74 years (range, 56-92), 81% being women. The main outcome measures were the Constant and Disabilities of the Arm, Shoulder and Hand (DASH) scores and the health-related quality of life (HRQoL) according to the EQ-5D. RESULTS At the final 2-year follow-up, the results for range of motion (ROM), function and HRQoL were all in favor of the locking plate group. The mean flexion in the locking plate group was 120° compared to 111° in the nonoperative group (P = .36) and the mean abduction was 114° compared to 106° (P = .28). The corresponding values for the Constant score were 61 versus 58 (P = .64), for DASH 26 versus 35 (P = .19), and the mean EQ-5D (index) score was 0.70 compared to 0.59 (P = .26). In spite of good primary reduction in 86% of the fractures in the locking plate group, 13% of the patients had a fracture complication requiring a major reoperation and 17% had a minor reoperation. CONCLUSION The results of our study indicate an advantage in functional outcome and HRQoL in favor of the locking plate compared to nonoperative treatment in elderly patients with a displaced 3-part fracture of the proximal humerus, but at the cost of additional surgery in 30% of the patients.",
      "Metformin is a widely used drug for treatment of type 2 diabetes with no defined cellular mechanism of action. Its glucose-lowering effect results from decreased hepatic glucose production and increased glucose utilization. Metformin's beneficial effects on circulating lipids have been linked to reduced fatty liver. AMP-activated protein kinase (AMPK) is a major cellular regulator of lipid and glucose metabolism. Here we report that metformin activates AMPK in hepatocytes; as a result, acetyl-CoA carboxylase (ACC) activity is reduced, fatty acid oxidation is induced, and expression of lipogenic enzymes is suppressed. Activation of AMPK by metformin or an adenosine analogue suppresses expression of SREBP-1, a key lipogenic transcription factor. In metformin-treated rats, hepatic expression of SREBP-1 (and other lipogenic) mRNAs and protein is reduced; activity of the AMPK target, ACC, is also reduced. Using a novel AMPK inhibitor, we find that AMPK activation is required for metformin's inhibitory effect on glucose production by hepatocytes. In isolated rat skeletal muscles, metformin stimulates glucose uptake coincident with AMPK activation. Activation of AMPK provides a unified explanation for the pleiotropic beneficial effects of this drug; these results also suggest that alternative means of modulating AMPK should be useful for the treatment of metabolic disorders.",
      "The Bloom's syndrome (BS) gene, BLM, plays an important role in the maintenance of genomic stability in somatic cells. A candidate for BLM was identified by direct selection of a cDNA derived from a 250 kb segment of the genome to which BLM had been assigned by somatic crossover point mapping. In this novel mapping method, cells were used from persons with BS that had undergone intragenic recombination within BLM. cDNA analysis of the candidate gene identified a 4437 bp cDNA that encodes a 1417 amino acid peptide with homology to the RecQ helicases, a subfamily of DExH box-containing DNA and RNA helicases. The presence of chain-terminating mutations in the candidate gene in persons with BS proved that it was BLM."
    ],
    "relevance_map": {
      "0": 1,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "49",
    "num_docs": 10
  },
  {
    "query": "AIRE is expressed in some skin tumors.",
    "docs": [
      "Expression of the intermediate filament protein keratin 17 (K17) is robustly upregulated in inflammatory skin diseases and in many tumors originating in stratified and pseudostratified epithelia. We report that autoimmune regulator (Aire), a transcriptional regulator, is inducibly expressed in human and mouse tumor keratinocytes in a K17-dependent manner and is required for timely onset of Gli2-induced skin tumorigenesis in mice. The induction of Aire mRNA in keratinocytes depends on a functional interaction between K17 and the heterogeneous nuclear ribonucleoprotein hnRNP K. Further, K17 colocalizes with Aire protein in the nucleus of tumor-prone keratinocytes, and each factor is bound to a specific promoter region featuring an NF-κB consensus sequence in a relevant subset of K17- and Aire-dependent proinflammatory genes. These findings provide radically new insight into keratin intermediate filament and Aire function, along with a molecular basis for the K17-dependent amplification of inflammatory and immune responses in diseased epithelia.",
      "Publisher Summary This chapter summarizes the development and characterization of rabbit polyclonal antibodies named histone that are directed against the methylated H3-K9 position. It provides protocols for peptide design, rabbit immunizations, and quality controls of methyl-lysine histone antibodies, followed by their in vivo characterization using indirect IF of inter-and metaphase chromatin in wild-type (wt) and mutant mouse cells that are deficient for the Suv39h histone methyltransferases (HMTases). Histone amino-termini (tails) protrude from the nucleosome core and are subject to a variety of post-translational modifications, including acetylation (on lysine residues), phosphorylation (on serine and threonine residues), methylation (on lysine and arginine residues), ubiquitination (on lysine residues), and ADP-ribosylation (on glutamic acid residues). In addition to their structural roles, histones play important functions in the control of gene expression by regulating access to the underlying nucleosomal template. It is without doubt that the development of high-quality, position-specific methyl-lysine histone antibodies can provide important tools for the further decoding of the epigenetic information, which is in part, indexed by distinct methylation states of selective lysine residues in the histone amino-termini. A comparative analysis indicates significant discrepancies in the specificity and avidity of the available methyl-lysine histone antibodies and highlights the need for extensive quality controls, such that experimental data can be correctly interpreted despite the exquisite complexity of histone lysine methylation.",
      "AIMS Alcohol is believed to be an important factor behind the sharp rise in mortality during the period 1990-94 in Russia. However, the rise in the standard alcohol consumption proxy does not seem to be sufficient to explain all the increase in mortality. This study adopts a novel approach to exploring the role of the alcohol factor in the increased mortality by investigating whether the mismatch between trends in mortality and recorded alcohol consumption is due to an underestimation of the consumption increase. DESIGN AND MEASUREMENTS First, the alcohol effect on the male accident rate was estimated using data for the period 1959-89. Next, the estimated alcohol effect and the observed accident mortality rate for the period 1990-98 were used to backcast alcohol consumption during that period. Thirdly, the backcasted alcohol series was used to predict trajectories in alcohol poisoning mortality, the homicide rate and all-cause mortality during the period 1990-98. FINDINGS There was a markedly stronger increase in the backcasted consumption proxy than in the standard alcohol consumption proxy during the period 1990-98. There was a substantial gap between the observed mortality rates and the rates predicted from the standard alcohol consumption proxy, whereas the predictions from the backcasted alcohol proxy were much closer to the target. CONCLUSIONS Much of the rise in Russian mortality in 1990-94 appears to have been due to the increase in population drinking, but this increase is grossly underestimated by the commonly used consumption proxy combining alcohol sales, estimation of illicit alcohol production and proportion of alcohol-positive violent deaths.",
      "Store-operated Ca(2+) entry (SOCE) is the principal Ca(2+) entry mechanism in nonexcitable cells. Stromal-interaction molecule 1 (STIM1) is an endoplasmic reticulum Ca(2+) sensor that triggers SOCE activation. However, the role of STIM1 in regulating cancer progression remains controversial and its clinical relevance is unclear. Here we show that STIM1-dependent signaling is important for cervical cancer cell proliferation, migration, and angiogenesis. STIM1 overexpression in tumor tissue is noted in 71% cases of early-stage cervical cancer. In tumor tissues, the level of STIM1 expression is significantly associated with the risk of metastasis and survival. EGF-stimulated cancer cell migration requires STIM1 expression and EGF increases the interaction between STIM1 and Orai1 in juxta-membrane areas, and thus induces Ca(2+) influx. STIM1 involves the activation of Ca(2+)-regulated protease calpain, as well as Ca(2+)-regulated cytoplasmic kinase Pyk2, which regulate the focal-adhesion dynamics of migratory cervical cancer cells. Because of an increase of p21 protein levels and a decrease of Cdc25C protein levels, STIM1-silencing in cervical cancer cells significantly inhibits cell proliferation by arresting the cell cycle at the S and G2/M phases. STIM1 also regulates the production of VEGF in cervical cancer cells. Interference with STIM1 expression or blockade of SOCE activity inhibits tumor angiogenesis and growth in animal models, confirming the crucial role of STIM1-mediated Ca(2+) influx in aggravating tumor development in vivo. These results make STIM1-dependent signaling an attractive target for therapeutic intervention.",
      "Breast cancer evolution and tumor progression are governed by the complex interactions between steroid receptor [estrogen receptor (ER) and progesterone receptor] and growth factor receptor signaling. In recent years, the field of cancer therapy has witnessed the emergence of multiple strategies targeting these specific cancer pathways and key molecules (ER and growth factor receptors) to arrest tumor growth and achieve tumor eradication; treatment success, however, has varied and both de novo (up front) and acquired resistance have proven a challenge. Recent studies of ER biology have revealed new insights into ER action in breast cancer and have highlighted the role of an intimate crosstalk between the ER and HER family signaling pathways as a fundamental contributor to the development of resistance to endocrine therapies against the ER pathway. The aim of this review article is to summarize the current knowledge on mechanisms of resistance of breast cancer cells to endocrine therapies due to the crosstalk between the ER and the HER growth factor receptor signaling pathways and to explore new available therapeutic strategies that could prolong duration of response and circumvent endocrine resistant tumor growth.",
      "Multiple extracellular factors are hypothesized to promote the differentiation of unstimulated and/or stimulated secretory pathways in exocrine secretory cells, but the identity of differentiation factors, particularly those organ-specific, remain largely unknown. Here, we report on the identification of a novel secreted glycoprotein, lacritin, that enhances exocrine secretion in overnight cultures of lacrimal acinar cells which otherwise display loss of secretory function. Lacritin mRNA and protein are highly expressed in human lacrimal gland, moderately in major and minor salivary glands and slightly in thyroid. No lacritin message or protein is detected elsewhere among more than 50 human tissues examined. Lacritin displays partial similarity to the glycosaminoglycan-binding region of brain-specific neuroglycan C (32 % identity over 102 amino acid residues) and to the possibly mucin-like amino globular region of fibulin-2 (30 % identity over 81 amino acid residues), and localizes primarily to secretory granules and secretory fluid. The lacritin gene consists of five exons, displays no alternative splicing and maps to 12q13. Recombinant lacritin augments unstimulated but not stimulated acinar cell secretion, promotes ductal cell proliferation, and stimulates signaling through tyrosine phosphorylation and release of calcium. It binds collagen IV, laminin-1, entactin/nidogen-1, fibronectin and vitronectin, but not collagen I, heparin or EGF. As an autocrine/paracrine enhancer of the lacrimal constitutive secretory pathway, ductal cell mitogen and stimulator of corneal epithelial cells, lacritin may play a key role in the function of the lacrimal gland-corneal axis.",
      "Infectious pathogens can selectively stimulate activation or suppression of T cells to facilitate their survival within humans. In this study we demonstrate that the trematode parasite Schistosoma mansoni has evolved with two distinct mechanisms to suppress T cell activation. During the initial 4- to 12-wk acute stages of a worm infection both CD4(+) and CD8(+) T cells are anergized. In contrast, infection with male and female worms induced T cell anergy at 4 wk, which was replaced after egg laying by T cell suppression via a known NO-dependent mechanism, that was detected for up to 40 wk after infection. Worm-induced anergy was mediated by splenic F4/80(+) macrophages (Mphi) via an IL-4-, IL-13-, IL-10-, TGF-beta-, and NO-independent, but cell contact-dependent, mechanism. F4/80(+) Mphi isolated from worm-infected mice were shown to induce anergy of naive T cells in vitro. Furthermore, naive Mphi exposed to live worms in vitro also induced anergy in naive T cells. Flow cytometry on in vivo and in vitro worm-modulated Mphi revealed that of the family of B7 costimulatory molecules, only programmed death ligand 1 (PD-L1) was selectively up-regulated. The addition of inhibitory mAb against PD-L1, but not PD-L2, to worm-modulated Mphi completely blocked the ability of these cells to anergize T cells. These data highlight a novel mechanism through which S. mansoni worms have usurped the natural function of PD-L1 to reduce T cell activation during early acute stages of infection before the subsequent emergence of egg-induced T cell suppression in the chronic stages of infection.",
      "The possible role of motor development on psychological function is once again a topic of great theoretical and practical importance. The revival of this issue has stemmed from a different approach to the topic, away from Gesell's interest in the long-term prediction of psychological functions from early motoric assessments, toward an attempt to understand how the acquisition of motor skills orchestrates psychological changes. This paper describes how the acquisition of one motor skill, prone locomotion, has been linked to developmental changes in an infant's ability to regulate posture based on information available in patterns of optic flow. It is argued that the onset of prone locomotion presses the infant to differentiate spatially delimited regions of optic flow to effectively and efficiently control the important subtasks nested within the larger task of locomotion, namely, steering, attending to the surface of support, and maintaining postural control. Following this argument, a research program is described that aims to determine if locomotor experience is causally linked to improvements in the ability to functionalize peripheral optic flow for postural control or whether locomotor experience is merely a maturational forecaster of such improvements. Finally, a hypothesis is put forward that links the emergence of wariness of heights to infants' ability to regulate posture on the basis of peripheral optic flow. The paper's overarching theoretical point is the principle of probabilistic epigenesis, which states that one developmental acquisition produces experiences that bring about a host of new developmental changes in the same and different domains.",
      "Taxanes have resulted in improved survival for breast cancer patients, but often cause neurological toxicities. Identification of biomarkers related to toxicities could be important for dictating treatment regimen. We evaluated single nucleotide polymorphisms (SNPs) in the Fanconi Anemia (FA)/BRCA pathway in relation to grade 3/4 neurotoxicities in patients (n = 888) from SWOG0221, a phase III adjuvant trial for breast cancer of 4 dose/schedules of cyclophosphamide (C), doxorubicin (A), and paclitaxel (T). In a separate cohort, we measured the correlation of significant FANCD2 SNPs with corresponding gene expression. For FANCD2, permutation testing revealed that 4 (out of 20) SNPs were significantly associated with an almost two-fold increased risk of toxicity. Two FANCD2 haplotypes were also associated with neurological toxicity, with odds ratios (OR) in the overall population of 1.8 (95% confidence interval (CI) 1.3, 2.5) and 1.7 (95% CI, 1.2, 2.4). Although numbers were small, an African-American-specific haplotype was associated with an almost 3-fold increase in risk of neurologic toxicity (OR = 2.84, 95% CI = 1.2, 6.9). Expression analyses revealed that significant FANCD2 SNPs were associated with FANCD2 expression levels (P = 0.03). There were no associations between SNPs in BRCA1 and neurotoxicities. In this trial of CA+T for breast cancer, SNPs in FANCD2, but not in BRCA1, were associated with a 70–80% increase in the odds of grade 3/4 neurological toxicities and increased expression of the gene. If replicated, women with these genotypes should be closely monitored for toxicities and could be targeted for preventive measures or alternative therapeutic approaches.",
      "Human transglutaminase 2 (TG2), a member of a large family of enzymes that catalyze protein crosslinking, plays an important role in the extracellular matrix biology of many tissues and is implicated in the gluten-induced pathogenesis of celiac sprue. Although vertebrate transglutaminases have been studied extensively, thus far all structurally characterized members of this family have been crystallized in conformations with inaccessible active sites. We have trapped human TG2 in complex with an inhibitor that mimics inflammatory gluten peptide substrates and have solved, at 2-A resolution, its x-ray crystal structure. The inhibitor stabilizes TG2 in an extended conformation that is dramatically different from earlier transglutaminase structures. The active site is exposed, revealing that catalysis takes place in a tunnel, bridged by two tryptophan residues that separate acyl-donor from acyl-acceptor and stabilize the tetrahedral reaction intermediates. Site-directed mutagenesis was used to investigate the acyl-acceptor side of the tunnel, yielding mutants with a marked increase in preference for hydrolysis over transamidation. By providing the ability to visualize this activated conformer, our results create a foundation for understanding the catalytic as well as the non-catalytic roles of TG2 in biology, and for dissecting the process by which the autoantibody response to TG2 is induced in celiac sprue patients."
    ],
    "relevance_map": {
      "0": 1,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "50",
    "num_docs": 10
  },
  {
    "query": "ALDH1 expression is associated with better breast cancer outcomes.",
    "docs": [
      "Application of stem cell biology to breast cancer research has been limited by the lack of simple methods for identification and isolation of normal and malignant stem cells. Utilizing in vitro and in vivo experimental systems, we show that normal and cancer human mammary epithelial cells with increased aldehyde dehydrogenase activity (ALDH) have stem/progenitor properties. These cells contain the subpopulation of normal breast epithelium with the broadest lineage differentiation potential and greatest growth capacity in a xenotransplant model. In breast carcinomas, high ALDH activity identifies the tumorigenic cell fraction, capable of self-renewal and of generating tumors that recapitulate the heterogeneity of the parental tumor. In a series of 577 breast carcinomas, expression of ALDH1 detected by immunostaining correlated with poor prognosis. These findings offer an important new tool for the study of normal and malignant breast stem cells and facilitate the clinical application of stem cell concepts.",
      "The family of an elderly man with Barrett's esophagus was examined for gastroesophageal reflux and development of Barrett's esophagus. All five living children have gastroesophageal reflux or esophagitis, or both, and three have unequivocal Barrett's esophagus. Two third-generation descendents have gastroesophageal reflux. This pattern suggests autosomal dominant transmission of the gastroesophageal reflux trait. The family also has a high prevalence of cancer, which may represent the cancer family syndrome.",
      "The enzyme debrisoquine 4-hydroxylase (CYP2D6), which metabolizes many widely used drugs, is highly polymorphic. The activity of the enzyme ranges between subjects from ultrafast to a complete absence. Therefore, metabolic capacity varies, producing intersubject differences in therapeutic efficacy and side effects at standard recommended doses. Up to 7% of Caucasians may demonstrate ultrarapid drug metabolism (UM) because of inherited alleles with multiplicate functional CYP2D6 genes, causing an increased amount of enzyme to be expressed. Identification of UM subjects is of potential clinical importance for adjustment of doses in drug therapy, as well as to avoid misidentification of noncompliance. In our study, we tested recently designed PCR assays for the detection of the UM genotype. We found a 3.5% prevalence of UMs carrying duplicate active CYP2D6 genes in a population consisting of 202 psychiatric patients.",
      "Healthy cells utilize intricate systems to monitor their environment and mount robust responses in the event of cellular stress. Whether stress arises from external insults or defects due to mutation and disease, cells must be able to respond precisely to mount the appropriate defenses. Multi-faceted stress responses are generally coupled with arrest of growth and cell-cycle progression, which both limits the transmission of damaged materials and serves to reallocate limited cellular resources toward defense. Therefore, stress defense versus rapid growth represent competing interests in the cell. How eukaryotic cells set the balance between defense versus proliferation, and in particular knowledge of the regulatory networks that control this decision, are poorly understood. In this perspective, we expand upon our recent work inferring the stress-activated signaling network in budding yeast, which captures pathways controlling stress defense and regulators of growth and cell-cycle progression. We highlight similarities between the yeast and mammalian stress responses and explore how stress-activated signaling networks in yeast can inform on signaling defects in human cancers.",
      "Sirt1 is a NAD(+)-dependent class III deacetylase that functions as a cellular energy sensor. In addition to its well-characterized effects in peripheral tissues, emerging evidence suggests that neuronal Sirt1 activity plays a role in the central regulation of energy balance and glucose metabolism. To assess this idea, we generated Sirt1 neuron-specific knockout (SINKO) mice. On both standard chow and HFD, SINKO mice were more insulin sensitive than Sirt1(f/f) mice. Thus, SINKO mice had lower fasting insulin levels, improved glucose tolerance and insulin tolerance, and enhanced systemic insulin sensitivity during hyperinsulinemic euglycemic clamp studies. Hypothalamic insulin sensitivity of SINKO mice was also increased over controls, as assessed by hypothalamic activation of PI3K, phosphorylation of Akt and FoxO1 following systemic insulin injection. Intracerebroventricular injection of insulin led to a greater systemic effect to improve glucose tolerance and insulin sensitivity in SINKO mice compared with controls. In line with the in vivo results, insulin-induced AKT and FoxO1 phosphorylation were potentiated by inhibition of Sirt1 in a cultured hypothalamic cell line. Mechanistically, this effect was traced to a reduced effect of Sirt1 to directly deacetylate and repress IRS-1 function. The enhanced central insulin signaling in SINKO mice was accompanied by increased insulin receptor signal transduction in liver, muscle, and adipose tissue. In summary, we conclude that neuronal Sirt1 negatively regulates hypothalamic insulin signaling, leading to systemic insulin resistance. Interventions that reduce neuronal Sirt1 activity have the potential to improve systemic insulin action and limit weight gain on an obesigenic diet.",
      "Diverse epidemiological factors are associated with hepatocellular carcinoma (HCC) prevalence in different populations. However, the global landscape of the genetic changes in HCC genomes underpinning different epidemiological and ancestral backgrounds still remains uncharted. Here a collection of data from 503 liver cancer genomes from different populations uncovered 30 candidate driver genes and 11 core pathway modules. Furthermore, a collaboration of two large-scale cancer genome projects comparatively analyzed the trans-ancestry substitution signatures in 608 liver cancer cases and identified unique mutational signatures that predominantly contribute to Asian cases. This work elucidates previously unexplored ancestry-associated mutational processes in HCC development. A combination of hotspot TERT promoter mutation, TERT focal amplification and viral genome integration occurs in more than 68% of cases, implicating TERT as a central and ancestry-independent node of hepatocarcinogenesis. Newly identified alterations in genes encoding metabolic enzymes, chromatin remodelers and a high proportion of mTOR pathway activations offer potential therapeutic and diagnostic opportunities.",
      "Proteostasis is critical for maintaining cell function and proteome stability may play an important role in human embryonic stem cell (hESC) immortality. Notably, hESC populations exhibit a high assembly of active proteasomes, a key node of the proteostasis network. FOXO4, an insulin/IGF-1 responsive transcription factor, regulates proteasome activity in hESCs. We find that loss of FOXO4 reduces the potential of hESCs to differentiate into neural lineages. Therefore, FOXO4 crosses evolutionary boundaries and links hESC function to invertebrate longevity modulation.",
      "Mechanical forces play important roles during tissue organization in developing animals. Many tissues are organized into adjacent, nonmixing groups of cells termed compartments. Boundaries between compartments display a straight morphology and are associated with signaling centers that are important for tissue growth and patterning. Local increases in mechanical tension at cell junctions along compartment boundaries have recently been shown to prevent cell mixing and to maintain straight boundaries. The cellular mechanisms by which local increases in mechanical tension prevent cell mixing at compartment boundaries, however, remain poorly understood. Here, we have used live imaging and quantitative image analysis to determine cellular dynamics at and near the anteroposterior compartment boundaries of the Drosophila pupal abdominal epidermis. We show that cell mixing within compartments involves multiple cell intercalations. Frequency and orientation of cell intercalations are unchanged along the compartment boundaries; rather, an asymmetry in the shrinkage of junctions during intercalation is biased, resulting in cell rearrangements that suppress cell mixing. Simulations of tissue growth show that local increases in mechanical tension can account for this bias in junctional shrinkage. We conclude that local increases in mechanical tension maintain cell populations separate by influencing junctional rearrangements during cell intercalation.",
      "Schizophrenia may arise from subtle abnormalities in brain development due to alterations in the functions of candidate susceptibility genes such as Disrupted-in-schizophrenia 1 (DISC1) and Neuregulin 1 (NRG1). To provide novel insights into the functions of DISC1 in brain development, we mapped the expression of zebrafish disc1 and set out to characterize its role in early embryonic development using morpholino antisense methods. These studies revealed a critical requirement for disc1 in oligodendrocyte development by promoting specification of olig2-positive cells in the hindbrain and other brain regions. Since NRG1 has well-documented roles in myelination, we also analyzed the roles of nrg1 and ErbB signalling in zebrafish brain development and we observed strikingly similar defects to those seen in disc1 morphant embryos. In addition to their effects on oligodendrocyte development, knock-down of disc1 or nrg1 caused near total loss of olig2-positive cerebellar neurones, but caused no apparent loss of spinal motor neurones. These findings suggest that disc1 and nrg1 function in common or related pathways controlling development of oligodendrocytes and neurones from olig2-expressing precursor cells. Like DISC1 and NRG1, OLIG2 and ERBB4 are promising candidate susceptibility genes for schizophrenia. Hence our findings in the zebrafish embryo suggest that hitherto unappreciated neurodevelopmental connections may exist between key human schizophrenia susceptibility genes. These connections could be investigated in Disc1 and Nrg1 mouse models and in genetically defined groups of patients in order to determine whether they are relevant to the pathobiology of schizophrenia. GenBank accession number for Danio rerio disc1: EU273350.",
      "In the mouse, ZFP57 contains three classical Cys2His2 zinc finger domains (ZF) and recognizes the methylated TGC(met)CGC target sequence using the first and the second ZFs. In this study, we demonstrate that the human ZFP57 (hZFP57) containing six Cys2His2 ZFs, binds the same methylated sequence through the third and the fourth ZFs, and identify the aminoacids critical for DNA interaction. In addition, we present evidences indicating that hZFP57 mutations and hypomethylation of the TNDM1 ICR both associated with Transient Neonatal Diabetes Mellitus type 1 result in loss of hZFP57 binding to the TNDM1 locus, likely causing PLAGL1 activation."
    ],
    "relevance_map": {
      "0": 1,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "51",
    "num_docs": 10
  }
]