[
  {
    "query": "task definition",
    "docs": [
      "Airports are answering that desire by investing heavily in technology that improves passengers' experience. The majority, or 68 percent, of airport surveyed in SITA's 2013 Airport IT Trends Survey consider passenger experience as the most important driver of IT investment.",
      "b. an object that IS MOVING will keep moving with constant _____, which means at the same _____ and in the same _____, UNLESS c. an _____ force acts on that object. 3. What is inertia? 4. What property of an object determines how much inertia it has? 5. Which of the following has more inertia? a. Bowling ball or Tennis ball b. Hammer or Feather II. NEWTONâ\u0080\u0099S SECOND LAW OF MOTION 6.",
      "The ovaries are part of the female reproductive system. Theyâ\u0080\u0099re located in the lower abdomen on both sides of the uterus. Women have two ovaries that produce eggs, as well as the hormones estrogen and progesterone. Sometimes, a fluid-filled sac called a cyst will develop on one of the ovaries. Many women will develop at least one cyst during their lifetime. In most cases, cysts are painless and cause no symptoms.",
      "Definition of task: The smallest identifiable and essential piece of a job that serves as a unit of work, and as a means of differentiating between the various components of a project. Dictionary Term of Day Articles Subjects Sign Up",
      "Border Options. Wrap your canvas with the perfect border to create the exact look you desire. Choose from color pull, solid colors & more. Beautify Your Photo. Add a filter, change backgrounds, add text, remove blemishes, brighten colors, and more to perfect your photo.",
      "The theory behind how and why we come to worship celebrities (and why some of us are more affected than others) is a pop culture question almost as old as pop culture itself.n another study with more than 600 people, psychologists found that about a third qualified for a condition they coined celebrity worship syndrome -- a condition wherein, at its most severe, the object of our worship becomes the central figure in our lives.",
      "Independent senior living communities, also known as retirement communities, senior living communities or independent retirement communities, are housing designed for seniors 55 and older.",
      "Covers an area of 3,593,390 sq. m, Sharjah Airport is situated around 13 km east south east of Sharjah. The airport is home base of the low-cost Air Arabia and the 2nd biggest Middle East air-freight center in cargo.The airport handles about 1800 aircraft and around 100,000 passengers monthly. Sharjah Airport distinguishes for its prominent architecture, lavish landscaping and natural geographical advantages.overs an area of 3,593,390 sq. m, Sharjah Airport is situated around 13 km east south east of Sharjah. The airport is home base of the low-cost Air Arabia and the 2nd biggest Middle East air-freight center in cargo.",
      "For a start, I'm just going to drop a grid control on a form and try to hook it up to data. Since this is WPF, there are of course numerous options for this. For my first test, I have a simple static collection of data in my application, which consists of objects with data about countries.",
      "What made you want to look up statistics? Please tell us where you read or heard it (including the quote, if possible)."
    ],
    "relevance_map": {
      "0": 0,
      "1": 0,
      "2": 0,
      "3": 1,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "query_0",
    "num_docs": 10
  },
  {
    "query": "when did the first audi rs4 come out 1994 model",
    "docs": [
      "There are 116 calories in 1 Churro. Calorie Breakdown: 57% fat, 41% carbs, 2% prot.",
      "Symptoms. 1  increased urinary frequency (polyuria), thirst (polydipsia), hunger (polyphagia), and unexplained weight loss. 2  numbness in extremities, pain in feet (disesthesias), fatigue, and blurred vision. 3  recurrent or severe infections.  loss of consciousness or severe nausea/vomiting (ketoacidosis) or coma.",
      "Six years. For most individuals, corporations, partnerships and trusts, the Income Tax Act (ITA) states that records (including cheques, vouchers, receipts, accounting records, etc.) must be retained for six years from the end of the last taxation year to which the records and books of account relate.",
      "Columbine Valley, Colorado. The Town of Columbine Valley is a Statutory Town located in western Arapahoe County, Colorado, United States. The town population was 1256 at the 2010 United States Census. Columbine Valley is a part of the Denver-Aurora-Lakewood, CO Metropolitan Statistical Area.",
      "First, Elkhorn Slough is located just north of Monterey, California. Elkhorn Slough is known as a popular birding destination with more than 135 species of birds including six that are listed as threatened or endangered. Second, there is the South Slough NERR located in southwestern Oregon.",
      "Bathroom Shower Ideas You Can Use The International Photo Co./Stone/Getty Images To help generate bathroom shower ideas, one thing to do is decide which type of shower you want. Basically, showers are divided between tiled and prefabricated units. Tile Only. Created from scratch by tile installers.",
      "CRAIGâ\u0080\u0099S INTERPRETATION: Sigmund Freud once said that his favorite dream was being naked in a crowd of strangers! Dreams about being naked in a public place and are one of the most commonly reported dreams. They can have a number of meanings and will often occur during adolescence and when a person is reaching puberty.",
      "1 The first Audi RS model was released in 1994, with the launch of the RS2 Avant. 2  The Audi RS brand can trace its roots back to 1983 and the beginning of Audi's Quattro tuning arm.3  The RS sub-brand continues to thrive for Audi, and rightly so. Following the launch of the S6 in 1996, Audi followed it with the RS4 Avant in 2000. 2  Cosworth was heavily involved in the production of the RS4 Avant, tuning the 2.7-litre V6 to give 375bhp. 3  In 2002 Audi introduced the RS6, which came in both saloon and Avant body styles.",
      "In 1980 President Jimmy Carter was opposed for the Democratic nomination by Senator Edward Kennedy of Massachusetts in ten primaries. But Carter easily won the nomination at the Democratic convention. The party also renominated Walter Mondale for vice president.",
      "Labels: Address, complaints, Contact, Corporate, customer service, Detroit, Headquarters, Little Caesars, Michigan, Office, Offices, phone number, pizza, restaurant, Review, Reviews."
    ],
    "relevance_map": {
      "0": 0,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 1,
      "8": 0,
      "9": 0
    },
    "query_id": "query_1",
    "num_docs": 10
  },
  {
    "query": "define preventive",
    "docs": [
      "Goldie Hawn shared 20th Century Fox's photo. The only bad part about filming with Amy Schumer and Goldie Hawn at the Four Seasons Resort Oâ\u0080\u0098ahu at Ko Olina is that it has to wrap. Goldie Hawn shared The Hawn Foundation's post. MindUPâ\u0084¢ Monday Tip: On the most practical level, students who are able to accept that other classmates may behave or think differently than they do are much bet...ter equipped to tolerate and find ways to get along with peers.",
      "Fibromyalgia is not a form of arthritis (joint disease). It does not cause inflammation or damage to joints, muscles or other tissues. However, because fibromyalgia can cause chronic pain and fatigue similar to arthritis, some people may advise you to see a rheumatologist.",
      "China Anne McClain (born August 25, 1998) is an American actress and singer. She is a current member of the sister girl group McClain. Born in Atlanta, Georgia, China's career began in 2005 when she was seven years old acting in the movie The Gospel (2005). She also played China James in Tyler Perry's Daddy's Little Girls (2007), along with Idris Elba and her two sisters.",
      "The airport property , envelopes 970 acres of land and features three, transparent category runways. JLN makes commercial airline service available from a terminal which is different from the one used to provide general aviation service.The Federal Aviation Administration considers it as a Primary airport.",
      "Lavender Essential Oil Uses: 1  Treat yourself to this well-loved aroma by adding a few drops of oil to lotions, shampoos, and skin care products.  Create a spa-like retreat by combining 1 cup Epsom salt and 4 drops oil and adding to a hot bath.",
      "Radiology technician salary in Australia. An average annual salary for a radiology technician in Australia is about AU$40,000. According to payscale Australia, a radiology technician receives an average yearly salary ranging from between AU$35,317 â\u0080\u0093 AU$90,042 per hour.adiology technician salary in Australia. An average annual salary for a radiology technician in Australia is about AU$40,000. According to payscale Australia, a radiology technician receives an average yearly salary ranging from between AU$35,317 â\u0080\u0093 AU$90,042 per hour.",
      "North Carolina also has a different system for regulating the sale of. liquor. All 50 states regulate the sale and distribution of alcoholic. beverages by either directly controlling the distribution and sale of liquor. or licensing suppliers, wholesalers, and retail businesses that distribute and. sell liquor.",
      "Three Parts: Getting Necessary Experience Applying for a Physician Assistant Program Finishing the Process to Become a Physician Assistant. Physician assistants (PA) are certified medical professionals who work closely with doctors.",
      "Adjective[edit] preventive â\u0080\u008e(comparative more preventive, superlative most preventive) 1  Preventing, hindering, or acting as an obstacle to.  Carried out to deter military aggression.",
      "1 The medial collateral ligament: The medial collateral ligament, or MCL, resists forces from the outer side of your knee. It prevents gapping on the inside aspect of your knee joint. 2  The medial meniscus: The medial meniscus is a cartilage structure in your knee joint."
    ],
    "relevance_map": {
      "0": 0,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 1,
      "9": 0
    },
    "query_id": "query_2",
    "num_docs": 10
  },
  {
    "query": "is there a pre fab bathroom that could be attached to a mobile home",
    "docs": [
      "Reasons for wood deck cleaning. 1  Contaminants need to be removed before applying deck stain. Contaminants include dead wood, old or failing sealer, mold, mildew and dirt. 2  Mold and mildew grow spores in the wood fibers and do not allow the wood on your deck to dry, increasing the chance of rot.",
      "in ancient rome the domus was the type of house occupied by the upper classes and some wealthy freedmen during the republican and imperial eras it comes from the ancient greek word domi meaning structure since it was the standard type of housing in ancient greece it could be found in almost all the major cities throughout the roman territories the modern english word domestic comes from latin domesticus which is derived from the word domus",
      "Randy Lewis. The final portion of the inaugural Desert Trip festival in Indio â\u0080\u0094 and in some respects the eventâ\u0080\u0099s piece de resistance â\u0080\u0094 began not with the opening notes of Roger Watersâ\u0080\u0099 concluding set, but the moment after the Who left the stage following their own explosive performance.",
      "According to the American Academy of Ophthalmology Preferred Practice Patterns, primary open angle glaucoma (POAG) is defined as an optic neuropathy with associated visual field loss for which elevated intraocular pressure (IOP) is a major risk factor.",
      "Median vs. Mean. Median is often confused with another statistic called the mean, or average. The mean of a data set is equal to the sum of all the data values divided by the total number of values in the data set.Consider a data set consisting of the following numbers: 1, 8, 9, 10 and 12.hen a data set has an even number of values, the average of the two values in the middle is usually used as the median. Median salary is simply the median of a set of salary data.",
      "The measure of heat capacity, or the quantity of heat needed to raise. the temperature of one gram of a substance by one degree Celsius, is termed. specific heat and is represented by the symbol s, Cp, c. The SI units for specific. heat are given in J/gC. Specific heat values are also commonly given in cal/gC,",
      "1 TIMING: Implantation bleeding happens about 6-12 days after ovulation while a menstrual period happens 14 days after ovulation. 2  CHARACTER: Implantation bleeding is just a couple of drops while a menstrual period is much more. 3  COLOR: A menstrual period is usually bright red while implantation bleeding is more brownish.",
      "Believe it or not, the standard mobile home bathroom with an oval tub is bigger than the average site-built home oval tub! Mobile Home Supply Store has two oval tubs, 64â\u0080³ x 42â\u0080³ and 64â\u0080³ x 44â\u0080³. Per About, the average size for a oval tub in a site-built home is 60â\u0080³ x 41â\u0080³. Score one for factory-built homes!",
      "Differential centrifugation. Fractionation is a separation process in which a certain quantity of a mixture (gas, solid, liquid, suspension or isotope) is divided during a phase transition, into a number of smaller quantities (fractions) in which the composition varies according to a gradient.ifferential centrifugation. Fractionation is a separation process in which a certain quantity of a mixture (gas, solid, liquid, suspension or isotope) is divided during a phase transition, into a number of smaller quantities (fractions) in which the composition varies according to a gradient.",
      "In power transformers, the voltage difference between parts of the primary and secondary windings can be quite large. Layers of insulation are inserted between layers of windings to prevent arcing, and the transformer is immersed in transformer oil that provides further insulation and acts as a cooling medium."
    ],
    "relevance_map": {
      "0": 0,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 1,
      "8": 0,
      "9": 0
    },
    "query_id": "query_3",
    "num_docs": 10
  },
  {
    "query": "what is the training wage",
    "docs": [
      "A tubal ligation is assigned the CPT procedure code of 00851. The use of individual codes for each medical/surgical procedure allows for accurate billing through the insurance company by the physician or hospital.",
      "Fish Mox Forte (Amoxicillin) exerts a bactericidal action on gram-positive and some gram-negative bacteria. Amoxicillin is a broad spectrum bacterial antibiotic. It is effective against a number of pathogentic bacteria associated with marine and freshwater ornamental fish diseases.0 Count Fish Mox 100 Count Fish Mox 30 Count Fish Mox Forte 100 Count Fish Mox Forte 100 Count Fish Mox - 2 Pack. 100 Count Fish Mox - 3 Pack.",
      "Most financial analysts work in large financial centers such as New York City, where many are employed in: 1  securities firms and brokerages. 2  investment banks. 3  pension funds.  mutual funds.",
      "Ginny took a deep breath and shrieked as she walked away, defeated. Bloody Hermione and her stupid punishment, she thought nastily. It had been three days and seventeen hours of peace between Ginny and all the morons who craved to piss her off.",
      "Parkinson's disease is a slowly progressive disorder that affects movement, muscle control, and balance. Part of the disease process develops as cells are destroyed in certain parts of the brain stem, particularly the crescent-shaped cell mass known as the substantia nigra.arkinsonâ\u0080\u0099s disease is part of a group of conditions called motor system disorders, which are associated with the loss of dopamine-producing brain cells. These dopamine-associated motor disorders are referred to as parkinsonism.",
      "State and Local General Sales Taxes. If you elect to deduct state and local general sales taxes, you must check box b on line 5. To figure your deduction, you can use either your actual expenses or the optional sales tax tables.You cannot deduct new motor vehicle taxes on line 7 of Schedule A if you make this election.hat deduction is for state or local sales tax. That would eliminate any of the taxes on gasoline imposed by the federal goverment. There may be many taxes on gasoline imposed by states and one of them may be a state sales tax.",
      "The Roman Empire obtained most of its copper from the island of Cyprus, which is where copper's name originated. Today, copper is primarily obtained from the ores cuprite (CuO 2), tenorite (CuO), malachite (CuO 3 Â·Cu(OH) 2), chalcocite (Cu 2 S), covellite (CuS) and bornite (Cu 6 FeS 4). Large deposits of copper ore are located in the United States, Chile, Zambia, Zaire, Peru and Canada.",
      "Both chemicals are a result of the chloramineâ\u0080\u0099s combination of ammonia and chlorine, a potentially deadly cocktail. Amazingly, itâ\u0080\u0099s not even clear that chloramineâ\u0080\u0099s benefits are worth these risks. Chloramine is 200 times less effective than chlorine in killing e-coli bacteria, rotaviruses, and polio.",
      "Download â\u0080\u009cImagineâ\u0080\u009d Single by John Lennon on iTunes / Amazon Itâ\u0080\u0099s such a simple song, yet it has a powerful and deep meaning underneath those simple lyric lines. It is so worth to take a closer look at the lyrics of the song.",
      "Training minimum wage The training minimum wage: applies to employees aged 20 years or over whose employment agreement states that they have to do at least 60 credits a year of an industry training programme to become qualified in the area they are working in."
    ],
    "relevance_map": {
      "0": 0,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 0,
      "9": 1
    },
    "query_id": "query_4",
    "num_docs": 10
  },
  {
    "query": "define foreshadows",
    "docs": [
      "General Disney Golf Information. Walt Disney World has three outstanding championship golf courses (These courses were part of the PGA Tour for 42 years from 1971 -2012) and a par-36 walking course.",
      "Definition of Foreshadowing. Foreshadowing is a literary device in which a writer gives an advance hint of what is to come later in the story. Foreshadowing often appears at the beginning of a story, or a chapter, and helps the reader develop expectations about the coming events in a story. There are various ways to create foreshadowing.",
      "Sep 03, 2009, 11:42 AM. I'm in the early stages of planning a road trip from Anchorage to Haines in July, 2010. I'm not a good cruiser and I thought this would be an opportunity to see some fantastic scenery and get a taste of southeastern Alaska.",
      "The Invitation Says: Black Tie. This is the next most formal wedding dress code, and usually means the wedding is an evening event. For the ladies: You can go a bit dressier and wear a formal floor-length gown, or choose a short, dressy cocktail dress.",
      "This means that if you opt to treat a heartworm positive dog with an ivermectin-based heartworm. preventive only, you can expect the dog to remain heartworm positive for as long as two to three years. and the heartworm disease will be progressing during those two years. This is not good for the dog but.",
      "The application for extension of unemployment benefits is available on the New Jersey Department of Labor and Workforce Development website at lwd.dol.state.nj.us.",
      "What did the northwest ordinance of 1787 state? The Northwest Ordinance created the first organized territory of  the United States. It was passed July 13, 1787 and created a  territory from the lands south of the Great L â\u0080¦ akes, north of the  Ohio River, and east of the Mississippi River.Answered.t provided for the surveying of the Northwest Territory, north and west of the Ohio River as far as the Great Lakes and the Misissippi River.",
      "Here are the tips which you have to follow beyond the home remedies to get effective result of curing the kidney pain problem. 1  Magnesium salts pack also help to cure the kidney pain. 2  For this, you have to wet a cloth with concentrated warm Epsom salt solution and then place this cloth over the kidneys.",
      "Clindamycin is used to treat a wide variety of bacterial infections. It is an antibiotic that works by stopping the growth of bacteria.This antibiotic treats only bacterial infections. It will not work for virus infections (e.g., common cold, flu).ow to use clindamycin HCl. Take this medication by mouth with or without food, usually 4 times a day (every 6 hours), or as directed by your doctor. Take it with a full glass of water (8 ounces or 240 milliliters) unless your doctor directs you otherwise.",
      "To measure volume, we use fluid ounces, and there are exactly eight fluid ounces of anâ\u0080¦ything in a cup.   However, since sour cream is sold by weight, this question wants to know how much one cup of sour cream weighs.   1 cup of sour cream weighs 242 grams which is about 8.5 ounces. Emily Foltz."
    ],
    "relevance_map": {
      "0": 0,
      "1": 1,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "query_5",
    "num_docs": 10
  },
  {
    "query": "who plays sebastian michaelis",
    "docs": [
      "Both of her maternal grandparents passed away before she was born. But Beyonce still holds them close to heart. The 32-year-old uploaded a picture each of Lumis Albert Beyince and Agnez Dereon to her Tumblr account, simply captioning the picture 'My grandfather' and 'My grandmother' followed by a heart icon.",
      "A graph of plotted points that show the relationship between two sets of data. In this example, each dot represents one person's weight versus their height.",
      "Main articles: Black Butler (film) and Black Butler: Book of the Atlantic. It was announced in January 18, 2013 that the manga would be made into a live-action film starring Ayame Goriki as Genpou Shiori, Hiro Mizushima as Sebastian Michaelis. Filming began in April 2013 and the film was released on January 18, 2014.",
      "My overall impression of the staff & service at Vision Express is very very high (& I'am not easily pleased) & would recommend them 100%.s I have really bad eyesight I have to have the lenses thinned, and also varifocals. He explained all about the cost and spent nearly 1 hour so that I got the right glasses. I think Vision Express are very good and would not go anywhere else for my glasses. Find useful.",
      "Conversely, if you go too long between shampoos, skin cells can build up on the scalp and cause itching and flaking due to accumulation of fungus, bacteria, yeast or infection. To avoid either of these conditions regularly shampoo with effective Follicleanse scalp cleanser and use warm or even cool, water.",
      "One strong implication of the justice of warfare being a separate topic of analysis to the justice of war is that the theory thus permits the judging of acts within war to be dissociated from it cause.",
      "Before theyâ\u0080\u0099re 15 months old, babies donâ\u0080\u0099t seem to recognize themselves in the mirror. These babies stared at their reflections and may have found them familiar, but they didnâ\u0080\u0099t react any differently when they saw the red spots on their noses. But by 21 months, most infants tried to touch or wipe their nose.",
      "Price: $1,200 per square meter (Business real estate). Although London and Paris were the previous contenders for this position, today three of the most expensive cities in the world are all found in Japan.",
      "However, we are not using our resources to the fullest degree. There are currently many areas in which Nike is not paying attention. We have not catered to a large portion of the new generation that demand the latest trends and styles. Also, Nike must take into account the changing demographics in this country.",
      "DeForest, Wisconsin. DeForest, is a village in Dane County, Wisconsin, United States, along the Yahara River. The population was 8,936 at the 2010 census. It is part of the Madison Metropolitan Statistical Area. Contents."
    ],
    "relevance_map": {
      "0": 0,
      "1": 0,
      "2": 1,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "query_6",
    "num_docs": 10
  },
  {
    "query": "what axis is intellectual disability on",
    "docs": [
      "I bought grapefruit oil from a doterra sales rep previously and ordered it again from amazon because it was ten bucks cheaper. But the original oil I had is clear and smells very much like fresh grapefruit. This one is orange in color and smells differently. Like other reviewers have mentioned, I wouldn't ingest this one. Not sure what it is exactly.",
      "Furnished apartments for expats in Amsterdam. Perfect Housing works with selected partners to provide access to a wide range of long stay apartments in Amsterdam. These expat apartments are carefully screened, most of them furnished and centrally located.",
      "1 5 medium sweet potatoes or 5 medium yams. 2  water, to wash. 3  Wash potatoes but don't dry off. 4  Place potatoes in crock pot and cook on low for 4 to 6 hours.  The cook time depends on how thick and large your potatoes are.",
      "Justin Chatwin Talks Shameless Season Three. In the Shameless Season Two finale, it started to look like things were becoming more stable for Jimmy. He and Fiona confessed their love for each other, and she finally met Jimmyâ\u0080\u0099s family. But when Shameless returns for its third season on Sunday, the drama begins once again for Jimmy.",
      "Album: Uptown Saturday Night. Label: Profile Records. Much of the success of Luchini is derived from the song's beat, which was produced by early Jay-Z collaborator Ski. At the time that he was called to work on Hov's Reasonable Doubt LP, he'd already been hard at work on Camp Lo's debut album, Uptown Saturday Night.",
      "When roasting beef it is important to select the proper cut of roast beef to produce moist and tender meat when the roast beef is cooked to the desired doneness. Using the proper beef cooking times and temperatures is critical to the end results.lace the beef on a rack in a shallow roasting pan with the fat side up. Do not cover the roast and do not add any liquid (liquid is used for braising, not roasting). Allow the beef to roast at 450Â°F for 45 minutes and then begin checking the internal temperature of the meat with a meat thermometer.",
      "Grand Slam Finals - Open Era Player Tounament Total W-L; Novak Djokovic: Australian Open: 5: 5-0: Roger Federer: Australian Open: 5: 4-1: Stefan Edberg: Australian Open: 5: 2-3: Andre Agassi: Australian Open: 4: 4-0: Mats Wilander: Australian Open: 4: 3-1: Ivan Lendl: Australian Open: 4: 2-2: Andy Murray: Australian Open: 4: 0-4: Pete Sampras: Australian Open: 3: 2-1: John Newcombe: Australian Open: 3: 2-1: Guillermo Vilas",
      "For many consumers, debt - from credit card bills and hospital financing to personal credit lines and business loans - offers an apparent escape from day-to-day financial pressures. Not all forms of credit are actively bad, and many folks are able to use debt as a responsible means of augmenting their purchasing power.",
      "The text sections giving extra information on each diagnosis were updated, as were some of the diagnostic codes to maintain consistency with the ICD. The DSM-IV-TR was organized into a five-part axial system. The first axis incorporated clinical disorders. The second axis covered personality disorders and intellectual disabilities. The remaining axes covered medical, psychosocial, environmental, and childhood factors functionally necessary to provide diagnostic criteria for health care assessments.",
      "Drivers who use Intermodal Equipment will now be required to perform a pre-trip inspection. Additionally, they will be required to write a report at the end of each work day on each vehicle used. Every driver must now prepare a report, in writing, at the end of each day on each of the vehicles he or she operated."
    ],
    "relevance_map": {
      "0": 0,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 1,
      "9": 0
    },
    "query_id": "query_7",
    "num_docs": 10
  },
  {
    "query": "what is agave?",
    "docs": [
      "Agave is a large genus of succulent plants that includes over 200 species. The New World native has been used as a source of food, fiber, and ornamentation for hundreds of years, and has spread far beyond its original range, thanks to migrating peoples who brought the plant with them.",
      "Definition of pilaster for English Language Learners. : a rectangular column that is attached to a wall and that is used for decoration or support.",
      "Difference between CD-R and CD ROM. Though they are the same compact discs and seemingly the same appearance, CDR and CD ROM differ with each other in terms of usability. The CDR is the disc that you will use if you have audios, videos, or any other data that you want to store by burning or writing it in to the disc.",
      "The mean is equal to the sum of all the values in the data set divided by the number of values in the data set. So, if we have n values in a data set and they have values x1, x2, ..., xn, the sample mean, usually denoted by (pronounced x bar), is:",
      "Map. The map above shows the different areas that the taiga is found, which is mostly in Norway, north Asia and Canada. 1  The worldâ\u0080\u0099s largest trees grow in forests on the pacific coast. 2  The Canadian taiga is dotted with thousands of beautiful lakes. 3  Scandinavia has taiga forests growing inside the arctic circle.",
      "St. Croix is 84 square miles in size, 22 miles long and the widest point is a little more than 6 miles. The terrain on the east end of the island is rocky and arid with short grassy hillsides and many cactus clusters. The west end of the island is lush with large fruit trees and ferns gracing the mountains.",
      "Just like Mycenae and Tyrins, the Acropolis of Athens had its own underground water supply in the form of a deep well, dug at the north end of the rock, which could be used by the defenders during a siege.",
      "Moisturize Your Skin. Like olive oil, benefits of canola oil for skin are undeniable. Canola oil is not expensive and the fatty acids in the oil are helpful for dry skin and help your skin moisturized. You can combine canola oil with some essential oils as a lotion for your body.",
      "Benefits are payable for injuries that result - directly and independently. of all other causes - from a covered accident, while coverage is in effect, up to the maximum benefits stated. $100,000 per person per accident: With either option, up to $100,000. will be paid for eligible medical expenses.",
      "Naples, FL County Of Collier. About Search Results. About Search Results. YP - The Real Yellow PagesSM - helps you find the right local businesses to meet your specific needs. Search results are sorted by a combination of factors to give you a set of choices in response to your search criteria."
    ],
    "relevance_map": {
      "0": 1,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "query_8",
    "num_docs": 10
  },
  {
    "query": "what to eat during migraine",
    "docs": [
      "For site-finished wood flooring, before installation and before sanding and finishing takes place, allow the flooring to acclimate (settle-in) to the controlled environment, and to stabilize for a period of time. Some flooring professionals suggest 5 to 7 days.",
      "Applying a warm wet cloth to your head and neck (cold water could make the migraine worse) Opening a window or stepping outside to get fresh air. Eating small quantities of bland foods and avoiding foods with strong odors. Without drinking too much at once, staying hydrated by sipping water, tea or clear broth.",
      "Book Chapter. ABSTRACT. Information on esophageal exclusion, diversion and closure in patients with Boerhaave's syndrome from the book Atlas of Gastrointestinal Surgery Volume One, Second edition is presented.ook Chapter. ABSTRACT. Information on esophageal exclusion, diversion and closure in patients with Boerhaave's syndrome from the book Atlas of Gastrointestinal Surgery Volume One, Second edition is presented.",
      "Hindenburg mystery solved 76 years after historic catastrophe: static electricity caused the airship to explode. By Daily Mail Reporter. Published: 19:20 EST, 3 March 2013 | Updated: 04:03 EST, 4 March 2013.",
      "1 Pink To Reddish-Colored Pee: If you've been noshing on red-pigmented foods like beets, rhubarb, or blueberries, then you're probably fine. If not, you may have blood in your urine. 2  Foamy Or Fizzy Pee: If it only happens on occasion, then it's just a cool hydraulic effectâ\u0080\u0094you've got a good flow going.",
      "There are 2 supervisors. A morning shift (me) and a night shift. The other day, the night shift supervisor called in sick. The rest of management had already gone home for the day and my boss called me and told me that he needed me to stay and work the night shift aswell.I told him i already had plans and was unable to stay. He then told me that I HAD to stay. I ended up working 12 hours that day wich isn't really a problem for me..he rest of management had already gone home for the day and my boss called me and told me that he needed me to stay and work the night shift aswell. I told him i already had plans and was unable to stay. He then told me that I HAD to stay. I ended up working 12 hours that day wich isn't really a problem for me..",
      "Ancient Costume and Modern Fashion. Within the past few years art in dress has become an accomplished fact, and historic costume as a serious subject of art research has developed new and fascinating possibilities.",
      "1 : a meat dish baked with biscuit or pastry crust â\u0080\u0094 compare potpie. 2 : a dessert consisting of a filling (as of fruit or custard) in a pastry shell or topped with pastry or both.",
      "Diamond is one form of carbon; the other is graphite. The s stands for solid. Both diamond and graphite are allotropes of carbon. There are other exotic allotropes of carbon (graphenes and fullerenes among them) but they are much less common. A diamond consists of a giant three-dimensional network of carbon atoms. In effect, a diamond is one giant molecule.",
      "Ban for cheating is permanent, the decisions made are not to be reconsidered. Together with the ban of user account the player is to be permanently banned in the game forum. Polish translation of the news can be found here. Thanks to our Emissary @TheWay; Chinese translation of the news can be found here. Thanks to our Emissary @Hazel"
    ],
    "relevance_map": {
      "0": 0,
      "1": 1,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "query_9",
    "num_docs": 10
  }
]