[
  {
    "query": "Do Banks Cause Inflation?  What are other possible causes?",
    "docs": [
      "holy Toledo...I agree  &gt; Stop glamorizing entrepreneurship. Stop thinking that business is all about funding rounds, huge, fancy offices and happy teams, 7-figure sums on the bank accounts, freedom, and fame. Because it is not  too bad you have to read to paragraph 7 to get there / start content",
      "\"In the course of one's spending, it's not tough to find things that are going to be that expensive.  A median income is in the $50K range in the US. The diamond folk advertise that one should spend 3 month's salary on an engagement ring. Even with a decent income, I spent zero. My wife was practical, not interested in jewelry, and wanted a big house. The money went to the downpayment. The house cost 2.5 years salary at that time.  A car, even used, will cost some month's salary.  If that $50K earner is saving, has an emergency account, and is on track with their financial long term goals, a week's pay can buy a nice sized TV.  A nice vacation can cost a week's pay to a month's pay.  Your question is great, although it shows a concern that's typical very early on in one's career. There are related question here about \"\"how can I spend more?\"\" They tend to come from someone living on a student budget that now has an adult's income from a desirable job. The answer is to sit down, list your monthly spending, properly budget a decent portion for savings, and see how much you have for frivolous spending. Keep in mind, it's easier to sock it away now. No house, no kids, etc. When we were first married, we lived on my wife's income (in effect) and socked mine away. The house tightened the budget, as did the kid.  In the end, the PS4 is less about the $400 than it is about the rest of your finances.\"",
      "\"No, it isn't generally believed that inflation is caused by individual banks printing money.  Governments manage money supply through Central Banks (which may, or may not, be independent of the state). There are a number of theories about money supply and inflation (from Monetarist, to Keynesian, and so on). The Quantity Theory of Inflation says that long-term inflation is the result of money-supply but short-term inflation is related to events/local conditions. Short-term inflation is a symptom of economic change.  It's like a cough for a doctor.  It simply indicates an underlying event. When prices go up it encourages new producers to enter the market, create new supply which will then act to lower prices.  In this way inflation is managed by ensuring that information travels throughout the economy.  If prices go up for specific goods, then - all things being equal - supply should go up since the increase implies increasing demand.  If prices go down then this implies demand has gone down and so producers will reduce supply. Obviously this isn't a perfect relationship.  There is \"\"stickiness\"\" which can be caused by a whole bunch of market conditions (from banning of short-selling, to inelasticity of demand/supply). Your question isn't about quantitative easing (which is a state-led way of increasing money-supply and which could increase inflation but is hoped to increase expenditure and investment) so I won't cover that here. The important take-away is that inflation is an essential price signal to investors and business people so that they can assess market cycles.  Without it we would end up with vast over- or under-supply and much greater economic disruption.\"",
      "\"There are several causes of inflation. One is called cost push — that is, if the price of e.g. oil goes up sharply (as it did in the 1970s), it creates inflation by making everything cost more. Another is called demand pull: if labor unions bargain for higher wages (as they did in the 1960s), their wage costs push up prices, especially after they start buying. The kind of inflation that the banks cause is monetary inflation. That is, for every dollar of deposits, they can make $5 or $10 of loans. So even though they don't \"\"print\"\" money (the Fed does) it's as if they did. The result could be the kind of inflation called \"\"too much money chasing too few goods.\"\"\"",
      "Yes, exactly. VaR is just a single tailed confidence interval.  To go from model to strategy, you need to design some kind of indicator (i.e. when to buy and when to short or stay out). In practice, this will look like a large matrix with values ranging from -1 to 1 (corresponding to shorting and holding respectively) for each security and each day (or hour, or minute, or tick, etc.), which you then just multiply with the matrix of the stock returns. The resulting matrix will be your daily returns for each stock, you can then just row sum for daily returns of a portfolio, or calculate a cumulative product for cumulative returns.  A simple example of an indicator would be something like a value of 1 when the price of the stock is below the 30 day moving average, and 0 otherwise. You can use a battery of econometric models to design these indicators, but the rest of the strategy design is essentially the same, and it's *relatively* easy to build a one-size-fits-all back-testing code.  I'll try to edit this post later and link a blog that goes through some of the code.  Edit: [Here](http://www.signalplot.com/simple-machine-learning-model-trade-spy/) is a post that discusses implementing a simple ML strategy. You can ignore most of the content but if you go through the github, you'll see how the ML model is implemented as a strategy.  An even easier example can be found from [the github connected to this post](http://www.signalplot.com/how-to-measure-the-performance-of-a-trading-strategy/), where the author is just using a totally arbitrary signal. As you can see, deriving a signal can be a ton of work, but once you have, actually simulating the strategy can be done in just a few lines of code.  Hopefully the author won't mind me linking his page here, but I find his coding style to be very clean and good for educational purposes.",
      "Funny how the baby boomers were so responsible when they got part time jobs and worked their way through college and had, relatively speaking, very little college debt. But the millennials up and decided to incur thousands of dollars in lifelong college debt for no apparent reason. How irresponsible can they be?",
      "There were a couple key differences between Keurig and Juicero.  * Keurig was going after a piece of a much larger pie. Most homes and offices have a coffee maker. A few homes and almost no offices have a juicer. * Keurig got a big boost from the office market. Much passive aggressive ink has been spilled over office coffee makers. Maintaining  one is a huge chore no one wants to do, and everyone complains that whoever made the last pot of coffee did it wrong. Keurig let everyone have the coffee flavour they like and ended the debate about when to start another pot. I've never heard of an office juicer, so Juicero didn't have that initial market to introduce people to their product.  * Keurig isn't that expensive. Keurig kept their prices low enough that people saw the premium as a reasonable convenience fee. Juicero went straight into luxury status symbol territory with their prices. * Keurig got people hooked, and then started the shady DRM. Juicero started off with the shady DRM.",
      "\"Some people believe that inflation is caused by an increase in the money supply when the banks engage in fractional reserve lending. Is this correct? You are referring to the Austrian school of thought. The Austrians define inflation in terms of money supply. In other words, inflation is defined as an increase in the aggregate money supply, even if prices stay the same of fall. This is not the only definition of inflation. The mainstream defines inflation as a general increase in the prices of consumer goods. Based on the first definition, then your supposition is correct by definition. Based on the second definition, you can make a case that money supply affects prices. But keep in mind, it's just one factor affecting prices. Furthermore, economics is resistant to experimentation, so it is difficult to establish causality. Austrian economists tend to approach the problem of \"\"proof\"\" using a 2-pronged tactic: establish plausibility by explaining the mechanism, then look for historical evidence to back up that explanation. As I understand it, when there is more available money in the market, the price of goods will increase. But will a normal merchant acknowledge the increase of money supply and raise prices immediately? I posit that, in the short run, merchants won't increase prices in response to increased money supply. So, why does increased money supply lead to price inflation? The simple answer, in the Austrian school of thought, is that you have more money chasing the same amount of goods. In other words, printing money doesn't actually increase the number of widgets made. I believe the Austrian school is consistent with your supposition that prices don't increase in the short run. In other words, producers don't increase prices immediately after observing an increase in the money supply. Specifically, after the banks print more notes, where will the money be distributed first?  The Austrian story goes as follows: Imagine that the first borrower is a home constructor, and he is borrowing freshly \"\"printed\"\" money to build new homes. This constructor will need to buy materials and hire labor to build homes, and in doing so he will bid against other home constructors. The increased demand for lumber, nails, tools, carpentry, etc. will ever so slightly increase the market prices for these goods and services. So the money goes first to the borrower, but then flows also to the people selling to the borrower, and the people selling to the sellers, etc. It has a ripple effect. Who will be the first one to have a need to rise their price? These producers won't need to increase their price, but they will choose to do so if the believe that demand outstrips supply. In other words if you have more orders than you can fill, then you may post higher prices because you think consumers will tolerate the higher price.  You might object that competition deters any one producer from unilaterally raising prices, but in fact if all producers are failing to keep up with demand, then you can unilaterally raise prices because other producers don't have any excess inventory to undercut you with.\"",
      "\"In general, when dealing with quantities like net income that are not restricted to being positive, \"\"percentage change\"\" is a problematic measure. Even with small positive values it can be difficult to interpret. For example, compare these two companies: Company A:  Company B:  At a glance, I think most people would come away with the impression that both companies did badly in Y2, but A made a much stronger recovery. The difference between 99.7 and 99.9 looks unimportant compared to the difference between 100,000 and 40,000. But if we translate those to dollars: Company A: Y1 $100m, Y2 $0.1m, Y3 $100.1m Company B: Y1 $100m, Y2 $0.3m, Y3 $120.3m Company B has grown by a net of 20% over two years; Company A by only 1%. If you're lucky enough to know that income will always be positive after Y1 and won't drop too close to zero, then this doesn't matter very much and you can just look at year-on-year growth, leaving Y1 as undefined. If you don't have that guarantee, then you may do better to look for a different and more stable metric,  the other answers are correct: Y1 growth should be left blank. If you don't have that guarantee, then it might be time to look for a more robust measure, e.g. change in net income as a percentage of turnover or of company value.\"",
      "\"This. I see this problem all the time at work (big company). We don't use internal billing, so development is essentially seen as zero cost (already paid for, right?) so the result is... development can provide infinite resources!   We get asked to do way too much, in too little time, for the amount of people we have. Obviously more often than not, nobody is happy with results.  We've been trying to implement internal billing in my department but higher ups don't see it, they just want to continue with a \"\"proper management\"\" philosophy with no tools to quantify it -- which has not been working.\""
    ],
    "relevance_map": {
      "0": 0,
      "1": 0,
      "2": 1,
      "3": 1,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 1,
      "8": 0,
      "9": 0
    },
    "query_id": "query_0",
    "num_docs": 10
  },
  {
    "query": "Help Understanding Market/Limit Orders and Bid/Ask Price",
    "docs": [
      "At any point of time, buyer wants to purchase a stock at lesser price and seller wants to sell the stock at a higher price.  Let's consider this scenario  Company XYZ is trading at 100$, as stated above buyer wants to purchase at lower price and seller at higher price, this information will be available in Market depth, let's consider there are 5 buyers and 5 sellers, below are the details of their orders Buyers List Sellers List Highest order in buyers list will contain the bid price and bid quantity, Lowest order in Sellers list will contain the offer price and offer quantity. Now, if I want to buy 50 Stocks of company XYZ, need to place an order first, it can be either limit or Market. Limit Order : In this order, I will mention the price(buy price) at which I wish to buy, if there is any seller selling the stock less than or equal to price I have mentioned, then the order will be executed else it will be added to buyers list Market Order : In this order, I will not mention the price, if I wish to purchase 50 Stocks, then it will find the lowest offer price and buy stocks, in our case it will be 101. if I wish to purchase 200 Stocks, then it will find the lowest offer price and buy stocks, in our case it will be 2 transactions, since entire request cannot be accommodated in single order Usually the volume(Ask Volume and Offer Volume) being displayed are all Limit orders and not Market orders, Market orders are executed immediately. This is just an example, However several transactions are executed within a second, hence we will get to know the exact value only after the order is completed(executed)",
      "nice work! really enjoyed looking through your website. do you see any possible application of Machine Learning (specifically tensorflow) to this? I was thinking about building a trading bot that uses data from various APIs as a strategy just as an experiment but I'm wondering what your insights are.",
      "\"My feeling is that you're basically agreeing to throw away a bucket of money for a lesson that doesn't have to cost a penny. Like another commenter said, you're putting the cart before the horse.  I once asked a similar question to a seasoned investor, though I wasn't in the position to toss my hard-earned cash into the well yet. He told me that the difference between the winners and losers is that the winners don't need the money. I'm not trying to say that there's a \"\"rich keep getting richer ...\"\" component here, while schlubs like me get nada.  The real nugget of wisdom he offered was that if anyone wants to do well as investors, we must invest in a way that we're not dependent on the money we have in the market. Instead, manage risk carefully so that you don’t get swept up in the emotional highs and lows.  For you, what I applaud is that you're willing to do your research first. And part of that should be anticipating how you will handle the anxiety when you put your money in at the wrong time or get out a little later than you should.  What I understand now is that you don’t need to be wealthy to “not need the money.” You just need to invest smartly and leave your emotions out of it.\"",
      "\"You are on the right track, for tax purposes its all ordinary income at the end of 2016. If the free lance \"\"employer\"\" will withhold fed,state and local tax, then that takes care of your estimated tax. If they can't or won't, you will need to make those estimates and make payments quarterly for the fed and state tax at your projected tax liability.  Or, you can bump up withholding by your day job employer and cover your expected tax liability at year end without making estimated tax payments.\"",
      "No such evidence exists, because many people do beat the market. And many people fail to earn market rate of return. The way you achieve the former is generally to take risks that also increase the likelihood of the latter. The amount of time and effort you invest may bias that result, but generally risk and potential reward tend to track pretty closely since everyone else is making the same evaluations. You can't prove a negative. We can't prove unicorns don't exist either. We can advise you that hunting for one is probably not productive; many others have been trying, and if there was one we'd probably have seen at least something that encourages us to continue looking. Not impossible, but the evidence is far from encouraging. Market-rate-of-return can be achieved fairy reliably with minimal risk and minimal effort, and at mostly long-term tax rates. I consider that sufficient for my needs. Others will feel otherwise.",
      "Thank you for taking the time to type up what everyone else (rational people) is thinking.  I love your analogy with the faith healers too.  Nowa day workers seem more like they are suppose to be cult members who do back breaking labor (long hour, low/no pay) so their leader can ride around in a limousine and wave at them from time to time.",
      "\"Your logic breaks down because you assume that you are the only market participant on your side of the book and that the participant on the other side of the book has entered a market order. Here's what mostly happens: Large banks and brokerages trading with their own money (we call it proprietary or \"\"prop\"\" trading) will have a number of limit (and other, more exotic) orders sitting on both sides of the trading book waiting to buy or sell at a price that they feel is advantageous. Some of these orders will have sat on the book for many months if not years. These alone are likely to prevent your limit orders executing as they are older so will be hit first even if they aren't at a better price.  On more liquid stocks there will also be a number of participants entering market orders on both sides of the book whose orders are matched up before limit orders are matched with any market orders. This means that pairing of market orders, at a better price, will prevent your limit order executing. In many markets high frequency traders looking for arbitrage opportunities (for example) will enter a few thousand orders a minute, some of these will be limit orders just off touch, others will be market orders to be immediately executed. The likelihood that your limit order, being as it is posited way off touch, is hit with all those traders about is minimal. On less liquid stocks there are market makers (large institutional traders) who effectively set the bid and offer prices by being willing to provide liquidity and fill the market orders at a temporary loss to themselves and will, in most cases, have limit orders set to provide this liquidity that will be close to touch. They are paid to do this by the exchange and inter-dealer brokers through their fees structure. They will fill the market orders that would hit your limit if they think that it would provide more liquidity in such a way that it fulfils their obligations. Only if there are no other participants looking to trade on the instrument at a better price than your limit (which, of course they can see unless you enter it into a dark pool) AND there is a market order on the opposite side of the book will your limit order be instantaneously be hit, executed, and move the market price.\"",
      "\"I was a millennial \"\"stuck\"\" in New York. I was in law school when the crash happened. I wanted to practice in smaller cities like CLT or ATL but immediately after the crash there were very few jobs, while New York started doing deals again by about late 2009. So I had to go to NY.   You end up getting \"\"stuck\"\" because of the barriers to move. For me it was the bar. But there are others like markets that recovered more slowly, experience requirements set by employers, the fact that there are simply more jobs in large urban markets. Most of my law school class started in SF, NY, Chi, and LA. Now we're on our 2nd firm or city in CLT, ATL, HOU, MIA, etc.\"",
      "\"This is the best tl;dr I could make, [original](https://www.cnbc.com/2017/08/02/housing-demand-strengthens-but-heres-why-some-buyers-are-giving-up.html) reduced by 73%. (I'm a bot) ***** &gt; &amp;quot;Buyers toured in full force last month, even though there were fewer homes hitting the market. New listings fell 3.3 percent from May and were down 1.6 percent from a year ago. Faced with a low supply of homes for sale and extremely competitive conditions, many homebuyers are struggling to make it to the offer stage.\"\"  &gt; The supply of homes for sale in July was down 11 percent annually, and homes were selling on average four days faster.  &gt; &amp;quot;Home prices also remain stubbornly high, failing to show hints of the usual seasonal cooldown. Low and moderately priced homes are being snatched up especially quickly, keeping many would-be buyers from being able to get into the market.\"\"   ***** [**Extended Summary**](http://np.reddit.com/r/autotldr/comments/6r8ybg/housing_demand_strengthens_through_summer_but/) | [FAQ](http://np.reddit.com/r/autotldr/comments/31b9fm/faq_autotldr_bot/ \"\"Version 1.65, ~181826 tl;drs so far.\"\") | [Feedback](http://np.reddit.com/message/compose?to=%23autotldr \"\"PM's and comments are monitored, constructive feedback is welcome.\"\") | *Top* *keywords*: **home**^#1 **market**^#2 **buyers**^#3 **year**^#4 **percent**^#5\"",
      "\"Remember this gush-a-thon when everything you can buy comes from the Amazon [chaebol](https://en.wikipedia.org/wiki/Chaebol).  Only on this site could there be a cult surrounding a predatory reptile who would make the Rockefellers and JP Morgan squirm.  You've been sucked in again; just like with Saint Elon and the Martyred Steve. Those 'disruptors', putting it to the \"\"man\"\" from their little garages, until they inevitably become what they conquered.\""
    ],
    "relevance_map": {
      "0": 1,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 1,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "query_1",
    "num_docs": 10
  },
  {
    "query": "The difference between Islamic Banks and Western Banks",
    "docs": [
      "\"I'm not sure of the theological basis against usury in sharia law. IIRC, sharia forbids excess compensation, and the modern interpretation of this includes interest.  Rules about banking are common in religious faiths. The Catholic church viewed interest as the \"\"selling of time\"\", and since time is a force controlled by god, charging interest was a heretical practice. For private transactions, modern Islamic banking is a relatively new phenomenon that emerged in the postwar period. I don't think this method of banking is a \"\"house of cards\"\", it's just different. Some US states, like California, also subject lenders to higher levels of risk. (ie. borrowers can walk)\"",
      "Outsourcing/offshoring.  The idea is that you give away all work that is not core to cheaper staff who do not work for you. Sure, they are cheaper but it means that the basic knowhow is sitting outside your company making it much more difficult to build up the expertise and management background for tomorrow.  I work as an independent consultant in trading systems. Companies use me because they do not want to build and retain in-house knowhow. Some of the bigger consultancies will be pleased to take the juniors that you trained and to sell them back to you at 5x the price when they become senior.",
      "Ben je benieuwd naar wat er beschikbaar is in alle toiletten is? Neem een kijkje op de website. Deze online sanitair bedrijf verkoopt niet alleen een breed scala aan staande toiletten producten en accessoires, kunt u altijd rekenen op kwaliteit tegen de beste prijs.",
      "\"If the stock is below its purchase price, there is no way to exit the position immediately without taking losses. Since presumably you had Good Reasons for buying that stock that haven't changed overnight, what you should probably do is just hold it and wait for the stock to come back up. Otherwise you're putting yourself into an ongoing pattern of \"\"buy high, sell low\"\", which is precisely what you don't want to do. If you actually agree with the market that you made a mistake and believe that the stock will not recover any part of the loss quickly (and indeed will continue going down), you could sell immediately and take your losses rather than waiting and possibly taking more losses. Of course if the stock DOES recover you've made the wrong bet. There are conditions under which the pros will use futures to buffer a swing. But that's essentially a side bet, and what it saves you has to be balanced against what it costs you and how certain you are that you NOW can predict the stock's motion. This whole thing is one of many reasons individuals are encouraged to work with index funds, and to buy-and-hold, rather than playing with individual stocks. It is essentially impossible to reliably \"\"time the market\"\", so all you can do is research a stock to death before making a bet on it. Much easier, and safer, to have your money riding on the market as a whole so the behavior of any one stock doesn't throw you into a panic. If you can't deal with the fact that stocks go down as well as up, you probably shouldn't be in the market.\"",
      "“Burt Malkiel is still the high priest of passive investing,” said Jakub Jurek, vice president for research at Wealthfront. “To be absolutely clear, we’re not stock pickers. There are decades of research on active investors, which show they underperform.”   So ... not really straying, just promoting a somewhat more sophisticated model based on algos (robo-investors?)",
      "\"I would have to disagree with the other responders. In technical analysis of stock charts, various short and long term moving averages are used to give an indication of the trend of the stock in the short and long term, as compared to the current price. I would prefer to use the term moving average (MA) rather than average as the MA is recalculated every day (or at appropriate frequencies for your data) on the period you are using. I would also expand on the term \"\"moving average\"\". There are two that are commonly used Going back to the question, of the value of this number, For example if the current price is above the 200 day EWMA and also above the 30 day EWMA, then the stock is broadly trending upwards. Conversely if current price is below the 200 day EWMA and also below the 30 day EWMA, then the stock is broadly trending downwards. These numbers are chosen on the basis of the market you are trading in, the volatility and other factors. For another example of how a number of moving averages are used together, please have a read of Daryl Guppy's Multiple Moving Average, though this does not use moving averages as large as 200 days.\"",
      "\"To answer your first part, its not an opposition to profit. It's an opposition to usury - the practice of charging excessive interest on loans. There are extensive passages in the Qur'an condemning the practice, and in many cases \"\"excessive interest\"\" is any interest. To the second part of the question, these may well be more risky investments. But if you're trying to build a strong and thriving community financial spirit, one might expect there to be significant social pressures to use the loaned money responsibly. Additionally, while it removes some of the penalty for failure, it doesn't remove the rewards for success. The incentive is still there to succeed. It's merely the penalty for failure is no longer financial ruination. It may also temper the incentive for banks to give money to riskier borrowers, but rather to prudently invest in ventures with an acceptable amount of risk. The question as to whether or not this is a \"\"house of cards\"\" likely depends on the questioner. Whether or not this is also true for the western banking system likely remains to be seen, but it hasn't exactly been doing a sterling job of convincing me it isn't true for the past decade.\"",
      "\"One of the principles of Sharia Banking is (Wikipedia): Shariah prohibits what is called \"\"Maysir\"\" and \"\"Gharar\"\". Maysir is involved in contracts where the ownership of a good depends on the occurrence of a predetermined, uncertain event in the future whereas Gharar describes speculative transactions. Both concepts involve excessive risk and are supposed to foster uncertainty and fraudlent behaviour. In other words risky investments are prohibited in Sharia Banking.\"",
      "We are distributor and wholesale supplier of high quality of professional soccer sporting soccer balls. We specialize in making customized soccer balls. we strive to keep all of the new Premium cheap soccer balls and accessories in stock for our valuable customers. Our selection of Nike, Adidas soccer balls includes premium game balls.",
      "I'll play this game. Pay me to not kick your seat all flight. Game Theory is fun.  Edit: More economics- THE AIRLINE owns the property rights of the seat you are leasing, not you. You may only recline at their discretion. If it bothers me, and I notify the attendants and they ask you not to, you comply."
    ],
    "relevance_map": {
      "0": 1,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 1,
      "7": 1,
      "8": 0,
      "9": 0
    },
    "query_id": "query_2",
    "num_docs": 10
  },
  {
    "query": "Why are for-a-fee wires faster than 2+ day free ACH",
    "docs": [
      "No no - Casual dining restaurants have a business model that is increasingly obsolete, and rather than trying to adapt to changing market conditions, they're just blaming those dang kids.  Sorry, but it's the market - if your product is bad, you won't succeed. Blame the market all you want, but it won't make a shred of difference.",
      "\"ACH transfers are the evolution of paper check clearing houses. Transactions are conducted in bulk and do not immediately settle -- the drawer and drawee still retain liability for a period of days or weeks after the transaction date. (I'd suggest looking to the legal definition of a check or draft to understand this better.) A for-fee wire transfer still goes through an intermediary, but settle immediately and irrevocably. Wire transfers are analogous to handing cash to someone.  In the US, the various Federal Reserve banks are involved because they are the central banks of the the United States.  In the past, bank panics were started or exacerbated when banks would refuse to honor drafts drawn on other banks of questionable stability. Imagine what would happen today if your electric company refused to accept Bank of America or Citibank's check/ACH transactions? Wouldn't you get withdraw every penny you could from BoA? During the 1907 banking panic, many solvent banks collapsed when the system of bank \"\"subscriptions\"\" (ie. arrangements where small town banks would \"\"subscribe\"\" to large commercial banks for check clearing, etc) broke down. Farmers, small business people and individuals lost everything, all because the larger banks would not (or could not) risk holding drafts/checks from the smaller banks.\"",
      "&gt;You know there are things that are out of your hands right?  Yes.  &gt;Like the choices your parent's made, choices others make that have impacted you, etc. Can't control everything in life and your nativity to those complexities shows that you've never met or heard of people who are themselves left without many options in their life to just up themselves and find a job that actually pays a living wage.  Sure, your parents play a *significant* role in your life.  Yes. There are things out of your control.  Yes. Nothing here is an epiphany - everyone has to deal with adversity - you are still in control of your own life more than anyone else.  The point is, being a victim isn't going to get you very far in this world.",
      "\"That sounds like a particularly egregious version of exclusivity. However, the way that you could handle that is to include a \"\"contingency\"\" in your purchase agreement stating that your offer is contingent upon the seller paying the brokerage fee. The argument against this, and something your broker might use to encourage you not to do so, is that it makes your offer less attractive to the buyer. If they have two offers in hand for the same price, one with contingencies and one without, they will likely take the no-contingency offer. In my area, right now, house offers are being made without very common contingencies like a financing contingency (meaning you can back out if you can't finance the property) or an inspection contingency. So, if your market is really competitive, this may not work. One last thought is that you could also use this to negotiate with your broker. Simply say you're only sign this expecting that any offer would have such a contingency. If it's untenable in your current market, it will likely cause your broker to move on. Either way, I'd say you should push back and potentially talk to some other brokers. A good broker is worth their weight in gold, and a bad one will cost you a boat load. And if you're in Seattle, I'll introduce you to literally the best one in the world. :-)\"",
      "\"Ultimately, money derives its value from being spend on a good or service. Investing it is an act of denying your present-self a good or service so that your future-self can obtain (hopefully more) goods or services. Investing is a sensible and responsible default position, but you clearly have passed the point at which the opportunity cost of the dollar not spent today is greater than its benefit in the future. Not all dollars are the same. Remember that money is a temporary store of value but you have to spend it to realize that value. In your search, learn about the \"\"psychology of money.\"\" What are you saving it for? How much do you want left over when you die? If you die tomorrow, will you regret not having spend a little more? I'm sorry to get morbid on you, but saving for the future requires answering the question \"\"How long?\"\" and it's never forever. This may be tangential but it shaped my behaviour towards money nonetheless: Frank Zimbardo on The Psychology of Time. I would hazard a guess and say that you land in the future-oriented camp.\"",
      "If you are in a position to have information that will impact the shares of a stock or index fund and you use that information for either personal gain or to mitigate the losses that you would have felt then it is insider trading.  Even if in the end your quiet period passes with little or no movement of the stocks in question.  It is the attempt to benefit from or the appearance of the attempt to benefit from inside information that creates the crime.  This is the reason for the quiet periods to attempt to shield the majority of the companies employees from the appearance of impropriety, as well as any actual improprieties. With an index you are running a double edged sword because anything that is likely to cause APPLE to drop 10% is likely to give a bump to Motorola, Google, and its competitors.  So you could end up in jail for Insider trading and lose your shirt on a poor decision to short a Tech  ETF on knowledge that will cause Apple to take a hit.  It is certainly going to be harder to find the trade but the SEC is good at looking around for activity that is inconsistent with normal trading patterns of individuals in a position to have knowledge with the type of market impact you are talking about.",
      "So your against food stamps? Or just people working while taking food stamps? Because unless you are against either of those, Wal-Mart isn't doing anything wrong. They're simply employing an otherwise unemployable segment of the population. The fact that it is more profitable for them to employee these particular people is the only reason they have jobs in the first place. The first thing Wal-Mart will do, if they have to raise their wages, is let go many of these workers and look for better ones. They're only an attractive option at a lower price. If I'm wrong, why don't they leave Wal-Mart for better jobs? Wal-Mart didn't tell them they were worth that much. The rest of society told them that they weren't worth anything more. That's why Wal-Mart can pay them that much. Maybe, just maybe, they should stop whining about their lot and consider the course they took in life that they can only boast stocking and sliding products across a scanner on a job interview.",
      "You can't buy it outright. You can't take the time to save up. if the remaining choice is between a card that charges from day one, and a card with this kind of grace period, the grace card is the better choice. Plan wisely, pay it in full before that rate starts to be charged. One additional note - There are two groups of people, the pay-in-fullers and the balance carriers. I believe that one should pay in full, and never pay interest.  A zero rate offer can be used by the balance carrier to feel great for 12 months, but have even more debt after the rate kicks in.  As a pay-in-full user, I've used the zero rate to throw $20K at the 5.25% mortgage, and planned a refinance to 3.5% just as it ended. a $750 savings (after the tax effect) well worth the bit of effort.  The fees should be in the fine print. My zero rate had a transfer fee, $50 max, which was nothing in comparison to the savings.",
      "\"The reason to put more money down or accept a shorter maximum term is because the bank sweetens the deal (or fails to sour it in some fashion).  For example, typically, if there is less than 20% down, you have to pay an premium called \"\"Private Mortgage Insurance\"\", which makes it bad deal. But I see banks offering the same rate for a 15%-year mortgage as for a 30-year one, and I think: fools and their money.  Take the 30-year and, if you feel like it pay more every month.  Although why you would feel like it, I don't know, since it's very difficult to get that money back if you need it.\"",
      "\"One of the best answers to this question that I've ever read is in a paper published by Robert Lucas in the Journal of Economic Perspectives. That journal is meant to a be a place for experts to write about their area of expertise (in economics) for a general but still technically-minded audience. They recently opened up the journal as free to the public, which is a fantastic resource -- you no longer need a subscription to JSTOR (or whatever) to read it.  You can read the abstract to the paper, and find a link to it, here. One of the things that I like a lot about this paper is that it strips out absolutely everything even slightly unnecessary to thinking about a macroeconomy, and just discusses what one can arrive at with a very very simple model. Of course, with great simplicity come sacrifice about details. However, it does a great job of answering your question, \"\"why do people care about growth?\"\" A quick note: the key to understanding the answer to your question is to think about things in terms of \"\"the long term\"\"  -- not even looking forward to the future, because we'll be dead by then, but looking back to the past. The key to the importance of growth is that, for the last ~200 years, the US has, on average, had maybe 2-3% \"\"real growth\"\" per year (I'm pulling these numbers out of my head; I think much better numbers are in that paper somewhere). On average, over that period of time, this growth has meant that the quality of life that one has, if one lives in a country experiencing this growth, is enormous compared to countries that do not experience this average growth over that period.  Statistically speaking, growth is also somewhat auto-correlated. Roughly speaking, if it was low the last few periods, you can expect it to be low the next period. Same thing if it's high.   Then, the reason we care about growth right now: if you have too many periods of low growth, pretty soon the average \"\"over the long term\"\" growth will be pulled down -- and then quality of life can't be higher in the future (which quickly becomes someone's \"\"present\"\"). The paper above makes this point with a very simple model. Of course, none of this touches on distributional issues, which are another issue entirely. With respect to, \"\"The economy needs to grow to just keep up with its debt repayments,\"\" I think the answer is along the lines of, \"\"sometimes countries get into debt expecting that growth will increase their resources in the future, and thus they can pay back their debt.\"\" That strategy is, of course, the strategy that anyone borrowing (\"\"taking out a loan\"\") should be employing -- you should expect that your future income will be enough to pay back your interest+principle on a loan you took. Otherwise you're irresponsible. At the aggregate level, production is the nation's \"\"income\"\" -- it is what you have, all that you have (as a nation) to pay back any debt you've incurred at the national level.\""
    ],
    "relevance_map": {
      "0": 0,
      "1": 1,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "query_3",
    "num_docs": 10
  },
  {
    "query": "Do I qualify for a personal 401-K Plan?",
    "docs": [
      "&gt; You must not understand how profitable advertising is to Google and YouTube and Facebook... it is very very very profitable, and AdBlock can't block those ads.   I DO understand, that's why I am making noise now, because all of them are going to be in big trouble soon.  Ad block DOES block those ads. 100% of them. I see _zero_ ads. Nothing on facebook, nothing on google, nothing on youtube. There are ad blockers for all of it.",
      "You have to pay off the balance on the loan first. Also, FHA loans are not supposed to be used for rental properties. I don't know how you living there for a number of years changes things or how often is that rule enforced but you might need to refinance even if you rent it out.",
      "I will be messaging you on [**2018-09-13 22:07:37 UTC**](http://www.wolframalpha.com/input/?i=2018-09-13 22:07:37 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/business/comments/6ztraf/bitcoin_fell_below_4000_overnight_continuing_its/dmyvv1h)  [**7 OTHERS CLICKED THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Reminder&amp;message=[https://www.reddit.com/r/business/comments/6ztraf/bitcoin_fell_below_4000_overnight_continuing_its/dmyvv1h]%0A%0ARemindMe!  One Year  ) to send a PM to also be reminded and to reduce spam.  ^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Delete Comment&amp;message=Delete! dmyvvpb)  _____  |[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Reminder&amp;message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&amp;subject=List Of Reminders&amp;message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&amp;subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/) |-|-|-|-|-|-|",
      "\"I'm not a tax lawyer, but from what I can tell it looks like you'd be eligible to use your contractor income to fund a Solo 401(k).  http://www.irafinancialgroup.com/whatissolo401k.php \"\"To access these benefits an investor must meet two eligibility requirements: The presence of self employment activity. The absence of full-time employees.\"\" And from the IRS itself (http://www.irs.gov/pub/irs-tege/forum08_401k.pdf)\"",
      "The trouble is not enough Americans today are willing to do hard physical work for low pay. At the same time, Americans aren't willing to pay more for things like landscaping and fruits and veggies. I would be delighted if we fixed our broken legal immigration system, but since we can't seem to do that, we get illegal immigrants, and every day both you and I use products they produced.",
      "A retail revolving account is a more formal name for a general credit card.   A revolving account is an account created by a lender to represent debts where the outstanding balance does not have to be paid in full every month by the borrower to the lender. The borrower may be required to make a minimum payment, based on the balance amount. Retail Revolving Account Wikipedia This is different from something like a car loan or mortgage or other more structured or secured debt.   It used to be somewhat common for very large retailers to issue lines of credit to their customers in the form of a store card.  This card was a lot like a credit card but only accepted at the specific retailer.  These kinds of cards are all but extincted.  Now major retailers will simply co-brand a credit card with a major bank, the differentiation being preferred rewards when used at the retailer.",
      "At the higher level - yes. The value of an OTM (out of the money) option is pure time value. It's certainly possible that when the stock price gets close to that strike, the value of that option may very well offer you a chance to sell at a profit. Look at any OTM strike bid/ask and see if you can find the contract low for that option. Most will show that there was an opportunity to buy it lower at some point in the past.  Your trade. Ask is meaningless when you own an option. A thinly traded one can be bid $0 /ask $0.50. What is the bid on yours?",
      "See how you can only make the premium amount but your risk is the same as holding the stock when writing a put option.",
      "\"Yesterday I have received a call from my local bank. They told the the payment had arrived, but the money sender failed to specify my account number. They have only specified SWIFT code and my address. And in order to receive my money, money sender has to send an additional SWIFT message, where my account number must be specified. And the money transfer will remain \"\"frozen\"\" (or \"\"blocked\"\") until such a message would be received. In this case normally your local bank has to send a SWIFT MT199 to the sending Bank that the account number quoted is missing. The Sending Bank would contact the company and send back a SWIFT message with required info.\"",
      "\"That's not how monkeysphere as a concept works.    It's a very specific concept related to the total size of our \"\"active\"\" social network, it has nothing to do with generalizing an entire business to it's CEO.    The monkeysphere holds that we have a maximum number of social connections we can maintain with any relevant level of intimacy and social cohesion.  It holds that unit cohesion breaks down when the organization exceeds that threshold, because members can no longer keep track of all other members as individuals.    It's an excellent HR management theory, and one that's well backed, but has absolutely nothing to do with the context you're using it in.\""
    ],
    "relevance_map": {
      "0": 0,
      "1": 0,
      "2": 0,
      "3": 1,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "query_4",
    "num_docs": 10
  },
  {
    "query": "Why can we cancel cheques, but not Western Union transfers?",
    "docs": [
      "\"Do you have other income that you are not considering?  Interest and dividends would be an example, but there are all sorts of options.   Also with your witholding is it set up such that your employers have any idea of your tax bracket ultimately based on your combined incomes?  Usually what they do is take out money assuming you will be in the tax bracket of any given paycheck spread out over the course of a year.  For example, for federal I had an option to select (in an online form that fills out my W4 for me) \"\"married: withold at higher single rate\"\" and did to try and cover this fact.  Eventually I may end up having to calculate my own witholding to fix a too-low problem like yours.\"",
      "\"You are presuming that after the transfer, the cash is still \"\"sitting in a Western Union register\"\" but no, that cash may have already been taken by the fraudster. To refund the victim, Western Union would have to (1) pay the victim back the amount of money lost, and then (2) pursue the fraudster to reclaim the lost funds. Because the fraudster at the other end can simply show ID to get the money [ie: they do not have an account with Western Union], the cost to pursue that person to reclaim the lost funds would be substantially higher than for your bank, because your bank can simply ding your account. In the event that your account goes into overdraft [because there were insufficient funds to reclaim the full amount], the bank at least has a framework in place to pursue you for penalties.\"",
      "The problem with this is that the advertising revenue doesn't justify it, and neither does the pay per channel. When Hulu starts making money, then it might be a possibility. Right now advertisers won't pay as much for a commercial on the internet that reaches the same number of viewers as it would on tv. Unfortunately, the cost doesn't match up to the benefit at the moment.",
      "\"I don't know Canada very well, but can offer some general points when considering where to park your emergency fund. Savings rates are currently low, but then so is inflation. Always bear in mind that inflation decreases the value of your money, so if you're getting 4% interest and inflation is 2%, you're making 2% gross in real terms. If you're getting 2% and inflation is close to zero, you're actually earning a similar amount, it's just the numbers are going up more slowly. Obviously when and how much tax you pay affects the actual return, it's just worth bearing in mind that low interest and low inflation are actually not that bad a savings environment as they first appear. For an emergency fund the key thing is ease of access, consider keeping some portion of your savings in an instant access account for those emergencies that happen when the banks are closed. In the UK there are various tax-free savings options, I'm guessing Canada has a few too, if so you should explore those options. While these may not have attractive headline rates, you don't pay tax on the interest, this can make them much more competitive (4% tax free is the same as 5% gross if you would have to pay tax at 20%). Normally tax free investments have caps so once you've invested a set amount you can't add anymore. This may be a consideration if you regularly dip into your emergency fund as you might not easily be able to build it up again. My approach is to have about 90% of my \"\"rainy day\"\" fund in easily accessible but tax free savings. This discourages me from spending it unless I really need to. I then keep a slush fund sufficient to cover every day disasters (boiler packing up, needing a hire car for a week etc) in instant access accounts .\"",
      "When you send money with Western Union, it is essentially a cash transaction.  You supply Western Union with the name of the recipient and a location.  Your recipient then shows up at a Western Union office, shows some identification, and receives cash.  At this point, the transaction is over.  It is impossible to retract it at this point, because Western Union has already handed out cash, and they have no way of contacting the recipient any longer. This is the reason why you might want to legitimately use Western Union.  It is an instant way to send cash to anyone anywhere in the world.  Let's say that your best friend is stuck in a foreign land and desperately needs money.  You can give him cash just as fast as each of you can get to a Western Union office, and you don't even need a local bank account to do so. Unfortunately, however, the nature of the service also makes it useful for scammers.  You should never use this service to pay for something from someone you don't know, because there are absolutely no safeguards. As mentioned by user662852 in the comments, you can indeed cancel a Western Union money transfer if you do so before the money is picked up by the recipient.  But after they pick it up, the cash is gone.",
      "I'm all-in on hard silver, a small portion is stored at my house for emergency expenditures and the vast majority is in a high-security vault in Canada. That was actually the cheapest place I could find for long-term storage and insurance, which happened to be off-shore. It could turn out to be beneficial to be off-shore though. In the 1930s gold became illegal to privately own its very possible they could do the same this time, although they didn't in 1979. Oil is too high in volume to reasonably store. Gold isn't as undervalued as silver, which I could spend a full day talking about. But to sum it up in a few points: there is less silver than there is gold, gold has a premium for jewelry which will likely go down in a crash even though you will still see gains, silver is the second most used commodity besides oil, less people are in the know about it, silver prices were actually higher than gold a few times in the past century, simply measuring the dow in silver will show it's further below the historical average compared to gold. I'll stop there, but I could go on though on silver if people want. Real-estate is still very expensive from the 2008 recession, traditionally mortgages are $1.05 per dollar you would spend on renting the same property. Currently real-estate is at like $1.25+ I believe, It peaked at about $1.95. I rent, to save money, which you can spend on other assets.  If one's willing to move to another state for lower taxes, they definitely should. Employment is going to be harder to come by, and they should get as much out of it as possible as they can. If they don't save enough, they could end up just using their entire savings during the whole thing if they can't find a job, in which case at the end you'd never know they knew it was going to happen.  Overall I don't think this crash is going to be like the great depression. I don't feel compelled to store food and buy a generator or anything. I believe the living will be *easier* than it were to live in the 90s for those who are invested in assets. Everything is going to be on sale, meanwhile their wealth will be increasing. Depending on how much they own it could be increasing faster than they need to spend it. Sounds like the life to me. But with that said those without real assets, especially the lower class, will be unemployed and living on food stamps. Perhaps even the food stamps making more people leave the dollar and the economy. This actually might not be a prediction and is what happening already. But I don't believe anybody, in america at least, will be starving. In the 30s we had not mastered industry farming yet and we had the *dustbowl* to make things worse.   Crime though, I'd own a gun. The protesters are here already, and I think we are just passing the half-way point right now, they will get angrier.  I don't know enough about taxes to know the best country or place to store to combat taxes. Maybe someone else can chime in. I'm in canada to avoid high insurance and storage fees.  And for careful selection of primary residence, In the long haul I'd rent a small apartment, as small and cheap as possible. In a safe neighborhood, but not so much secluded that a single grocery store or gas station going out of business could ruin it.",
      "In the theater, it's a person who can afford to buy expensive pop corn, cause he can buy the expensive movie ticket too... Also sitting at one place will make him feel hungry and buy something to eat... So maximum chances are that in the theater, that guy is your potential customer... Otherwise if the popcorn seller is somewhere outside the theater, they may charge you less. That's because of a different target audience... They would be targeting anyone who comes near the theater, who would not be willing to pay for expensive snacks or movie tickets... So very few customers around will be actually potential customers... To maximize their profits, they will keep the prices low and supply as much as they can... I know this is going against the normal Price Elasticity of Demand and Supply graph, but if the prices are low there will be high demand, so if the PED is more than 1, the supplier should supply as much as they can, to maximize profits... Its all based on the target audience... That's what I think should be the case of expensive popcorn in movie theaters...",
      "\"It is measured in US dollars.  The US cannot just print the money because that would cause inflation.  Remember that money is really just a convenient placeholder for the barter system.  Creating more money regardless of whether there is more value in the economy (work, resources, etc.) is a very bad idea, and doing so has collapsed the economies of many countries. Debt increasing means that the US owes other countries more money.  So yes, they are receiving more money from other countries, but the US has to pay it all back with interest eventually. The US government spends more money than it receives in taxes.  To decrease the debt, spending needs to decrease and/or taxes need to increase. Many countries lend to the US.  One of the biggest is China.  These countries do so because of interest -- the US pays back more money than it gets lent, so the lending countries make a profit. If China suddenly called in all its debt to the US, this would severely damage the world economy.  China's biggest trading partner is the US, so it has no interest in harming the US this way; it would harm itself.  Additionally, the US would probably refuse to pay it (not to mention that it can't), and then China would lose all the money it \"\"invested\"\" in the US.  It would benefit no one.\"",
      "\"&gt;Nowa day workers seem more like they are suppose to be cult members who do back breaking labor (long hour, low/no pay) so their leader can ride around in a limousine and wave at them from time to time.   Well, such \"\"cult\"\" members are easy to exploit.  And it also has hints of feudalism, when people were expected to \"\"tip their hat\"\" to the local Squire, etc.  IMO, we've been on a trend towards that ever since (a century ago) US embarked on its \"\"Imperial\"\" ways (from Teddy Roosevelt on...); but it is a trend that has been accelerating in recent decades (no doubt aided by the virtual \"\"self-indenturing\"\" of people into heavily burdensome consumer debt; something they didn't *have* to accept).\"",
      "Yea, bay area. If you want oil, you move to houston. If you want tech money, you move to the bay area. You can stay here for a year or two to lock down that you command a bay area salary and then do like I did and fuck off to SE asia and work remote."
    ],
    "relevance_map": {
      "0": 0,
      "1": 1,
      "2": 0,
      "3": 0,
      "4": 1,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "query_5",
    "num_docs": 10
  },
  {
    "query": "What is the best way to learn investing techniques?",
    "docs": [
      "\"To add to MrChrister's answer:  Canada also has a Consumer Price Index (CPI) used to measure inflation that is distinct and separate from that maintained by the United States. There are differences in inflation between the U.S. and Canada because our currencies are different, and there may be different items in the \"\"basket\"\" of goods that constitutes the index. You can find current information on the Canadian CPI at Statistics Canada, here: Latest release from the Consumer Price Index. Also, the Bank of Canada – our central bank – maintains a free online Inflation Calculator.  The BoC's inflation calculator is handy because you can enter a dollar amount for a past date and it will figure out what that would be in today's dollars.  For instance, $100 in 1970 dollars had the same purchasing power (under the CPI) as $561.76 in 2009 dollars! And you're right – if you get a salary increase that is less than the rate of inflation, then in theory you have lost purchasing power.  So, anybody really looking for a raise ought to make an effort to get more than the increase in CPI.  Of course, some employers are counting on you not knowing that, because any increase that's less than CPI is effectively a salary decrease; which could mean more profit for them, if they are able to increase their prices / revenues at inflation or better. Finally, consider that salary & wage increases also contribute to inflation!  Perhaps you've heard of the wage/price inflation spiral.  If you haven't, there's more on that here and here.\"",
      "It benefits society to have many well educated young people. As a society we should be encouraging people to reproduce responsibly and then it is our responsibly as a collective society to aid families in their goal to produce productive members of society.   Our goal should be to eliminate poverty since those who are poor end up costing society money. Preventing the conditions associated with poverty by providing at least subsistence care will save money in the long run and produce economic activity.  We should not be encouraging the cycle of poverty by abandoning those currently impoverished.",
      "I've shown this video to people with more than 10 years experience in the finance industry, and even they have gotten something from it. It is a brilliant video, too good not to share. And if we are all the wiser, hopefully we can avoid this type of disaster from happening again.  Thanks for the comments.",
      "The fluctuation of interest rates during the next year could easily dwarf the savings this attempt to improve your credit score will have; or the reverse is true. Will the loan improve your score enough to make a difference? It will not change the number of months old your oldest account is. It will increase the breadth of your accounts. Applying for the car loan will result in a short term decrease in the score because of the hard pull. The total impact will be harder to predict.  A few points either way will generally not have an impact on your rate. You will also notice the two cores in your question differ by more than 30 points. You can't control which number the lender will use. You also have to realize the number differs every day depending on when they pull it that month. The addition of a car loan, assuming you still have the loan when you buy the house, will not have a major impact on your ability to get afford the home mortgage. The bank cares about two numbers regarding monthly payments: the amount of your mortgage including principal, interest, taxes and insurance; and the amount of all other debt payments: car loan, school loans, credit cards. The PITI number should be no more than 28%-33% of your monthly income; the other payments no more than 10%.  If the auto loan payments fit in the 10% window, then the amount of money you can spend each month on the mortgage will not be impacted. If it is too large, then they will want to see a smaller amount of your income to go to PITI. If you buy the car, either by cash or by loan, after you apply for the mortgage they will be concerned because you are impacting directly numbers they are using to evaluate your financial health. I have experienced a delay because the buyer bought a car the week before closing. The biggest impact on your ability to get the loan is the greater than 20% down payment, Assuming you can still do that if you pay cash for the car.  Don't deplete your savings to get to the 50% down payment level. Keep money for closing costs, moving expenses, furnishing, plus other emergencies. Make it clear that you can easily cover the 20% level, and are willing to go higher to make the loan numbers work.",
      "\"First, you need to figure out what your objectives for the money are.  Mostly, this boils down to how soon you are going to need the money.  If you are, as you say, very busy and you don't need the money until retirement, I'd suggest putting your money in a single target date fund, such as the BlackRock LifePath fund.  You figure out when you are going to retire, and put your money in that fund.  The fund will then pick a mix of stocks, bonds, and other investments, adjusting the risk for your time horizon. Maybe your objectives are different, and you want to become an trader.  You value being able to say at a BBQ, \"\"oh, I bought AAPL at $20\"\", or \"\"I think small caps are over valued\"\".  I'd suggest you take your $50,000, and structure it so you invest $5,000 a year over 10 years.  Nothing teaches you about investing like making or losing a bit of money in the market.  If you put it all in at once, you risk losing it all - well before you've learned many valuable lessons which only the market can teach you. I'd suggest you study the Efficient-market hypothesis before studying specific markets or strategies.\"",
      "(1) Should I register for VAT?  – If it is below the threshold amount it is purely voluntary. If you register for VAT, you would have to charge VAT and then do returns every quarter. If you can take up this bit of hassle, it doesn't make much of a difference. One thing you need to consider: you get 1% discount during your first year of registering for VAT. If you want to save this discount for when you really need to pay VAT, it could be helpful. (2) What benefits would registering for VAT include?  – Except for reclaiming VAT, where you pay VAT for business expenses, not much. (3) Would I not just hold onto the monies for HMRC ?  – You wouldn't hold any money for HMRC. They will send you notifications if you do not file your returns and pay your VAT quarterly. And get everything cleared from your accountant. If your accountant doesn't answer properly, make it clear you need proper answers. Else change your accountant. If you do something wrong and HMRC gets after you, you would be held liable – your accountant can take the slip if you signed on all business documents provided by your accountant.",
      "All the things you suggest are good, but I think like everything else the key is practice.  Study some topics, then try them out.  There are many many sites out there that have free or cheap virtual trading.",
      "Get a lawyer to put this in contract form, with everything spelled out explicitly. What is fair is what the two of you agree upon. My own suggestion: Divide the property into things which are yours, his, and shared, then have each of you be responsible for all your costs plus half the shared costs, but get all the benefits of your half. That would mean that if he rents out his half, all the rental income is his; if you decide to live in your half, all the savings of not paying rent are yours.  Each of you pays your half of mortgage, insurance, and other shared costs. Repairs to shared infrastructure should be done by someone both of you trust. If you agree the work is needed and he does it rather than your hiring someone, you owe him the appropriate percentage of the costs; the two of you will need to agree on whether you owe him for that percentage of his time as well. Make sure you agree on some mechanism for one person offering to buy the other out, or to sell their half to the other party... or potentially to someone else entirely. (Personally, I would try to do that at soonest opportunity, to avoid some of the ways this can go wrong -- see past comments about the hazards of guaranteeing a loan; this works or doesn't work similarly.) Does that address your question?",
      "The simplest way to answer that is by asking yourself what forces are against them from climbing the economic ladder?  The biggest determinant of financial success is a high school diploma and not having a child out of wedlock (kids cost $)   I am not a conservative",
      "Given what you state you should shop around for an advisor. Think of the time required to pursue your strategies that you list? They already have studied much of what you seek to learn about. Any good investor should understand the basics. This is Canadian based but many of the concepts are universal. Hope you find it helpful. http://www.getsmarteraboutmoney.ca/Pages/default.aspx"
    ],
    "relevance_map": {
      "0": 0,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 1,
      "5": 0,
      "6": 1,
      "7": 0,
      "8": 0,
      "9": 1
    },
    "query_id": "query_6",
    "num_docs": 10
  },
  {
    "query": "Higher returns from international markets?",
    "docs": [
      "\"I went to Morningstar's \"\"Performance\"\" page for FUSEX (Fideltiy's S&P 500 index fund) and used the \"\"compare\"\" tool to compare it with FOSFX and FWWFX, as well as FEMKX (Fidelity Emerging Markets fund).  According to the data there, FOSFX outperformed FUSEX in 2012, FEMKX outperformed FUSED in 2010, and FWWFX outperformed FUSEX in both 2010 and 2012.  When looking at 10- and 15-year trailing returns, both FEMKX and FWWFX outperformed FUSEX. What does this mean?  It means it matters what time period you're looking at.  US stocks have been on an almost unbroken increase since early 2009.  It's not surprising that if you look at recent returns, international markets will not stack up well.  If you go back further, though, you can find periods where international funds outperformed the US; and even within recent years, there have been individual years where international funds won. As for correlation, I guess it depends what you mean by \"\"low\"\".  According to this calculator, for instance, FOSFX and FUSEX had a correlation of about 0.84 over the last 15 years.  That may seem high, but it's still lower than, say, the 0.91 correlation between FUSEX and FSLCX (Fideltiy Small Cap).  It's difficult to find truly low correlations among equity funds, since the interconnectedness of the global economy means that bull and bear markets tend to spread from one country to another.  To get lower correlations you need to look at different asset classes (e.g., bonds). So the answer is basically that some of the funds you were already looking at may be the ones you were looking for.  The trick is that no category will outperform any other over all periods.  That's exactly what volatility means --- it means the same category that overperforms in some periods will underperform in others.  If international funds always outperformed, no one would ever buy US funds.  Ultimately, if you're trying to decide on investments for yourself, you need to take all this information into account and combine it with your own personal preferences, risk tolerance, etc. Anecdotally, I recently did some simulation-based analyses of Vanguard funds using data from the past 15 years.  Over this period, Vanguard's emerging markets fund (VEIEX) comes out far ahead of US funds, and is also the least-correlated with the S&P 500.  But, again, this analysis is based only on a particular slice of time.\"",
      "Sure, just outsource everything that doesn't justify a $70k salary - book keeping, it help desk, janitorial, etc.  Hell, outsource software development if you can maybe only employ a senior architect and outsource the rest.  Be in b2b Sales so you don't need any front line b2c customer service needs.  Make sure your goods are digital so you don't need warehouse or logistics staff.  Make sure your revenue is recurring and drafted from the customer automatically so you don't need any accounts receivable staff.  Sure, you can use this model - it works great for something like a credit card payment processor, just like it would work well for a boutique financial services firm or a SaaS software company.",
      "Here's the 2009-2014 return of the S&P 500 (SPY) vs. Vanguard FTSE ex-US (VEU) (higher returns bolded) Another argument for them is their low correlation to U.S stocks.   Looking at history however, I don't see it. Most times U.S stocks have   done badly, foreign stocks have also done badly. Looking at the last 6 years (and current YTD), 1 in 3 years have international stocks doing better.    I invest a portion of my investments in international because they aren't well correlated.",
      "\"Tricky question, basically, you just want to first spread risk around, and then seek abnormal returns after you understand what portions of your portfolio are influenced by (and understand your own investment goals) For a relevant timely example: the German stock exchange and it's equity prices are reaching all time highs, while the Greek asset prices are reaching all time lows. If you just invested in \"\"Europe\"\" your portfolio will experience only the mean, while suffering from exchange rate changes. You will likely lose because you arbitrarily invested internationally, for the sake of being international, instead of targeting a key country or sector. Just boils down to more research for you, if you want to be a passive investor you will get passive investor returns. I'm not personally familiar with funds that are good at taking care of this part for you, in the international markets.\"",
      "Foreign stocks tend to be more volatile -- higher risk trades off against higher return potential, always. The better reason for having some money in that area is that, as with bonds, it moves out-of-sync with the US markets and once you pick your preferred distribution, maintaining that balance semi-automatically takes advantage of that to improve your return-vs-risk position. I have a few percent of my total investments in an international stock index fund, and a few percent in an international REIT, both being fairly low-fee. (Low fees mean more of the money reaches you, and seems to be one of the better reasons for preferring one fund over another following the same segment of the market.) They're there because the model my investment advisor uses -- and validated with monte-carlo simulation of my specific mix -- shows that keeping them in the mix at this low level is likely to result in a better long-term outcome than if i left them out. No guarantees, but probabilities lean toward this specfic mix doing what i need. I don't pretend to be able to justify that via theory or to explain why these specific ratios work... but I understand enough about the process to trust that they are on (perhaps of many) reasonable solutions to get the best odds given my specific risk tolerance, timeline, and distaste for actively managing my money more than a few times a year. If that.",
      "Just to make the deal sweeter, see if you can negotiate a cash discount for paying for grad school with cash. If not, at least look into paying with a rewards credit card so you can get a rebate through your own means. Pay the school loan. People can default on mortgages, school loans are forever. Nothing wrong with sacrificing your dreams for a house several more years while you save. My wife and I are debt free, but it will take a few more years to save for a down payment on a house. It sure feels good knowing we don't owe anyone anything while we make our money have the purpose we want to give it. When you have to pay the bank interest, you do not have control on some of your money.",
      "\"From Wikipedia: Usage Because EV is a capital structure-neutral metric, it is useful when   comparing companies with diverse capital structures. Price/earnings   ratios, for example, will be significantly more volatile in companies   that are highly leveraged. Stock market investors use EV/EBITDA to compare returns between   equivalent companies on a risk-adjusted basis. They can then   superimpose their own choice of debt levels. In practice, equity   investors may have difficulty accurately assessing EV if they do not   have access to the market quotations of the company debt. It is not   sufficient to substitute the book value of the debt because a) the   market interest rates may have changed, and b) the market's perception   of the risk of the loan may have changed since the debt was issued.   Remember, the point of EV is to neutralize the different risks, and   costs of different capital structures. Buyers of controlling interests in a business use EV to compare   returns between businesses, as above. They also use the EV valuation   (or a debt free cash free valuation) to determine how much to pay for   the whole entity (not just the equity). They may want to change the   capital structure once in control. Technical considerations Data availability Unlike market capitalization, where both the market price and the   outstanding number of shares in issue are readily available and easy   to find, it is virtually impossible to calculate an EV without making   a number of adjustments to published data, including often subjective   estimations of value: In practice, EV calculations rely on reasonable estimates of the   market value of these components. For example, in many professional   valuations: Avoiding temporal mismatches When using valuation multiples such as EV/EBITDA and EV/EBIT, the   numerator should correspond to the denominator. The EV should,   therefore, correspond to the market value of the assets that were used   to generate the profits in question, excluding assets acquired (and   including assets disposed) during a different financial reporting   period. This requires restating EV for any mergers and acquisitions   (whether paid in cash or equity), significant capital investments or   significant changes in working capital occurring after or during the   reporting period being examined. Ideally, multiples should be   calculated using the market value of the weighted average capital   employed of the company during the comparable financial period. When calculating multiples over different time periods (e.g. historic   multiples vs forward multiples), EV should be adjusted to reflect the   weighted average invested capital of the company in each period. In your question, you stated: The Market Cap is driven by the share price and the share price is   determined by buyers and sellers who have access to data on cash and   debts and factor that into their decision to buy or sell. Note the first point under \"\"Technical Considerations\"\" there and you will see that the \"\"access to data on cash and debts\"\" isn't quite accurate here so that is worth noting. As for alternatives, there are many other price ratios one could use such as price/earnings, price/book value, price/sales and others depending on how one wants to model the company. The better question is what kind of investing strategy is one wanting to use where there are probably hundreds of strategies at least. Let's take Apple as an example. Back on April 23, 2014 they announced earnings through March 29, 2014 which is nearly a month old when it was announced. Now a month later, one would have to estimate what changes would be made to things there. Thus, getting accurate real-time values isn't realistic. Discounted Cash Flow is another approach one can take of valuing a company in terms of its future earnings computed back to a present day lump sum.\"",
      "\"Wow that's pretty bad with the passwords.  I do have an account there which had my basic website up there but just with their default URL which is when I noticed how much facebook hated that and I hadn't gone through the process of connecting my domain name.  I would have done more research if it was one that took payments or customer info but it's more of a hub for my work and the platforms I'm on so there wasn't that risk so I stuck it up there as a temporary measure, but it doens't seem like it is too good a one by the sounds for the long term.  I also asked about this on r/webdev and I studied both buyshared and AWS (taking advantage of the \"\"free\"\" year) and I have now but the website on AWS (it took forever to work it out adn connect the domain but it is finally done now).\"",
      "\"I must be part of the lower class then, for I will never have enough resources to incur such taxes.  I receive so little (despite making two to three times my salary for my employer) that I qualify for many low-income services.  From here, even your \"\"upper middle class\"\" are moneyed elite.  Any fault in how I sound can be attributed to my lack of skill in expression.  After being soundly beaten by the *tetsubo* of a malformed labor market (wielded by an invisible hand, no less) I know intimately its every spike and rivet.\"",
      "I'm attacking because you have put more time and energy into defending  whole foods than most people put into defending their families.  You aren't merely checking your inbox, you are specifically answering THIS THREAD, and doing so within a few minutes of the post being made.  That's a lot of dedication to a brand.  As far as you now saying that it's the difference between a horror movie or an arthouse movie, you don't act that way.  I've never felt the need to defend my media choices by camping on the inbox.  I've never been personally insulted that someone doesn't like my media choices, nor have I ever insulted other types of movies.    Honestly, other than shilling, there's no other explanation for exactly why you're taking this all so personally.  Or why you feel the need to answer every person who says something bad about WF.  Or why you can always more or less stay on a set of talking points no matter what.    So I'll shill as well /r/hailcorporate!"
    ],
    "relevance_map": {
      "0": 1,
      "1": 0,
      "2": 1,
      "3": 1,
      "4": 1,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "query_7",
    "num_docs": 10
  },
  {
    "query": "Has anyone compared an in-person Tax Advisor to software like Turbo Tax?",
    "docs": [
      "The are a couple of explanations that I can think of; though for determining exactly what is different you will want to print out both returns and compare them line by line to see how they differ. If the company grossed up your income to account for the taxes on housing (possibly by paying the additional withholding), you may be just benefiting from them estimating your tax rate. This can especially be the case if your only work was the three month internship. They would have to assume your salary was for the entire year. There is an earned income tax credit for low wage earners that you may have qualified for (it would depend your specific circumstances if you meet the criteria). But that credit for a range of income actually pays out more the more you earn (to encourage working that extra hour instead of reducing benefit because you had another hour of employment). As for the housing subsidy itself, while the value is quite high the IRS considers that to be a taxable benefit that the employer provided you and so it needs to be added to your W-2 wages. $8k a month seems quite high, but I don't know the quality of the apartment you were provided and what the going rates are in the area. Given that you said you worked for a major tech company, I can imagine that you might have been working in an area with high rents. If the employer did gross up your paycheck so as to cover your taxes, that $24k would also include that extra tax payment (e.g. if the employer paid $8k in additional taxes for you, then the housing cost that they directly paid were $16k).",
      "Banks can't simply make loans in the void. This is how the cash flow works, generally:  1. Depositers *add* cash into the bank. The Bank now has cash. 10% of that cash is held on *reserve* per law. This cash is held on the balance sheet as an *asset* (cash) *and a liability* (demand deposits).   2. Someone requests a loan. The loan is funded from the non-reserved cash of these deposits. This results in a lessening of an asset (cash), and the creation of a new asset (loan).  3. Traditionally, as the debtor pays back the loan, the interest is distributed in some sort of split between the bank and the depositors. This means cash in from the loan and interest, and a liability (deposits) also go up.  4. Alternatively, while the above still happens, the bank can *securitize* the loan and sell that to investors. Investors then get access to the loan and its income, and the bank collects a fee. However, this means more cash on hand for the bank to originate additional loans without going near the reserve requirement.   If a bank extends too many loans and its reserve is threatened, it must borrow either from the fed or from other banks. These loans must be paid back.",
      "If you have complicated taxes (own a business, many houses, you are self employed, you are a contractor, etc etc) a person can make the most of your situation. If you are a w-2 single job, maybe with a family, the programs are going to be so close to spot on that the extra fees aren't worth it. I would never bother using HR Block or Liberty or those tax places that pop up.  Use the software, or in my state sometimes municipalities put on tax help days at the library to assist in filling out the forms. If you have tough taxes, get a dedicated professional based on at least a few recommendations.",
      "I have fairly simple tax returns and my experience was that TurboTax software produced roughly the same result as human accountant and costs much less. The accountant was never able to find any deductions that the program couldn't find.  Of course, if you have business, etc. you probably need an accountant to help you navigate all the rules, requirements, etc. But for simple enough cases I found that the additional pay is not justified.",
      "I did my own taxes previously using both H&R Block Tax Cut and TurboTax.  When I had a simple return and was single, it worked great.  Once I got married it was a little more complicated.  When I started a small side business, I switched to an accountant.  He does a great job of adjusting deductions between my wife and I and filing separately.  This minimizes the amount of taxes we have to pay.  It has been a few years since I used the software, but I did not see the ability to easily make adjustments like that.",
      "Generally speaking no person or program is really going to be able to help you lower your current tax burden, most tax decisions are done well before you reach the tax time. You either qualify for the deduction/credit or your don't. Where a good accountant will really be able to help you out is in planning that will limit your future tax burden. Particularly if you run a small business or are very wealthy you will probably want to consider using an accountant. I would always avoid the large scale tax prep places like HR Block they provide the same or lower quality service for a higher price than the software. I run a small business and do my own taxes using turbo tax, but my business isn't overly complex Sole prop, no employees, couple 1099's simple expenses (nothing to amortize) etc.",
      "[ACN maser brothers](http://old.post-gazette.com/world/20020524ecstasy4.asp) or they use a mlm to launder money and promise big bucks. That the owners have from dealing drugs not selling personal services. Mlm are a joke, who in their right mind would pay to work for someone that is so counter intuitive that it's not even funny",
      "\"I am assuming you mean derivatives such as speeders, sprinters, turbo's or factors when you say \"\"derivatives\"\". These derivatives are rather popular in European markets. In such derivatives, a bank borrows the leverage to you, and depending on the leverage factor you may own between 50% to +-3% of the underlying value. The main catch with such derivatives from stocks as opposed to owning the stock itself are: Counterpart risk: The bank could go bankrupt in which case the derivatives will lose all their value even if the underlying stock is sound. Or the bank could decide to phase out the certificate forcing you to sell in an undesirable situation. Spread costs: The bank will sell and buy the certificate at a spread price to ensure it always makes a profit. The spread can be 1, 5, or even 10 pips, which can translate to a the bank taking up to 10% of your profits on the spread.  Price complexity: The bank buys and sells the (long) certificate at a price that is proportional to the price of the underlying value, but it usually does so in a rather complex way. If the share rises by €1, the (long) certificate will also rise, but not by €1, often not even by leverage * €1.  The factors that go into determining the price are  are normally documented in the prospectus of the certificate but that may be hard to find on the internet. Furthermore the bank often makes the calculation complex on purpose to dissimulate commissions or other kickbacks to itself in it's certificate prices.  Double Commissions: You will have to pay your broker the commission costs for buying the certificate. However, the bank that issues the derivative certificate normally makes you pay the commission costs they incur by hiding them in the price of the certificate by reducing your effective leverage. In effect you pay commissions twice, once directly for buying the derivative, and once to the bank to allow it to buy the stock.  So as Havoc P says, there is no free lunch. The bank makes you pay for the convenience of providing you the leverage in several ways. As an alternative, futures can also give you leverage, but they have different downsides such as margin requirements. However, even with all the all the drawbacks of such derivative certificates, I think that they have enough benefits to be useful for short term investments or speculation.\"",
      "If you are able to buy a 150K home for 50K now that would be a good deal!  However, you can't you have to borrow 100K in order to make this deal happen.  This dramatically increases the risk of any investment, and I would no longer classify it as passive income.   The mortgage on a 150K place would be about 710/month (30 year fixed).  Reasonably I would expect no more than 1200/month in rent, or 14,400.  A good rule of thumb is to assume that half of rental revenue can be counted as profit before debt service.  So in your case 7200, but you would have a mortgage payment of 473/month.  Leaving you a profit of 1524 after debt service.  This is suspiciously like 2K per year.  Things, in the financial world, tend to move toward an equilibrium. The benefit of rental property you can make a lot more than the numbers suggest.  For example the home could increase in value, and you can have fewer than expected repairs.  So you have two ways to profit:  rental revenue and asset appreciation. However, you said that you needed passive income.  What happens if you have a vacancy or the tenant does not pay?  What happens if you have greater than expected repairs?  What happens if you get a fine from the HOA or a special assessment?  Not only will you have dip into your pocket to cover the payment, you might also have to dip into your pocket to cover the actual event! In a way this would be no different than if you borrowed 100K to buy dividend paying stocks.  If the fund/company does not pay out that month you would still have to make the loan payment.  Where does the money come from?  Your pocket.  At least dividend paying companies don't collect money from their shareholders. Yes you can make more money, but you can also lose more.  Leverage is a two edged sword and rental properties can be great if you are financial able to absorb the shocks that are normal with ownership.",
      "I've done my taxes using turbotax for years and they were not simple, Schedule C (self-employed), rental properties, ESPP, stock options, you name it. It's a lot of work and occasionally i did find bugs in TurboTax. ESPP were the biggest pain surprisingly. The hardest part is to get all the paperwork together and you'd have to do it when you hire an accountant anyway. That said this year i am using an accountant as i incorporated and it's a whole new area for me that i don't have time to research. Also in case of an audit i'd rather be represented by a pro. I think the chance of getting audited is smaller when a CPA prepares your return."
    ],
    "relevance_map": {
      "0": 0,
      "1": 0,
      "2": 1,
      "3": 1,
      "4": 1,
      "5": 1,
      "6": 0,
      "7": 0,
      "8": 0,
      "9": 1
    },
    "query_id": "query_8",
    "num_docs": 10
  },
  {
    "query": "How you make decision on a stock purchase after fundamental analysis?",
    "docs": [
      "If you are the beneficiary of an annuity, you might receive a single-sum distribution when the annuity owner dies. The amount of this death benefit might be the current cash value of the annuity or some other amount based upon contract riders that the owner purchased. The tax on death benefits depends on a number of factors. Death benefits are taxed as normal income. Unlike other investments, the named beneficiary of a non-qualified annuity does not get a step-up in tax basis to the date of death. However, that doesn't mean the beneficiary will have to pay taxes on the full amount. Because the purchaser of the annuity made the investment with after-tax dollars, only the amount attributable to investment income is taxed, but it will be taxed as ordinary income and not enjoy any special capital gains treatment. When there is a death benefit that exceeds the value of the account, that additional amount is also taxed as ordinary income.  Taxes on annuities depend on several circumstances: For more information on distribution of inherited annuities and taxes - go to Annuities HQ-- http://www.annuitieshq.com/articles/distribution-options-inherited-annuity/ they go into details that could help you even more.  One thing that Annuities HQ points out is if you take the lump sum payout, you may be pushed into a higher tax bracket.  Along with doing research I would also contact a financial advisor!",
      "Yes, your assumptions are correct. The industry realizes that the equilibrium price of product A is $10. The government decides to increase the amount of people who can access product A. They do this by subsidizing $5 of the $10 dollar cost. However the industry reacts by increasing the cost of product A by the amount of the subsidy (so product A is now priced at $15), because the industry knows people already can afford paying $10.  This is not exclusive to medicine, it is also happening with higher education. Here is a paper that examines the effect of government subsidization of college tuition. The study finds that as financial aid increased, there was a 102% correlation with the increase in the cost of tuition. http://www.nber.org/chapters/c13711.pdf",
      "Yeah, having a $1B profit is a necessity. If only we could increase company profit to $1.5B by lowering taxes, those $500M would trickle down for sure. Company execs and shareholders are just greedy enough to pocket all the profits for themselves at the current tax level, but with a lower tax level they would share the additional proceeds fairly with those on the bottom. Right now we have:  Profit - taxes = greed --&gt; nothing left for increased wages  While we could have:  Profit - (taxes / 2) &gt; greed --&gt; money left for increasing wages",
      "Micromax is a very interesting company. Their made to order chinese phones are shit, but cheap. At the most they are value for money. Which makes them a huge player in India. Combined with good marketing, somewhat acceptable after sales and some android magic, this company is raking in billions. They should really invest some of this money into R&amp;D, imho. Manufacture something at least.",
      "\"There are two types of 401(k) contributions: \"\"elective contributions,\"\" which are the part put in by the employee and \"\"nonelective contributions,\"\" which are the part put in by the company.  Elective contributions are summed across all the plans she is contributing to.  So she can contribute $18,000 minus whatever she put in her 403(b). Additionally she can contribute 20% of the net profit of the company (before the elective contributions) as nonelective contributions (these contributions must be designated as such). You will notice that the IRS document says 25%, but that's what you can do if her business is incorporated.  For a sole proprietorship, nonelective contributions  ends up being limited at 20% of profit. Additionally, the sum of these two and her contribution to her 403(b) cannot exceed $53,000. Example: line 31 of her schedule C is $30,000 and she has contributed $10,000 to her 403(b). Maximum contribution to her solo 401(k) is ($18,000 - $10,000) + 0.2 * $30,000 = $14,000 Her total contributions for the year are $10,000 from her 403(b) plus $14,000 in her solo 401(k).  This is less than $53,000 so this limit does not bind.  If she made a ton of 1099 money, her contribution maximum would follow the above until it hit $53,000 and then it would stop there. The IRS describes this in detail in Publication 560, which also has a worksheet for figuring out your maximum explicitly.  It's unpleasant reading and the worksheets are painful, but if you do it right, it will end up being as I just described it.  Using the language of that publication, hers is a \"\"qualified plan\"\" of the \"\"defined contribution\"\" variety.\"",
      "Absolutely. I actually spoke with a man from LeBatts brewery about this story, he told me that it it was sheer luck that other breweries didn't end up using the combination of a specific clarifying agent and foaming agent which caused the snottiness.  The rest of the brewing industry was also cost-cutting but through a combination of bad luck, not knowing when to stop, and a lack of testing, it was Schlitz that became a textbook example of what not to do. Today most new/changed products use test marketing to prevent this sort of nationwide debacle.",
      "The degrees to which a positive is positive and a negative is negative are up to you.  There is no correct answer. A couple points of caution:",
      "&gt;While I agree that luck has something to do with it, most of the successful business owners also put in crazy long hours and submitted themselves to huge financial risk in order to get their businesses started.  So do many of the failures.  &gt;Edit: some people are interpreting this to say that only successful business owners work hard. This is not what I am saying.  ...any longer.",
      "I went to Sears on Dec 22nd because it's very close to my house. I just wanted to get a few toys for my nieces/nephews.  Their toy section was smaller than the one at CVS/Walgreens.  What the fuck kind of department store doesn't carry toys.   They had less than 20 different items.",
      "It's not that Millennials *can't* get a summer job, it's that that the perceived ROI on an hourly basis of going to college is higher than the minimum wage they would receive at those jobs.   The earning power of a bachelors degree is about $23k per year ($51.2k - $27.9k average salary for those w/ and w/o degrees). By taking classes over the summer and finishing 48 weeks early, one can make an additional $21.5k with a college degree. Meanwhile, one who works for those same 48 weeks at the federal minimum wage could expect to make $13.9k. And if you're not pursuing a degree then it's not really a summer job anymore.  This basic economics explains why many people have chosen to forego the summer job. I know there are many exceptions, such as places with higher local minimum wages and degrees that earn less but this is macro economics we're talking about and the basic math checks out."
    ],
    "relevance_map": {
      "0": 0,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 1,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "query_9",
    "num_docs": 10
  }
]