[
  {
    "query": "rapamycin",
    "docs": [
      "Over the last several years, new evidence has kept pouring in about the remarkable effect of caloric restriction (CR) on the conspicuous bedfellows- aging and cancer. Through the use of various animal models, it is now well established that by reducing calorie intake one can not only increase life span but, also, lower the risk of various age related diseases such as cancer. Cancer cells are believed to be more dependent on glycolysis for their energy requirements than normal cells and, therefore, can be easily targeted by alteration in the energy-metabolic pathways, a hallmark of CR. Apart from inhibiting the growth of transplantable tumors, CR has been also shown to inhibit the development of spontaneous, radiation, and chemically induced tumors. The question regarding the potentiality of the anti-tumor effect of CR in humans has been in part answered by the resistance of a cohort of women, who had suffered from anorexia in their early life, to breast cancer. However, human research on the beneficial effect of CR is still at an early stage and needs further validation. Though the complete mechanism of the anti-tumor effect of CR is far from clear, the plausible involvement of nutrient sensing pathways or IGF-1 pathways proposed for its anti-aging action cannot be overruled. In fact, cancer cell lines, mutant for proteins involved in IGF-1 pathways, failed to respond to CR. In addition, CR decreases the levels of many growth factors, anabolic hormones, inflammatory cytokines, and oxidative markers that are deregulated in several cancers. In this review, we discuss the anti-tumor effect of CR, describing experiments done in vitro in tumor models and in vivo in mouse models in which the tumor was induced by means of radiation or chemical exposure, expressing oncogenes or deleting tumor suppression genes. We also discuss the proposed mechanisms of CR anti-tumor action. Lastly, we argue the necessity of gene expression studies in cancerous versus normal cells upon CR.",
      "Diabetes mellitus is characterized by hyperglycemia and associated with aberrations in the metabolism of carbohydrate, protein, and lipid that result in development of secondary complications. Extensive studies have indicated that nutritional therapy plays a pivotal role in the controlling or postponing of development of these secondary complications. Several functional foods have been shown to possess hypoglycemic and hypolipidemic properties. Flax seed (FS) is a functional food that is rich in omega 3 fatty acids and antioxidants and is low in carbohydrates. In exploratory studies, FS was incorporated in recipes, which resulted in a reduction in the glycemic index of the food items. These observations prompted us to investigate the efficacy of FS supplementation in type 2 diabetics (n = 29). Subjects were assigned to the experimental (n = 18) or the control group (n = 11) on the basis of their desire to participate in the study. The experimental group's diet was supplemented daily with 10 g of FS powder for a period of 1 month. The control group received no supplementation or placebo. During the study, diet and drug intake of the subjects remained unaltered. The efficacy of supplementation with FS was evaluated through a battery of clinico-biochemical parameters. Supplementation with FS reduced fasting blood glucose by 19.7% and glycated hemoglobin by 15.6%. A favorable reduction in total cholesterol (14.3%), triglycerides (17.5%), low-density lipoprotein cholesterol (21.8%), and apolipoprotein B and an increase in high-density lipoprotein cholesterol (11.9%) were also noticed. These observations suggest the therapeutic potential of FS in the management of diabetes mellitus.",
      "Humans have evolved with oral exposure to dietary microparticles and nanoparticles as a normal occurrence but the ever-growing exploitation of nanotechnology is likely to increase exposure further, both qualitatively and quantitatively. Moreover, unlike the situation with respirable particles, relatively little is known about gastrointestinal intake and handling of nanoparticles. With a long term interest in gut exposure and responses to dietary microparticles, our group is now applying its expertise to nanoparticles in the gastrointestinal tract. Here we aim to address (i) the current challenges associated with the characterisation of particle-host or particle-cell interactions, (ii) the origin and mechanisms of uptake of particles in the gastrointestinal tract, especially via the Peyer's patch and (iii) potential cellular effects of nanoparticles in the generation of reactive oxygen species and inflammasome activation, or microparticles in their adjuvant activity in pro-inflammatory signalling and immune responsiveness. Copyright 2010 Elsevier Ltd. All rights reserved.",
      "Dietary restriction (DR) without malnutrition is widely regarded to be a universal mechanism for prolonging lifespan. It is generally believed that the benefits of DR arise from eating fewer calories (termed caloric restriction, CR). Here we argue that, rather than calories, the key determinant of the relationship between diet and longevity is the balance of protein to non-protein energy ingested. This ratio affects not only lifespan, but also total energy intake, metabolism, immunity and the likelihood of developing obesity and associated metabolic disorders. Among various possible mechanisms linking macronutrient balance to lifespan, the nexus between the TOR and AMPK signaling pathways is emerging as a central coordinator.",
      "Dietary restriction (DR) and reduced growth factor signaling both elevate resistance to oxidative stress, reduce macromolecular damage, and increase lifespan in model organisms. In rodents, both DR and decreased growth factor signaling reduce the incidence of tumors and slow down cognitive decline and aging. DR reduces cancer and cardiovascular disease and mortality in monkeys, and reduces metabolic traits associated with diabetes, cardiovascular disease and cancer in humans. Neoplasias and diabetes are also rare in humans with loss of function mutations in the growth hormone receptor. DR and reduced growth factor signaling may thus slow aging by similar, evolutionarily conserved, mechanisms. We review these conserved anti-aging pathways in model organisms, discuss their link to disease prevention in mammals, and consider the negative side effects that might hinder interventions intended to extend healthy lifespan in humans.",
      "OBJECTIVE: We investigated the relation between plasma carotenoids, retinol and tocopherol levels and ovarian cancer risk in Korean women. DESIGN: Hospital-based case-control study. SETTING: Six tertiary medical institutes in Korea. POPULATION: Forty-five epithelial ovarian cancers and 135 age-matched controls. METHODS: Preoperative plasma concentrations of beta-carotene, lycopene, zeaxanthin plus lutein, retinol, alpha-tocopherol, and gamma-tocopherol were measured by reverse-phase, gradient high-pressure liquid chromatography. MAIN OUTCOME MEASURES: Odds ratios (OR) and 95% confidence intervals (95%CI) were estimated by tertiles to evaluate the effect of micronutrients on endometrial cancer risk after adjustment for body mass (BMI) index, menopause, parity, oral contraceptive use, smoking status, and alcohol consumption status. RESULTS: Women in the highest tertile for beta-carotene had 0.12-times the risk of ovarian cancer of in the lowest tertile (OR 0.12; 95%CI 0.04-0.36). Women with the highest tertiles of lycopene (OR 0.09; 95%CI 0.03-0.32), zeaxanthin/lutein (OR 0.21; 95%CI 0.09-0.52), retinol (OR 0.45; 95%CI 0.21-0.98), alpha-tocopherol (OR 0.23; 95%CI 0.10-0.53) and gamma-tocopherol (OR 0.28; 95%CI 0.11-0.70) had lower risk of ovarian cancer than women in the lowest tertiles. Results were consistent across strata of socio-epidemiologic factors. CONCLUSIONS: Micronutrients, specifically ss-carotene, lycopene, zeaxanthin, lutein, retinol, alpha-tocopherol, and gamma-tocopherol, may play a role in reducing the risk of ovarian cancer.",
      "Most cases of male prepubertal gynecomastia are classified as idiopathic. We investigated possible causes of gynecomastia in three prepubertal boys who were otherwise healthy and had normal serum concentrations of endogenous steroids. In all three boys, gynecomastia coincided with the topical application of products that contained lavender and tea tree oils. Gynecomastia resolved in each patient shortly after the use of products containing these oils was discontinued. Furthermore, studies in human cell lines indicated that the two oils had estrogenic and antiandrogenic activities. We conclude that repeated topical exposure to lavender and tea tree oils probably caused prepubertal gynecomastia in these boys. 2007 Massachusetts Medical Society",
      "Diet is purported to be means of exposure to many environmental contaminants. The purpose of this study is to understand the influence of dietary change on the levels of exposure to several environmental chemicals - in particular, antibiotics and phthalates. For this purpose, we examined the extent to which short-term changes in diet influenced the inadvertent exposure levels to these chemicals in an adult population. We recruited participants (n=25) of a five-day 'Temple Stay' program in Korea and collected urine samples before and after the program. We also conducted a questionnaire survey on participants' dietary patterns prior to their participation. During the program, participants followed the daily routines of Buddhist monks and maintained a vegetarian diet. Urinary levels of three antibiotics and their major metabolites, metabolites of four major phthalates, and malondialdehyde (MDA) as an oxidative stress biomarker were analyzed. The frequency and levels of detection for antibiotics and phthalates noticeably decreased during the program. Urinary MDA levels were significantly lower than before program participation (0.16 versus 0.27mg/g creatinine). Although the exposure to target compounds might be influenced by other behavioral patterns, these results suggest that even short-term changes in dietary behavior may significantly decrease inadvertent exposure to antibiotics and phthalates and hence may reduce oxidative stress levels. Copyright 2010 Elsevier Inc. All rights reserved.",
      "The US market for organic foods has grown from $3.5 billion in 1996 to $28.6 billion in 2010, according to the Organic Trade Association. Organic products are now sold in specialty stores and conventional supermarkets. Organic products contain numerous marketing claims and terms, only some of which are standardized and regulated. In terms of health advantages, organic diets have been convincingly demonstrated to expose consumers to fewer pesticides associated with human disease. Organic farming has been demonstrated to have less environmental impact than conventional approaches. However, current evidence does not support any meaningful nutritional benefits or deficits from eating organic compared with conventionally grown foods, and there are no well-powered human studies that directly demonstrate health benefits or disease protection as a result of consuming an organic diet. Studies also have not demonstrated any detrimental or disease-promoting effects from an organic diet. Although organic foods regularly command a significant price premium, well-designed farming studies demonstrate that costs can be competitive and yields comparable to those of conventional farming techniques. Pediatricians should incorporate this evidence when discussing the health and environmental impact of organic foods and organic farming while continuing to encourage all patients and their families to attain optimal nutrition and dietary variety consistent with the US Department of Agriculture's MyPlate recommendations. This clinical report reviews the health and environmental issues related to organic food production and consumption. It defines the term \"organic,\" reviews organic food-labeling standards, describes organic and conventional farming practices, and explores the cost and environmental implications of organic production techniques. It examines the evidence available on nutritional quality and production contaminants in conventionally produced and organic foods. Finally, this report provides guidance for pediatricians to assist them in advising their patients regarding organic and conventionally produced food choices.",
      "OBJECTIVE: Cocaine-related cues have been hypothesized to perpetuate drug abuse by inducing a craving response that prompts drug-seeking behavior. However, the mechanisms, underlying neuroanatomy, and specificity of this neuroanatomy are not yet fully understood. METHOD: To address these issues, experienced cocaine users (N=17) and comparison subjects (N=14) underwent functional magnetic resonance imaging while viewing three separate films that portrayed 1 ) individuals smoking crack cocaine, 2) outdoor nature scenes, and 3) explicit sexual content. Candidate craving sites were identified as those that showed significant activation in the cocaine users when viewing the cocaine film. These sites were then required to show significantly greater activation when contrasted with comparison subjects viewing the cocaine film (population specificity) and cocaine users viewing the nature film (content specificity). RESULTS: Brain regions that satisfied these criteria were largely left lateralized and included the frontal lobe (medial and middle frontal gyri, bilateral inferior frontal gyrus), parietal lobe (bilateral inferior parietal lobule), insula, and limbic lobe (anterior and posterior cingulate gyrus). Of the 13 regions identified as putative craving sites, just three (anterior cingulate, right inferior parietal lobule, and the caudate/lateral dorsal nucleus) showed significantly greater activation during the cocaine film than during the sex film in the cocaine users, which suggests that cocaine cues activated similar neuroanatomical substrates as naturally evocative stimuli in the cocaine users. Finally, contrary to the effects of the cocaine film, cocaine users showed a smaller response than the comparison subjects to the sex film. CONCLUSIONS: These data suggest that cocaine craving is not associated with a dedicated and unique neuroanatomical circuitry; instead, unique to the cocaine user is the ability of learned, drug-related cues to produce brain activation comparable to that seen with nondrug evocative stimuli in healthy comparison subjects."
    ],
    "relevance_map": {
      "0": 1,
      "1": 0,
      "2": 0,
      "3": 1,
      "4": 1,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "query_0"
  },
  {
    "query": "Zoloft",
    "docs": [
      "A correlation between national pig-meat consumption and mortality rates from chronic liver disease (CLD) across developed countries was reported in 1985. One possible mechanism explaining this may be hepatitis E infection spread via pig meat. We aimed to re-examine the original association in more recent international data. Regression models were used to estimate associations between national pig-meat consumption and CLD mortality, adjusting for confounders. Data on CLD mortality, alcohol consumption, hepatitis B virus (HBV) and hepatitis C virus (HCV) seroprevalence for 18 developed countries (1990-2000) were obtained from WHO databases. Data on national pig-meat and beef consumption were obtained from the UN database. Univariate regression showed that alcohol and pig-meat consumption were associated with mortality from CLD, but beef consumption, HBV and HCV seroprevalence were not. A 1 litre per capita increase in alcohol consumption was associated with an increase in mortality from CLD in excess of 1.6 deaths/100,000 population. A 10 kg higher national annual average per capita consumption of pork meat was associated with an increase in mortality from CLD of between 4 and 5 deaths/100,000 population. Multivariate regression showed that alcohol, pig-meat consumption and HBV seroprevalence were independently associated with mortality from CLD, but HCV seroprevalence was not. Pig-meat consumption remained independently associated with mortality from CLD in developed countries in the 1990-2000 period. Further work is needed to establish the mechanism.",
      "The first four reviews in this series (Steinberg, D. 2004. J. Lipid Res. 45: 1583-1593; Steinberg, D. 2005. J. Lipid Res. 46: 179-190; Steinberg, D. 2005. J. Lipid Res. 46: 2037-2051; Steinberg, D. 2006. J. Lipid Res. 47: 1-14) traced the gradual accumulation of evidence, evidence of several different kinds, supporting the lipid hypothesis. They tracked the history from Anitschkow's 1913 classic work on the cholesterol-fed rabbit model to the breakthrough 1984 Coronary Primary Prevention Trial, the first large, randomized, double-blind primary intervention trial showing that decreasing blood cholesterol (using cholestyramine) significantly reduces coronary heart disease events. At that point, for the first time, decreasing blood cholesterol levels became an official national public health goal. Still, only a small fraction of patients at high risk were getting appropriate cholesterol-lowering treatment, and a number of important clinical questions remained unanswered. This final review in the series traces the early studies that led to the discovery of the statins and briefly reviews the now familiar large-scale clinical trials demonstrating their safety and their remarkable effectiveness in reducing coronary heart disease morbidity and mortality.",
      "This paper documents the recent (1976-1995) literature on the acute mood effects associated with participation in single sessions of exercise. Issues regarding experimental design, \"ecological validity' and the operational definition of mood are addressed. Results from these studies suggest that both clinical and nonclinical subjects may benefit acutely from even a single bout of exercise. Finally, possible mechanisms and recommendations for future research are discussed.",
      "BACKGROUND AND AIMS: Nut intake has been inversely related to body mass index (BMI) in prospective studies. We examined dietary determinants of adiposity in an elderly Mediterranean population with customarily high nut consumption. METHODS AND RESULTS: A cross-sectional study was conducted in 847 subjects (56% women, mean age 67 years, BMI 29.7kg/m(2)) at high cardiovascular risk recruited into the PREDIMED study. Food consumption was evaluated by a validated semi-quantitative questionnaire, energy expenditure in physical activity by the Minnesota Leisure Time Activity questionnaire, and anthropometric variables by standard measurements. Nut intake decreased across quintiles of both BMI and waist circumference (P-trend <0.005; both). Alcohol ingestion was inversely related to BMI (P-trend=0.020) and directly to waist (P-trend=0.011), while meat intake was directly associated with waist circumference (P-trend=0.018). In fully adjusted multivariable models, independent dietary associations of BMI were the intake of nuts inversely (P=0.002) and that of meat and meat products directly (P=0.042). For waist circumference, independent dietary associations were intake of nuts (P=0.002) and vegetables (P=0.040), both inversely, and intake of meat and meat products directly (P=0.009). From the regression coefficients, it was predicted that BMI and waist circumference decreased by 0.78kg/m(2) and 2.1cm, respectively, for each serving of 30g of nuts. Results were similar in men and women. CONCLUSION: Nut consumption was inversely associated with adiposity independently of other lifestyle variables. It remains to be explored whether residual confounding related to a healthier lifestyle of nut eaters might in part explain these results. Copyright © 2009 Elsevier B.V. All rights reserved.",
      "BACKGROUND: Allergic reactions to food can be produced by contaminants that induce sensitization. Among these, Anisakis simplex can cause seafood infestation, and allergic symptoms (urticaria-angioedema, anaphylaxis, and asthma) can follow the eating or handling of affected fish. Although seafood is the principal source of human infections by this parasite, we have found allergic symptoms in 8 patients previously diagnosed as having A simplex sensitization after they ate chicken meat. Chicken feed usually has a high proportion of fishmeal, which might possibly be contaminated by this nematode. OBJECTIVE: The aim of our study was to determine whether parasite proteins present in chicken meat could be responsible for the symptoms reported by these subjects. METHODS: We carried out in vivo tests (prick, bronchial challenge, and double-blind placebo-controlled challenge with meat chicken) in these 8 patients. We performed immunoblotting using the sera from the 8 patients and controls in order to detect A simplex sensitization. We also investigated the presence of A simplex proteins in sera from chickens fed with fishmeal and in other sera from chickens fed only with cereals. We excluded sensitization to other chicken nematodes by serologic methods. RESULTS: All 8 patients presented positive prick and challenges to A simplex. When we used serum from chickens fed with fishmeal as the antigen in blotting, patients 3, 4, 5, 6, 7, and 8 recognized a band of 16 kd, also obtained when using pools of fish-shellfish and A simplex larva. No detection was observed with sera from chickens fed with only cereals. CONCLUSION: We provide evidence, based on in vivo and in vitro tests, that subjects highly sensitized to A simplex can detect the presence of Anisakis species allergens in chicken meat.",
      "The aim of this study was to estimate the dietary cadmium (Cd) intake of the Belgian adult population, to compare this dietary Cd exposure to the tolerable weekly intake (TWI) recently established by the European Food Safety Authority (EFSA) and to determine the major food groups that contribute to dietary Cd exposure in Belgium. Food consumption data were derived from the 2004 Belgian food consumption survey (two 24 h recalls, 3083 participants). Cadmium concentrations in food items (n = 4000) were gathered from the control program of the Belgian Federal Agency for the Safety of the Food Chain for the period 2006-2008. Dietary intake per individual was calculated from consumption data and median Cd concentrations. The population mean, median and 95th percentile of the dietary intake values were 0.98, 0.85 and 2.02 µg kg⁻¹ body weight per week respectively. Two percent of the Belgian adult population has a dietary Cd intake above the recent TWI of 2.5 µg kg⁻¹ body weight established by EFSA in 2009. Cereal products and potatoes contribute for more than 60% to Cd intake.",
      "OBJECTIVES: Atherosclerosis can obstruct branching arteries of the abdominal aorta, including four paired lumbar arteries and the middle sacral artery that feed the lumbar spine. The diminished blood flow could result in various back problems. The aim of this systematic literature review was to assess associations between atherosclerosis and disc degeneration (DD) or low-back pain (LBP). DATA SOURCES: A systematic search of the Medline/PubMed database for all original articles on atherosclerosis and DD/LBP published until October 2008. The search was performed with the medical subject headings atherosclerosis, cardiovascular risk factor, or vascular disease and keywords \"disc degeneration\", \"disc herniation\", and \"back pain\" on the basis of MeSH tree and as a text search. In addition reference lists were studied and searched manually. Observational studies investigating the association of atherosclerosis or its risk factors and lumbar DD/LBP were selected. REVIEW METHODS: The following data were extracted: study characteristics, duration of follow-up, year of publication, findings of atherosclerosis/cardiovascular risk factors and DD/LBP. Disc herniation was regarded as a form of disc degeneration and cardiovascular risk factors were regarded as surrogate for atherosclerosis in epidemiological studies. RESULTS: One hundred and seventy-nine papers were identified. After exclusion of case reports, letters, editorials, papers not related to the lumbar spine, and animal studies, 25 papers were included. Post-mortem studies showed an association between atheromatous lesions in the aorta and DD, as well as between occluded lumbar arteries and life-time LBP. In clinical studies, aortic calcification was associated with LBP, and stenosis of lumbar arteries was associated with both DD and LBP. In epidemiological studies, smoking and high serum cholesterol levels were found to have the most consistent associations with DD and LBP. CONCLUSION: Aortic atherosclerosis and stenosis of the feeding arteries of the lumbar spine were associated with DD and LBP. Cardiovascular risk factors had weaker associations, being clearly apparent only in cohorts on elderly people or in large study samples. More prospective clinical studies are needed to further clarify the association of atherosclerosis and low-back disorders.",
      "We assessed the relation of risk factors for cardiovascular disease to early atherosclerotic lesions in the aorta and coronary arteries in 35 persons (mean age at death, 18 years). Aortic involvement with fatty streaks was greater in blacks than in whites (37 vs. 17 percent, P less than 0.01). However, aortic fatty streaks were strongly related to antemortem levels of both total and low-density lipoprotein cholesterol (r = 0.67, P less than 0.0001 for each association), independently of race, sex, and age, and were inversely correlated with the ratio of high-density lipoprotein cholesterol to low-density plus very-low-density lipoprotein cholesterol (r = -0.35, P = 0.06). Coronary-artery fatty streaks were correlated with very-low-density lipoprotein cholesterol (r = 0.41, P = 0.04). Mean systolic blood-pressure levels also tended to be higher in the four subjects with coronary-artery fibrous plaques than in those without them: 112 mm Hg as compared with 104 (P = 0.09). These results document the importance of risk-factor levels to early anatomical changes in the aorta and coronary arteries. The progression of fatty streaks to fibrous plaques is uncertain, but these data suggest that a rational approach to the prevention of cardiovascular disease should begin early in life.",
      "BACKGROUND: The objective of this study was to determine the association between regular physical activity and mental disorders among adults in the United States. METHODS: Multiple logistic regression analyses were used to compare the prevalence of mental disorders among those who did and did not report regular physical activity using data from the National Comorbidity Survey (n = 8098), a nationally representative sample of adults ages 15-54 in the United States. CONCLUSIONS: Slightly over one-half of adults reported regular physical activity (60.3%). Regular physical activity was associated with a significantly decreased prevalence of current major depression and anxiety disorders, but was not significantly associated with other affective, substance use, or psychotic disorders. The association between regular physical activity and lower prevalence of current major depression (OR = 0.75 (0.6,0.94)), panic attacks (OR = 0.73 (0.56, 0.96)), social phobia (OR = 0.65 (0.53, 0.8)), specific phobia (OR = 0.78 (0.63, 0.97)), and agoraphobia (OR = 0.64 (0.43, 0.94)) persisted after adjusting for differences in sociodemographic characteristics, self-reported physical disorders, and comorbid mental disorders. Self-reported frequency of physical activity also showed a dose-response relation with current mental disorders. DISCUSSION: These data document a negative association between regular physical activity and depressive and anxiety disorders among adults in the U.S. population. Future research that investigates the mechanism of this association using longitudinal data to examine the link between physical activity and incident and recurrent mental disorders across the lifespan is needed.",
      "BACKGROUND: Previous observational and interventional studies have suggested that regular physical exercise may be associated with reduced symptoms of depression. However, the extent to which exercise training may reduce depressive symptoms in older patients with major depressive disorder (MDD) has not been systematically evaluated. OBJECTIVE: To assess the effectiveness of an aerobic exercise program compared with standard medication (ie, antidepressants) for treatment of MDD in older patients, we conducted a 16-week randomized controlled trial. METHODS: One hundred fifty-six men and women with MDD (age, > or = 50 years) were assigned randomly to a program of aerobic exercise, antidepressants (sertraline hydrochloride), or combined exercise and medication. Subjects underwent comprehensive evaluations of depression, including the presence and severity of MDD using Diagnostic and Statistical Manual of Mental Disorders, Fourth Edition criteria and Hamilton Rating Scale for Depression (HAM-D) and Beck Depression Inventory (BDI) scores before and after treatment. Secondary outcome measures included aerobic capacity, life satisfaction, self-esteem, anxiety, and dysfunctional cognitions. RESULTS: After 16 weeks of treatment, the groups did not differ statistically on HAM-D or BDI scores (P = .67); adjustment for baseline levels of depression yielded an essentially identical result. Growth curve models revealed that all groups exhibited statistically and clinically significant reductions on HAM-D and BDI scores. However, patients receiving medication alone exhibited the fastest initial response; among patients receiving combination therapy, those with less severe depressive symptoms initially showed a more rapid response than those with initially more severe depressive symptoms. CONCLUSIONS: An exercise training program may be considered an alternative to antidepressants for treatment of depression in older persons. Although antidepressants may facilitate a more rapid initial therapeutic response than exercise, after 16 weeks of treatment exercise was equally effective in reducing depression among patients with MDD."
    ],
    "relevance_map": {
      "0": 0,
      "1": 0,
      "2": 1,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 1,
      "9": 1
    },
    "query_id": "query_1"
  },
  {
    "query": "How Citrus Might Help Keep Your Hands Warm",
    "docs": [
      "The definition of cervical neoplasia as a sexually determined disease caused by some types of human papillomavirus has been widely accepted. Recent epidemiologic studies, however, have failed to identify a correlation between sexual activity and human papillomavirus infection. Moreover, sexual activity has also been shown to be independent of human papillomavirus infection in increasing cervical cancer risk. These incoherences are analyzed with respect to etiologic models for cervical neoplasia and by considering the role of misclassification of human papillomavirus infection in interpreting the relations assumed under these models. Even small levels of misclassification can considerably distort (1) the presumed prevalence of viral infection, (2) the association between sexual activity and human papillomavirus infection, and (3) the ability to control the relation between sexual activity and cancer by human papillomavirus infection. In field surveys, the presumed rates of human papillomavirus infection based on a DNA assay such as the filter in situ hybridization may be a gross overestimation of the true viral prevalence. Use of moderately misclassified human papillomavirus infection test results for effect estimation and covariate adjustment in data analysis may seriously distort the underlying relations. Consequently, considering these conditions, the apparent incoherence of recent epidemiologic findings should not be construed as evidence against the role of human papillomavirus in the etiology of cervical cancer or the validity of the sexually transmitted disease model.",
      "Hesperetin is an aglycone of citrus flavonoids and is expected to exert a vasodilatation effect in vivo. We developed water-dispersible hesperetin by the process of micronization to enhance the bioavailability of hesperetin. This study aimed to assess the effect of this process on the bioavailability of hesperetin and to estimate its efficiency on vasodilatation-related functions using endothelial cells in vitro and a human volunteer study at a single dose in vivo. We found that water-dispersible hesperetin was absorbed rapidly, with its maximum plasma concentration (C(max)) being 10.2 ± 1.2 μM, and that the time to reach C(max), which is within 1 h if 150 mg of this preparation was orally administered in humans. LC-MS analyses of the plasma at C(max) demonstrated that hesperetin accumulated in the plasma as hesperetin 7-O-β-D-glucuronide (Hp7GA), hesperetin 3'-O-β-D-glucuronide (Hp3'GA) and hesperetin sulfate exclusively. Similar to hesperetin, Hp7GA enhanced nitric oxide (NO) release by inhibiting nicotinamide adenine dinucleotide phosphate-oxidase (NADPH oxidase) activity in a human umbilical vein endothelial cell culture system, indicating that plasma hesperetin metabolites can improve vasodilatation in the vascular system. A volunteer study using women with cold sensitivity showed that a single dose of water-dispersible hesperetin was effective on peripheral vasodilatation.These results strongly suggest that rapid accumulation with higher plasma concentration enables hesperetin to exert a potential vasodilatation effect by the endothelial action of its plasma metabolites. Water-dispersible hesperetin may be useful to improve the health effect of dietary hesperetin. This journal is © The Royal Society of Chemistry 2012",
      "OBJECTIVE: Compare levels of triglyceride (TG), total cholesterol (TC), low density lipoprotein (LDL) and high density lipoprotein (HDL) among vegetarians and omnivores. METHODS: Blood samples were collected from 76 individuals--both males and females--separated in four different diet groups: omnivores, lacto-ovo vegetarians, lacto vegetarians, and restricted vegetarians (or vegans). Dosing was done for: TC, LDL, HDL and TG. RESULTS: Significant difference was reported for TC, LDL and TG levels among the samples. Higher levels were reported by omnivores, with decreased levels for vegetarians as animal products were restricted, with lowest levels having been reported by vegans. Mean and standard deviation for TC were 208.09 +/- 49.09 mg/dl in the group of omnivores, and 141.06 +/- 30.56 mg/dl in the group of vegans (p < 0.001). LDL values for omnivores and vegans were respectively: 123.43 +/- 42.67 mg/dl and 69.28 +/- 29.53 mg/dl (p < 0.001). As for TG, those values were 155.68 +/- 119.84 mg/dl and 81.67 +/- 81.90 mg/dl (p < 0.01). As for HDL level no difference was reported between the samples, but HDL/TC ratio was significantly higher in vegans (p = 0.01). CONCLUSION: Vegetarian diet was associated to lower levels of TG, TC and LDL as compared to the diet of omnivores.",
      "CONTEXT: Few studies have evaluated the relationship between fruit and vegetable intake and cardiovascular disease. OBJECTIVE: To examine the associations between fruit and vegetable intake and ischemic stroke. DESIGN, SETTING, AND SUBJECTS: Prospective cohort studies, including 75 596 women aged 34 to 59 years in the Nurses' Health Study with 14 years of follow-up (1980-1994), and 38683 men aged 40 to 75 years in the Health Professionals' Follow-up Study with 8 years of follow-up (1986-1994). All individuals were free of cardiovascular disease, cancer, and diabetes at baseline. MAIN OUTCOME MEASURE: Incidence of ischemic stroke by quintile of fruit and vegetable intake. RESULTS: A total of 366 women and 204 men had an ischemic stroke. After controlling for standard cardiovascular risk factors, persons in the highest quintile of fruit and vegetable intake (median of 5.1 servings per day among men and 5.8 servings per day among women) had a relative risk (RR) of 0.69 (95% confidence interval [CI], 0.52-0.92) compared with those in the lowest quintile. An increment of 1 serving per day of fruits or vegetables was associated with a 6% lower risk of ischemic stroke (RR, 0.94; 95 % CI, 0.90-0.99; P =.01, test for trend). Cruciferous vegetables (RR, 0.68 for an increment of 1 serving per day; 95% CI, 0.49-0.94), green leafy vegetables (RR, 0.79; 95% CI, 0.62-0.99), citrus fruit including juice (RR, 0.81; 95% CI, 0.68-0.96), and citrus fruit juice (RR, 0.75; 95% CI, 0.61-0.93) contributed most to the apparent protective effect of total fruits and vegetables. Legumes or potatoes were not associated with lower ischemic stroke risk. The multivariate pooled RR for total stroke was 0.96 (95% CI, 0.93-1.00) for each increment of 2 servings per day. CONCLUSIONS: These data support a protective relationship between consumption of fruit and vegetables-particularly cruciferous and green leafy vegetables and citrus fruit and juice-and ischemic stroke risk.",
      "BACKGROUND: The optimal target range for blood glucose in critically ill patients remains unclear. METHODS: Within 24 hours after admission to an intensive care unit (ICU), adults who were expected to require treatment in the ICU on 3 or more consecutive days were randomly assigned to undergo either intensive glucose control, with a target blood glucose range of 81 to 108 mg per deciliter (4.5 to 6.0 mmol per liter), or conventional glucose control, with a target of 180 mg or less per deciliter (10.0 mmol or less per liter). We defined the primary end point as death from any cause within 90 days after randomization. RESULTS: Of the 6104 patients who underwent randomization, 3054 were assigned to undergo intensive control and 3050 to undergo conventional control; data with regard to the primary outcome at day 90 were available for 3010 and 3012 patients, respectively. The two groups had similar characteristics at baseline. A total of 829 patients (27.5%) in the intensive-control group and 751 (24.9%) in the conventional-control group died (odds ratio for intensive control, 1.14; 95% confidence interval, 1.02 to 1.28; P=0.02). The treatment effect did not differ significantly between operative (surgical) patients and nonoperative (medical) patients (odds ratio for death in the intensive-control group, 1.31 and 1.07, respectively; P=0.10). Severe hypoglycemia (blood glucose level, < or = 40 mg per deciliter [2.2 mmol per liter]) was reported in 206 of 3016 patients (6.8%) in the intensive-control group and 15 of 3014 (0.5%) in the conventional-control group (P<0.001). There was no significant difference between the two treatment groups in the median number of days in the ICU (P=0.84) or hospital (P=0.86) or the median number of days of mechanical ventilation (P=0.56) or renal-replacement therapy (P=0.39). CONCLUSIONS: In this large, international, randomized trial, we found that intensive glucose control increased mortality among adults in the ICU: a blood glucose target of 180 mg or less per deciliter resulted in lower mortality than did a target of 81 to 108 mg per deciliter. (ClinicalTrials.gov number, NCT00220987.) 2009 Massachusetts Medical Society",
      "This paper presents the results of an investigation on the occurrence of alkylphenols (APs) and their ethoxylates (APEs) in 8 edible marine species from the Adriatic Sea and tries to estimate the corresponding intake for the Italian population. Two crustaceans, Nephrops norvegicus (Norway lobster) and Squilla mantis (spottail mantis shrimp), plus six fish species, Engraulis enchrascicolus (anchovy), Scomber scombrus (Atlantic mackerel), Merluccius merluccius (European hake), Mullus barbatus (red mullet), Solea vulgaris (common sole) and Lophius piscatorius (angler) were analyzed for their content of nonylphenol (NP), octylphenol (OP) and octylphenol polyethoxylates (OPEs). These compounds were found in all analysed samples. NP was detected at the highest concentrations: 118-399 and 9.5-1431 ng g(-1) fresh weight (fw) respectively in crustaceans and fish. OP was found at respective levels of 2.7-4.7 and 0.3-3.8 ng g(-1) fw in crustaceans and fish, whereas OPE was determined at respective concentrations of 1.2-16.8 and 0.2-21.1 ng g(-1) fw in the same species. These results, together with those from a previous study on 4 edible mollusc, allow to estimate respective daily intakes for NP, OP, and OPE of about 12, 0.1, and 0.1 microg day(-1) for an Italian adult living along the Adriatic Coast. In relation to NP and OP, these intakes are much lower than the doses associated with toxic effects in laboratory animals (9 mg kg(-1) bw for rats). Nevertheless, data of exposure from other sources to these chemicals and others with similar biological characteristics are needed.",
      "DR (dietary restriction), or reduced food intake without malnutrition, is associated with extended longevity, improved metabolic fitness and increased stress resistance in a wide range of organisms. DR is often referred to as calorie restriction, implying that reduced energy intake is responsible for its widespread and evolutionarily conserved benefits. However, recent data indicate dietary amino acid restriction as a key mediator of DR benefits. In fruitflies, an imbalance in essential amino acid intake is thought to underlie longevity benefits of DR. In mammals, reduced dietary protein or essential amino acid intake can extend longevity, improve metabolic fitness and increase stress resistance. In the present paper we review two evolutionarily conserved signal transduction pathways responsible for sensing amino acid levels. The eIF2α (eukaryotic initiation factor 2α) kinase GCN2 (general amino acid control non-derepressible 2) senses the absence of one or more amino acids by virtue of direct binding to uncharged cognate tRNAs. The presence of certain amino acids, such as leucine, permits activation of the master growth regulating kinase TOR (target of rapamycin). These two signal transduction pathways react to amino acid deprivation by inhibiting general protein translation while at the same time increasing translation of specific mRNAs involved in restoring homoeostasis. Together, these pathways may contribute to the regulation of longevity, metabolic fitness and stress resistance.",
      "There is marked racial disparity in the incidence of monoclonal gammopathy of undetermined significance (MGUS) and multiple myeloma, with a two to threefold increased risk in blacks compared with whites. The increased risk has been seen both in Africans and African Americans. Similarly, an increased risk of monoclonal gammopathies in blacks compared with whites has been noted after adjusting for socioeconomic and other risk factors, suggesting a genetic predisposition. The higher risk of multiple myeloma in blacks is likely a result of the higher prevalence of the premalignant MGUS stage; there are no data to suggest that blacks have a higher progression rate of MGUS to myeloma. Studies are emerging that suggest the baseline cytogenetic characteristics, and progression may differ by race. In contrast, to the increased risk noted in blacks, studies suggest that the risk may be lower in certain racial and ethnic groups, notably persons from Japan and Mexico. We review the literature on racial disparity in the prevalence, pathogenesis and progression of MGUS and multiple myeloma between blacks and whites. We also discuss future directions for research that could inform management of these conditions and positively influence patient outcomes.",
      "Background We previously showed, in healthy, middle-aged, moderately overweight men, that orange juice decreases diastolic blood pressure and significantly improves postprandial microvascular endothelial reactivity and that hesperidin could be causally linked to the observed beneficial effect of orange juice. The objective was to determine the effect of chronic consumption of orange juice on the gene expression profile of leukocytes in healthy volunteers and to assess to what extent hesperidin is involved in the effect of orange juice. Methodology/Principal Findings Volunteers were included in a randomized, controlled, crossover study. Throughout three 4-week periods, volunteers consumed daily: 500 ml orange juice, 500 ml control drink plus hesperidin or 500 ml control drink and placebo. Blood samplings were performed on 10 overnight-fasted subjects after the 4-week treatment period. Global gene expression profiles were determined using human whole genome cDNA microarrays. Both orange juice and hesperidin consumption significantly affected leukocyte gene expression. Orange juice consumption induced changes in expression of, 3,422 genes, while hesperidin intake modulated the expression of 1,819 genes. Between the orange juice and hesperidin consumption groups, 1,582 regulated genes were in common. Many of these genes are implicated in chemotaxis, adhesion, infiltration and lipid transport, which is suggestive of lower recruitment and infiltration of circulating cells to vascular wall and lower lipid accumulation. Conclusions This study shows that regular consumption of orange juice for 4 weeks alters leukocyte gene expression to an anti-inflammatory and anti-atherogenic profile, and hesperidin displays a relevant role in the genomic effect of this beverage. Trial Registration ClinicalTrials.gov NCT 00983086",
      "A diet rich in fruits and vegetables is known to decrease the risk of cardiovascular disease. However, the information regarding the antithrombotic activity (antiplatelet, anticoagulant, and fibrinolytic) of fruits and vegetables is scarce. The aim of this study was to assess the antithrombotic activity of extracts from fruits and vegetables widely consumed in central Chile. The study included samples of 19 fruits and 26 vegetables, representative of the local diet. The extracts prepared from each sample included an aqueous (juice or pressed solubles) and/or methanol-soluble fraction. The extracts were evaluated for antiplatelet, anticoagulant, and fibrinolytic activity in vitro at a final concentration of 1 mg/ml. The antiplatelet activity was assessed by platelet aggregation inhibition; anticoagulant activity was measured by the prothrombin time (PT), diluted prothrombin time (dPT), activated partial thromboplastin time (APTT), kaolin clotting time (KCT), and thrombin time. The fibrinolytic effect was determined with the euglobin clot lysis time and fibrin plate methods. Extracts of green beans and tomatoes inhibited platelet aggregation induced by ADP and arachidonic acid, in a concentration-dependent manner. The methanolic extracts of grapes prolonged the PT and dPT. Finally, extracts of raspberry prolonged the APTT and also presented fibrinolytic activity. In conclusion, from a screening that included a variety of fruits and vegetables, we found antiplatelet activity in green beans and tomatoes, anticoagulant activities in grapes and raspberries, whereas fibrinolytic activity was observed only in raspberries. Further investigations are necessary to advance in knowledge of the active compounds of these fruits and vegetables and their mechanisms of action."
    ],
    "relevance_map": {
      "0": 0,
      "1": 1,
      "2": 0,
      "3": 1,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 1,
      "9": 0
    },
    "query_id": "query_2"
  },
  {
    "query": "fava beans",
    "docs": [
      "Over the past 20 years, growing interest in the biochemistry, nutrition, and pharmacology of L-arginine has led to extensive studies to explore its nutritional and therapeutic roles in treating and preventing human metabolic disorders. Emerging evidence shows that dietary L-arginine supplementation reduces adiposity in genetically obese rats, diet-induced obese rats, finishing pigs, and obese human subjects with Type-2 diabetes mellitus. The mechanisms responsible for the beneficial effects of L-arginine are likely complex, but ultimately involve altering the balance of energy intake and expenditure in favor of fat loss or reduced growth of white adipose tissue. Recent studies indicate that L-arginine supplementation stimulates mitochondrial biogenesis and brown adipose tissue development possibly through the enhanced synthesis of cell-signaling molecules (e.g., nitric oxide, carbon monoxide, polyamines, cGMP, and cAMP) as well as the increased expression of genes that promote whole-body oxidation of energy substrates (e.g., glucose and fatty acids) Thus, L-arginine holds great promise as a safe and cost-effective nutrient to reduce adiposity, increase muscle mass, and improve the metabolic profile in animals and humans.",
      "Background Rye contains more fibre and bioactive compounds than other cereals used for bread production. The fibre and compounds of the fibre complex could provide protection against breast cancer (BC). Objective To review the evidence and theoretical background for a role of rye and some of its components in the prevention of BC. Design A short review based to a great extent on the work by scientists in the Nordic countries. Results Some of the possible mechanisms by which the fibre complex could reduce BC risk are presented. The fibre through its effect on fermentation increases esterification of bile acids reducing toxicity of the free bile acids and is involved in the production of butyrate with potential anticancer effects including BC. The fibre reduces the enterohepatic circulation of the oestrogens leading to lower plasma oestrogen concentrations. The fibre complex contains bioactive compounds such as lignans and alkylresorcinols that are antioxidative and potentially anticarcinogenic. In addition, vitamins, minerals, and phytic acid in rye may provide protection against BC. Conclusion Rye products made from wholegrain rye flour are likely to contribute to reduced BC risk.",
      "Beyond obvious functions in haemostasis and thrombosis, platelets are considered to be essential in proinflammatory surroundings such as atherosclerosis, allergy, rheumatoid arthritis and even cancer. In atherosclerosis, platelets facilitate the recruitment of inflammatory cells towards the lesion sites and release a plethora of inflammatory mediators, thereby enriching and boosting the inflammatory milieu. Platelets do so by interacting with endothelial cells, circulating leukocytes (monocytes, neutrophils, dendritic cells, T-cells) and progenitor cells. This cross-talk enforces leukocyte activation, adhesion and transmigration. Furthermore, platelets are known to function in innate host defense through the release of antimicrobial peptides and the expression of pattern recognition receptors. In severe sepsis, platelets are able to trigger the formation of neutrophil extracellular traps (NETs), which bind and clear pathogens. The present antiplatelet therapies that target key pathways of platelet activation and aggregation therefore hold the potential to modulate platelet-derived immune functions by reducing cellular interactions of platelets with other immune components and by reducing the secretion of inflammatory proteins into the milieu. The objective of this review is to update and discuss the current perceptions of the platelet immune constituents and their prospect as therapeutic targets in an atherosclerotic setting.",
      "Pharmaceuticals and personal care products are being increasingly reported in a variety of biological matrices, including fish tissue; however, screening studies have presently not encompassed broad geographical areas. A national pilot study was initiated in the United States to assess the accumulation of pharmaceuticals and personal care products in fish sampled from five effluent-dominated rivers that receive direct discharge from wastewater treatment facilities in Chicago, Illinois; Dallas, Texas; Orlando, Florida; Phoenix, Arizona; and West Chester, Pennsylvania, USA. Fish were also collected from the Gila River, New Mexico, USA, as a reference condition expected to be minimally impacted by anthropogenic influence. High performance liquid chromatography-tandem mass spectrometry analysis of pharmaceuticals revealed the presence of norfluoxetine, sertraline, diphenhydramine, diltiazem, and carbamazepine at nanogram-per-gram concentrations in fillet composites from effluent-dominated sampling locations; the additional presence of fluoxetine and gemfibrozil was confirmed in liver tissue. Sertraline was detected at concentrations as high as 19 and 545 ng/g in fillet and liver tissue, respectively. Gas chromatography-tandem mass spectrometry analysis of personal care products in fillet composites revealed the presence of galaxolide and tonalide at maximum concentrations of 2,100 and 290 ng/g, respectively, and trace levels of triclosan. In general, more pharmaceuticals were detected at higher concentrations and with greater frequency in liver than in fillet tissues. Higher lipid content in liver tissue could not account for this discrepancy as no significant positive correlations were found between accumulated pharmaceutical concentrations and lipid content for either tissue type from any sampling site. In contrast, accumulation of the personal care products galaxolide and tonalide was significantly related to lipid content. Results suggest that the detection of pharmaceuticals and personal care products was dependent on the degree of wastewater treatment employed.",
      "Background Advanced glycations end products increase oxidant stress, inflammation, and neurotoxicity. Serum levels are increased in diabetes and aging. We examined the relationship between serum methylglyoxal derivatives (sMG), and cognitive decline, in 267 non-demented elderly. Methods Tobit mixed regression models assessed the association of baseline sMG with cognitive decline in the Mini Mental State Exam (MMSE) over time, controlling for sociodemographic factors (age, sex, and years of education), cardiovascular risk factors (diabetes and presence of an APOE4 allele), and kidney function. sMG was assessed by ELISA. Results The fully adjusted model showed an annual decline of 0.26 MMSE points per unit increase in baseline sMG (p=0.03). Significance was unchanged as additional risk factors were added to the model. The interactions of sMG with diabetes, sex, age, kidney function, and APOE4 genotype were not significant. Conclusions Higher levels of baseline sMG were associated with a faster rate of cognitive decline, after adjusting for several sociodemographic and clinical characteristics. This relationship did not differ by sex, APOE4 genotype, or diabetes status suggesting its generality. Since subjects were cognitively normal at the beginning of the study, elevated sMG may be indicative of brain cell injury initiated before clinically evident cognitive compromise.",
      "SUMMARY: This study evaluated bone health in adults with galactosemia. Associations between bone mineral density (BMD) and nutritional and biochemical variables were explored. Calcium level predicted hip and spine BMD, and gonadotropin levels were inversely associated with spinal BMD in women. These results afford insights into management strategies for these patients. INTRODUCTION: Bone loss is a complication of galactosemia. Dietary restriction, primary ovarian insufficiency in women, and disease-related alterations of bone metabolism may contribute. This study examined relationships between clinical factors and BMD in patients with galactosemia. METHODS: This cross-sectional sample included 33 adults (16 women) with classic galactosemia, mean age 32.0 ± 11.8 years. BMD was measured by dual-energy X-ray absorptiometry, and was correlated with age, height, weight, fractures, nutritional factors, hormonal status, and bone biomarkers. RESULTS: There was a significant difference in hip BMD between women and men (0.799 vs. 0.896 g/cm(2), p = 0.014). The percentage of subjects with BMD-Z <-2.0 was also greater for women than men [33 vs. 18 % (spine), 27 vs. 6 % (hip)], and more women reported sustaining fractures. Bivariate analyses yielded correlations between BMI and BMD-Z [at the hip in women (r = 0.58, p < 0.05) and spine in men (r = 0.53, p < 0.05)]. In women, weight was also correlated with BMD-Z (r = 0.57, p < 0.05 at hip), and C-telopeptides (r = -0.59 at spine and -0.63 hip, p < 0.05) and osteocalcin (r = -0.71 at spine and -0.72 hip, p < 0.05) were inversely correlated with BMD-Z. In final regression models, higher gonadotropin levels were associated with lower spinal BMD in women (p = 0.017); serum calcium was a significant predictor of hip (p = 0.014) and spine (p = 0.013) BMD in both sexes. CONCLUSIONS: Bone density in adults with galactosemia is low, indicating the potential for increased fracture risk, the etiology of which appears to be multifactorial.",
      "The aim of the present review article is to summarize the available information related to the availability, production, chemical composition, pharmacological activity, and traditional uses of Avena sativa to highlight its potential to contribute to human health. Oats are now cultivated worldwide and form an important dietary staple for the people in number of countries. Several varieties of oats are available. It is a rich source of protein, contains a number of important minerals, lipids, β-glucan, a mixed-linkage polysaccharide, which forms an important part of oat dietary fiber, and also contains various other phytoconstituents like avenanthramides, an indole alkaloid-gramine, flavonoids, flavonolignans, triterpenoid saponins, sterols, and tocols. Traditionally oats have been in use since long and are considered as stimulant, antispasmodic, antitumor, diuretic, and neurotonic. Oat possesses different pharmacological activities like antioxidant, anti-inflammatory, wound healing, immunomodulatory, antidiabetic, anticholesterolaemic, etc. A wide spectrum of biological activities indicates that oat is a potential therapeutic agent.",
      "Beta-methylamino-L-alanine (BMAA) occurs in higher levels in museum specimens of the Guamanian flying fox than in the cycad seeds the flying foxes feed on, confirming the hypothesis that cycad neurotoxins are biomagnified within the Guam ecosystem. Consumption of a single flying fox may have resulted in an equivalent BMAA dose obtained from eating 174 to 1,014 kg of processed cycad flour. Traditional feasting on flying foxes may be related to the prevalence of neuropathologic disease in Guam."
    ],
    "relevance_map": {
      "0": 1,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 0
    },
    "query_id": "query_3"
  },
  {
    "query": "canker sores",
    "docs": [
      "Processed meat intake may be involved in the etiology of colorectal cancer, a major cause of death in affluent countries. The epidemiologic studies published to date conclude that the excess risk in the highest category of processed meat-eaters is comprised between 20 and 50% compared with non-eaters. In addition, the excess risk per gram of intake is clearly higher than that of fresh red meat. Several hypotheses, which are mainly based on studies carried out on red meat, may explain why processed meat intake is linked to cancer risk. Those that have been tested experimentally are (i) that high-fat diets could promote carcinogenesis via insulin resistance or fecal bile acids; (ii) that cooking meat at a high temperature forms carcinogenic heterocyclic amines and polycyclic aromatic hydrocarbons; (iii) that carcinogenic N-nitroso compounds are formed in meat and endogenously; (iv) that heme iron in red meat can promote carcinogenesis because it increases cell proliferation in the mucosa, through lipoperoxidation and/or cytotoxicity of fecal water. Nitrosation might increase the toxicity of heme in cured products. Solving this puzzle is a challenge that would permit to reduce cancer load by changing the processes rather than by banning processed meat.",
      "BACKGROUND: Orange juice-a rich source of vitamin C, folate, and flavonoids such as hesperidin-induces hypocholesterolemic responses in animals. OBJECTIVE: We determined whether orange juice beneficially altered blood lipids in subjects with moderate hypercholesterolemia. DESIGN: The sample consisted of 16 healthy men and 9 healthy women with elevated plasma total and LDL-cholesterol and normal plasma triacylglycerol concentrations. Participants incorporated 1, 2, or 3 cups (250 mL each) of orange juice sequentially into their diets, each dose over a period of 4 wk. This was followed by a 5-wk washout period. Plasma lipid, folate, homocyst(e)ine, and vitamin C (a compliance marker) concentrations were measured at baseline, after each treatment, and after the washout period. RESULTS: Consumption of 750 mL but not of 250 or 500 mL orange juice daily increased HDL-cholesterol concentrations by 21% (P: < 0.001), triacylglycerol concentrations by 30% (from 1.56 +/- 0.72 to 2.03 +/- 0.91 mmol/L; P: < 0.02), and folate concentrations by 18% (P: < 0.01); decreased the LDL-HDL cholesterol ratio by 16% (P: < 0.005); and did not affect homocyst(e)ine concentrations. Plasma vitamin C concentrations increased significantly during each dietary period (2.1, 3.1, and 3.8 times, respectively). CONCLUSIONS: Orange juice (750 mL/d) improved blood lipid profiles in hypercholesterolemic subjects, confirming recommendations to consume >/=5-10 servings of fruit and vegetables daily.",
      "OBJECTIVES: The objectives of this study were (1) to determine fast food restaurant prevalence in hospitals with pediatric residencies and (2) to evaluate how hospital environment affects purchase and perception of fast food. METHODS: We first surveyed pediatric residency programs regarding fast food restaurants in their hospitals to determine the prevalence of fast food restaurants in these hospitals. We then surveyed adults with children after pediatric outpatient visits at 3 hospitals: hospital M with an on-site McDonald's restaurant, hospital R without McDonald's on site but with McDonald's branding, and hospital X with neither on-site McDonald's nor branding. We sought to determine attitudes toward, consumption of, and influences on purchase of fast food and McDonald's food. RESULTS: Fifty-nine of 200 hospitals with pediatric residencies had fast food restaurants. A total of 386 outpatient surveys were analyzed. Fast food consumption on the survey day was most common among hospital M respondents (56%; hospital R: 29%; hospital X: 33%), as was the purchase of McDonald's food (hospital M: 53%; hospital R: 14%; hospital X: 22%). McDonald's accounted for 95% of fast food consumed by hospital M respondents, and 83% of them bought their food at the on-site McDonald's. Using logistic regression analysis, hospital M respondents were 4 times more likely than respondents at the other hospitals to have purchased McDonald's food on the survey day. Visitors to hospitals M and R were more likely than those at hospital X to believe that McDonald's supported the hospital financially. Respondents at hospital M rated McDonald's food healthier than did respondents at the other hospitals. CONCLUSIONS: Fast food restaurants are fairly common in hospitals that sponsor pediatric residency programs. A McDonald's restaurant in a children's hospital was associated with significantly increased purchase of McDonald's food by outpatients, belief that the McDonald's Corporation supported the hospital financially, and higher rating of the healthiness of McDonald's food.",
      "Oxygen is vital for most organisms but, paradoxically, damages key biological sites. Oxygenic threat is met by antioxidants that evolved in parallel with our oxygenic atmosphere. Plants employ antioxidants to defend their structures against reactive oxygen species (ROS; oxidants) produced during photosynthesis. The human body is exposed to these same oxidants, and we have also evolved an effective antioxidant system. However, this is not infallible. ROS breach defences, oxidative damage ensues, accumulates with age, and causes a variety of pathological changes. Plant-based, antioxidant-rich foods traditionally formed the major part of the human diet, and plant-based dietary antioxidants are hypothesized to have an important role in maintaining human health. This hypothesis is logical in evolutionary terms, especially when we consider the relatively hypoxic environment in which humans may have evolved. In this paper, the human diet is discussed briefly in terms of its evolutionary development, different strategies of antioxidant defence are outlined, and evolution of dietary antioxidants is discussed from the perspectives of plant need and our current dietary requirements. Finally, possibilities in regard to dietary antioxidants, evolution, and human health are presented, and an evolutionary cost-benefit analysis is presented in relation to why we lost the ability to make ascorbic acid (vitamin C) although we retained an absolute requirement for it.",
      "Platelet hyperactivity is one of the most important factors responsible for the incidence of cardiovascular disease. There are many nutritive and non-nutritive compounds present in the diet which may affect platelet function in various ways. Recent discovery of anti-platelet factors in plants, vegetables and fruits provides a new dietary means for a long-term strategy to favorably modify human blood platelet activity. This review summarises the effects of these dietary components on human platelet function both in vitro and in vivo.",
      "OBJECTIVES: The goal of this study was to determine the incidence of serum antibodies to gliadin and to cow's milk proteins (CMP) using ELISA test, within patients who have recurrent aphthous ulcers (RAU). SUBJECTS AND METHODS: Fifty patients with recurrent aphthous ulcers and fifty healthy people were included in this research. Levels of serum IgA and IgG antibodies to gliadin and IgA, IgG and IgE to CMP were determined using ELISA. RESULTS: The levels of serum antigliadin IgA and IgG antibodies were not significantly higher in patients with RAU in comparison with the controls (P = 0.937 and P = 0.1854 respectively). The levels of serum anti-CMP IgA, IgG and IgE antibodies were significantly higher in patients with RAU in comparison with the controls (P < 0.005, P < 0.002 and P < 0.001 respectively). In general, the increased humoral (IgA or IgG) immunoreactivity to CMP was found in 32 of 50 patients, while 17 of them showed the increased levels of both IgA and IgG immunoreactivity to CMP. At the same time, 16 out of 50 patients had IgA, IgG and IgE immunoreactivity to CMP. CONCLUSION: These results indicate the strong association between high levels of serum anti-CMP IgA, IgG and IgE antibodies and clinical manifestations of recurrent aphthous ulcers.",
      "Inhibition of monoamine oxidase is one way to treat depression and anxiety. The information now available on the pharmacokinetics of flavonoids and of the components of tobacco prompted an exploration of whether a healthy diet (with or without smoking) provides active compounds in amounts sufficient to partially inhibit monoamine oxidase. A literature search was used to identify dietary monoamine oxidase inhibitors, the levels of these compounds in foods, the pharmacokinetics of the absorption and distribution, and tissue levels observed. An estimated daily intake and the expected tissue concentrations were compared with the measured efficacies of the compounds as inhibitors of monoamine oxidases. Norharman, harman and quercetin dietary presence, pharmacokinetics, and tissue levels were consistent with significant levels reaching neuronal monoamine oxidase from the diet or smoking; 1,2,3,4-tetrahydroisoquinoline, eugenol, 1-piperoylpiperidine, and coumarin were not. Quercetin was equipotent with norharman as a monoamine oxidase A inhibitor and its metabolite, isorhamnetin, also inhibits. Total quercetin was the highest of the compounds in the sample diet. Although bioavailability was variable depending on the source, a healthy diet contains amounts of quercetin that might give sufficient amounts in brain to induce, by monoamine oxidase A inhibition, a small decrease in neurotransmitter breakdown.",
      "Coffee is the leading worldwide beverage after water and its trade exceeds US $10 billion worldwide. Controversies regarding its benefits and risks still exist as reliable evidence is becoming available supporting its health promoting potential; however, some researchers have argued about the association of coffee consumption with cardiovascular complications and cancer insurgence. The health-promoting properties of coffee are often attributed to its rich phytochemistry, including caffeine, chlorogenic acid, caffeic acid, hydroxyhydroquinone (HHQ), etc. Many research investigations, epidemiological studies, and meta-analyses regarding coffee consumption revealed its inverse correlation with that of diabetes mellitus, various cancer lines, Parkinsonism, and Alzheimer's disease. Moreover, it ameliorates oxidative stress because of its ability to induce mRNA and protein expression, and mediates Nrf2-ARE pathway stimulation. Furthermore, caffeine and its metabolites help in proper cognitive functionality. Coffee lipid fraction containing cafestol and kahweol act as a safeguard against some malignant cells by modulating the detoxifying enzymes. On the other hand, their higher levels raise serum cholesterol, posing a possible threat to coronary health, for example, myocardial and cerebral infarction, insomnia, and cardiovascular complications. Caffeine also affects adenosine receptors and its withdrawal is accompanied with muscle fatigue and allied problems in those addicted to coffee. An array of evidence showed that pregnant women or those with postmenopausal problems should avoid excessive consumption of coffee because of its interference with oral contraceptives or postmenopausal hormones. This review article is an attempt to disseminate general information, health claims, and obviously the risk factors associated with coffee consumption to scientists, allied stakeholders, and certainly readers. © Taylor and Francis Group, LLC"
    ],
    "relevance_map": {
      "0": 0,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 1,
      "6": 0,
      "7": 0
    },
    "query_id": "query_4"
  },
  {
    "query": "Caloric Restriction vs. Plant-Based Diets",
    "docs": [
      "Diet contributes to over one-third of cancer deaths in the Western world, yet the factors in the diet that influence cancer are not elucidated. A reduction in caloric intake dramatically slows cancer progression in rodents, and this may be a major contribution to dietary effects on cancer. Insulin-like growth factor I (IGF-I) is lowered during dietary restriction (DR) in both humans and rats. Because IGF-I modulates cell proliferation, apoptosis, and tumorigenesis, the mechanisms behind the protective effects of DR may depend on the reduction of this multifaceted growth factor. To test this hypothesis, IGF-I was restored during DR to ascertain if lowering of IGF-I was central to slowing bladder cancer progression during DR. Heterozygous p53-deficient mice received a bladder carcinogen, p-cresidine, to induce preneoplasia. After confirmation of bladder urothelial preneoplasia, the mice were divided into three groups: (a) ad libitum; (b) 20% DR; and (c) 20% DR plus IGF-I (IGF-I/DR). Serum IGF-I was lowered 24% by DR but was completely restored in the IGF-I/DR-treated mice using recombinant IGF-I administered via osmotic minipumps. Although tumor progression was decreased by DR, restoration of IGF-I serum levels in DR-treated mice increased the stage of the cancers. Furthermore, IGF-I modulated tumor progression independent of changes in body weight. Rates of apoptosis in the preneoplastic lesions were 10 times higher in DR-treated mice compared to those in IGF/DR- and ad libitum-treated mice. Administration of IGF-I to DR-treated mice also stimulated cell proliferation 6-fold in hyperplastic foci. In conclusion, DR lowered IGF-I levels, thereby favoring apoptosis over cell proliferation and ultimately slowing tumor progression. This is the first mechanistic study demonstrating that IGF-I supplementation abrogates the protective effect of DR on neoplastic progression.",
      "BACKGROUND: Ginger has been used throughout the world as a therapeutic agent for centuries. The herb is increasingly used in Western society also, with one of the most common indications being pregnancy-induced nausea and vomiting (PNV). OBJECTIVES: To examine the evidence for the safety and effectiveness of ginger for PNV. METHODS: Randomised controlled trials (RCTs) of ginger and PNV were sourced from CINAHL, the Cochrane library, MEDLINE and TRIP. The methodological quality of RCTs was assessed using the Critical Appraisal Skills Programme (CASP) tool. RESULTS: Four RCTs met the inclusion criteria. All trials found orally administered ginger to be significantly more effective than placebo in reducing the frequency of vomiting and intensity of nausea. Adverse events were generally mild and infrequent. CONCLUSION: The best available evidence suggests that ginger is a safe and effective treatment for PNV. However, there remains uncertainty regarding the maximum safe dosage of ginger, appropriate duration of treatment, consequences of over-dosage, and potential drug-herb interactions; all of which are important areas for future research. Copyright © 2012 Australian College of Midwives. Published by Elsevier Ltd. All rights reserved.",
      "Despite compelling statistics that show we could eliminate 80%of all heart disease and strokes, 90% of all diabetes, and 60% of all cancers with basic lifestyle changes, we have failed to motivate the public to make these changes and failed to motivate policy makers to make healthy choices the easiest choice. Dr. Katz suggests we have failed because we have focused too much on statistics and too little on passion. He implores all of us to tap into people's passion by connecting each of these statistics with a human story.",
      "Background In 2007 the World Cancer Research Fund (WCRF) and American Institute for Cancer Research (AICR) released eight recommendations related to body fatness, physical activity and diet aimed at preventing the most common cancers worldwide. However, limited information exists on the association between meeting these recommendations and risks of specific cancers, including breast cancer. Methods We operationalized six recommendations (related to body fatness, physical activity, foods that promote weight gain, plant foods, red and processed meats, and alcohol) and examined their association with invasive breast cancer incidence over 6.7 years of follow-up in the VITamins And Lifestyle (VITAL) study cohort. Participants included 30,797 post-menopausal women ages 50–76 years at baseline in 2000–2002 with no history of breast cancer. Breast cancers (n=899) were tracked through the Western Washington Surveillance, Epidemiology and End Results (SEER) database. Results Breast cancer risk was reduced by 60% in women who met at least five recommendations compared to those who met none (HR: 0.40; 95% CI: 0.25–0.65; Ptrend<0.001). Further analyses that sequentially removed individual recommendations least associated with reduced risk suggested that this reduction is due to meeting recommendations related to body fatness, plant foods and alcohol (HR for meeting vs. not meeting these three recommendations: 0.38; 95% CI: 0.25–0.58; Ptrend <0.001). Conclusions Meeting the WCRF/AICR cancer prevention recommendations, specifically those related to alcohol, body fatness and plant foods, is associated with reduced post-menopausal breast cancer incidence. Impact Increased adherence to the WCRF/AICR cancer prevention recommendations could substantially reduce post-menopausal breast cancer risk in US women.",
      "BACKGROUND: From 2003 through 2007, Vibrio cholerae serogroup O75 strains possessing the cholera toxin gene were isolated from 6 patients with severe diarrhea, including 3 in Georgia, 2 in Alabama, and 1 in South Carolina. These reports represent the first identification of V. cholerae O75 as a cause of illness in the United States. V. cholerae O75 was isolated from a water sample collected from a pond in Louisiana in 2004. Subsequently, 3 V. cholerae isolates from Louisiana (2 from patients with diarrhea in 2000 and 1 from a water sample collected in 1978) that had been previously reported as serogroup O141 were also discovered to be serogroup O75. RESULTS: All 8 patients who were infected with V. cholerae O75 were adults who became ill after consuming seafood; 2 had eaten raw oysters traced back to the Gulf Coast of the United States. All 10 isolates possessed the cholera toxin gene and were susceptible to 10 antimicrobials. One clinical isolate and 1 environmental (water) isolate had the same pulsed-field gel electrophoresis pattern; 4 clinical isolates shared a common pulsed-field gel electrophoresis pattern. CONCLUSIONS: The occurrence of these cases over many years and the concurrent identification of V. cholerae O75 in water from a Gulf Coast state suggest that these strains may survive for long periods in this environment. The patients' exposure histories suggest that infection can be acquired from consumption of raw oysters from the Gulf Coast. Clinicians and public health authorities should be vigilant for the occurrence of new toxigenic serogroups of V. cholerae that are capable of causing severe diarrhea.",
      "Summary Objectives The insulin-like growth factor (IGF) signaling pathway has been implicated in the pathogenesis of numerous tumor types, including non-small cell lung cancer (NSCLC). Figitumumab is a fully human IgG2 monoclonal antibody against IGF-1 receptor (IGF-1R). Methods This phase I, open-label, dose-escalation study (ClinicalTrials.gov: NCT00603538) assessed the safety and tolerability of figitumumab (6, 10 and 20 mg/kg) in combination with carboplatin (area under the curve: 6 mg·min/mL) and paclitaxel (200 mg/m2) in Japanese patients (N = 19) with chemotherapy-naïve, advanced NSCLC. Treatments were administered intravenously on day 1 of a 21-day cycle for four to six cycles. Pharmacokinetics, biomarkers, and antitumor activity were also evaluated. Results Figitumumab in combination with carboplatin and paclitaxel was well tolerated at doses up to 20 mg/kg; no dose-limiting toxicities were observed at this dose level. When given in combination, figitumumab plasma exposure increased in an approximately dose-proportional manner. The approximate 2-fold accumulation following repeated administration supported the 21-day regimen as appropriate for figitumumab administration. Serum total IGF-1 and IGF binding protein-3 concentrations increased following figitumumab dosing, but a clear dose-dependent relationship was not demonstrated. Seven of 18 evaluable patients experienced a partial response. Conclusions Figitumumab 20 mg/kg in combination with carboplatin and paclitaxel was well tolerated in chemotherapy-naïve Japanese patients with NSCLC. Further analysis of biomarker data is necessary for the development of figitumumab therapy.",
      "This study aimed to evaluate the association of diet with respiratory symptoms and asthma in schoolchildren in Taipei, Taiwan. An in-class interview survey elicited experiences of asthma and respiratory symptoms and consumption frequencies of the major food categories in 2290 fifth graders. Respiratory symptoms surveyed included persistent cough, chest tightness, wheezing with cold, wheezing without cold, dyspnea-associated wheezing, and exercise-induced cough or wheezing. Results showed that the consumption of sweetened beverages had the strongest association with respiratory symptoms and was positively associated with six of the seven respiratory symptoms (all p < 0.05). The adjusted odds ratios (aOR) ranged from 1.05 (95% confidence interval (CI = 1.01-1.09) for exercise-induced cough to 1.09 (95% CI = 1.03-1.16) for wheezing without cold. Egg consumption was associated with 5 of the 7 respiratory symptoms. Consumptions of seafood, soy products, and fruits were each negatively associated with one of the seven respiratory symptoms (all p < 0.05). Consumption of seafood was negatively associated with physician-diagnosed asthma and consumptions of sweetened beverages and eggs were positively associated with suspected asthma (p < 0.05). In conclusion, the study suggests that diet is associated with the respiratory symptoms in schoolchildren in Taipei. Consumptions of sweetened beverages and eggs are associated with increased risk of respiratory symptoms and asthma whereas consumptions of soy products and fruits are associated with reduced risk of respiratory symptoms.",
      "To determine the effects of different diets on the genotoxicity of human faecal water, a diet rich in fat, meat and sugar but poor in vegetables and free of wholemeal products (diet 1) was consumed by seven healthy volunteers over a period of 12 days. One week after the end of this period, the volunteers started to consume a diet enriched with vegetables and wholemeal products but poor in fat and meat (diet 2) over a second period of 12 days. The genotoxic effect of faecal waters obtained after both diets was assessed with the single cell gel electrophoresis (Comet assay) using the human colon adenocarcinoma cell line HT29 clone 19a as a target. The fluorescence and length of the tails of the comet images reflects the degree of DNA damage in single cells. The mean DNA damage, expressed as the ratio of tail intensity (fluorescence in the tail) to total intensity of the comet after incubation with faecal water from volunteers consuming diet 1 was about twice as high as for diet 2. The susceptibility of the cells incubated with faecal water to DNA damage caused by additional hydrogen peroxide treatment showed no significant differences between the two diets. Generation of oxidized pyrimidine and purine bases revealed no differences after pretreatment with both types of faecal water. The results indicate that diets high in fat and meat but low in dietary fibre increase the genotoxicity of faecal water to colonic cells and may contribute to an enhanced risk of colorectal cancer.",
      "Coronary artery disease is responsible for much mortality and morbidity around the world. Platelets are involved in atherosclerotic disease development and the reduction of platelet activity by medications reduces the incidence and severity of disease. Red wine and grapes contain polyphenolic compounds, including flavonoids, which can reduce platelet aggregation and have been associated with lower rates of cardiovascular disease. Citrus fruits contain different classes of polyphenolics that may not share the same properties. This study evaluated whether commercial grape, orange and grapefruit juices, taken daily, reduce ex vivo platelet activity. In a randomized cross-over design, ten healthy human subjects (ages 26-58 y, five of each gender) drank 5-7.5 mL/(kg. d) of purple grape juice, orange juice or grapefruit juice for 7-10 d each. Platelet aggregation (whole blood impedance aggregometry, Chronolog Model #590) at baseline was compared to results after consumption of each juice. Drinking purple grape juice for one week reduced the whole blood platelet aggregation response to 1 mg/L of collagen by 77% (from 17.9 +/- 2.3 to 4.0 +/- 6.8 ohms, P = 0.0002). Orange juice and grapefruit juice had no effect on platelet aggregation. The purple grape juice had approximately three times the total polyphenolic concentration of the citrus juices and was a potent platelet inhibitor in healthy subjects while the citrus juices showed no effect. The platelet inhibitory effect of the flavonoids in grape juice may decrease the risk of coronary thrombosis and myocardial infarction.",
      "BACKGROUND: Increasingly the potential harm from high cholesterol intake, and specifically from egg yolks, is considered insignificant. We therefore assessed total plaque area (TPA) in patients attending Canadian vascular prevention clinics to determine if the atherosclerosis burden, as a marker of arterial damage, was related to egg intake. To provide perspective on the magnitude of the effect, we also analysed the effect of smoking (pack-years). METHODS: Consecutive patients attending vascular prevention clinics at University Hospital had baseline measurement of TPA by duplex ultrasound, and filled out questionnaires regarding their lifestyle and medications, including pack-years of smoking, and the number of egg yolks consumed per week times the number of years consumed (egg-yolk years). RESULTS: Data were available in 1262 patients; mean (SD) age was 61.5 (14.8) years; 47% were women. Carotid plaque area increased linearly with age after age 40, but increased exponentially with pack-years of smoking and with egg-yolk years. Plaque area in patients consuming <2 eggs per week (n = 388) was 125 ± 129 mm(2), versus 132 ± 142 mm(2) in those consuming 3 or more eggs per week (n = 603); (p < 0.0001 after adjustment for age). In multiple regression, egg-yolk years remained significant after adjusting for coronary risk factors. INTERPRETATION: Our findings suggest that regular consumption of egg yolk should be avoided by persons at risk of cardiovascular disease. This hypothesis should be tested in a prospective study with more detailed information about diet, and other possible confounders such as exercise and waist circumference. Copyright © 2012 Elsevier Ireland Ltd. All rights reserved."
    ],
    "relevance_map": {
      "0": 1,
      "1": 0,
      "2": 1,
      "3": 0,
      "4": 0,
      "5": 1,
      "6": 0,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "query_5"
  },
  {
    "query": "pumpkin",
    "docs": [
      "OBJECTIVE: The aim of this work was to determine the bioavailability of herbs and spices after human consumption by measuring the ability to protect lymphocytes from an oxidative injury and by examining the impact on inflammatory biomarkers in activated THP-1 cells. METHODS: Ten to 12 subjects in each of 13 groups consumed a defined amount of herb or spice for 7 days. Blood was drawn from subjects before consumption and 1 hour after taking the final herb or spice capsules. Subject serum and various extractions of the herbs and spices were analyzed for antioxidant capacity by oxygen radical absorbance capacity (ORAC) analysis or by 1,1-diphenyl-2-picrylhydrzyl (DPPH). Subject peripheral blood mononuclear cells (PBMCs) in medium with10% autologous serum were incubated with hydrogen peroxide to induce DNA strand breaks. Subject serum was also used to treat activated THP-1 cells to determine relative quantities of 3 inflammatory cytokine (tumor necrosis factor-α [TNF-α], interleukin-1α [IL-1α], and IL-6) mRNAs. RESULTS: Herbs and spices that protected PBMCs against DNA strand breaks were paprika, rosemary, ginger, heat-treated turmeric, sage, and cumin. Paprika also appeared to protect cells from normal apoptotic processes. Of the 3 cytokine mRNAs studied (TNF-α, IL-1α, and IL-6), TNF-α was the most sensitive responder to oxidized LDL-treated macrophages. Clove, ginger, rosemary, and turmeric were able to significantly reduce oxidized LDL-induced expression of TNF-α. Serum from those consuming ginger reduced all three inflammatory biomarkers. Ginger, rosemary, and turmeric showed protective capacity by both oxidative protection and inflammation measures. CONCLUSIONS: DNA strand breaks and inflammatory biomarkers are a good functional measure of a food's bioavailability.",
      "Preliminary information has suggested that megestrol acetate leads to appetite stimulation and nonfluid weight gain in patients with breast cancer, other cancers, and AIDS. Pursuant to this, we developed a randomized, double-blind, placebo-controlled trial of megestrol acetate in patients with cancer-associated anorexia and cachexia. We randomly assigned 133 eligible patients to receive 800 mg of megestrol acetate per day or a placebo. Patients assigned to megestrol acetate more frequently reported improved appetite (P = .003) and food intake (P = .009) when compared with patients receiving the placebo. A weight gain of 15 lb or more over baseline was seen in 11 of 67 (16%) patients receiving megestrol acetate compared with one of 66 (2%) given the placebo (P = .003). Patients receiving megestrol acetate reported significantly less nausea (13% vs. 38%; P = .001) and emesis (8% vs. 25%, P = .009). No clinically or statistically significant toxic reactions were ascribed to megestrol acetate, with the exception of mild edema. This study convincingly demonstrated that megestrol acetate can stimulate appetite and food intake in patients with anorexia and cachexia associated with cancer, leading to significant weight gain in a proportion of such patients.",
      "This study evaluated the toxicological sensitivity of non-feeding larval stages of a key Antarctic species (Antarctic krill, Euphausia superba) to p,p'-dichlorodiphenyl dichloroethylene (p,p'-DDE) exposure. The aqueous uptake clearance rate of 84 mL g(-1) preserved weight (p.w.) h(-1) determined for p,p'-DDE in Antarctic krill larvae is comparable to previous findings for small cold water crustaceans and five times slower than the rates reported for an amphipod inhabiting warmer waters. Natural variations in larval physiology appear to influence contaminant uptake and larval krill behavioural responses, strongly highlighting the importance of time of measurement for ecotoxicological testing. Sublethal narcosis (immobility) was observed in larval Antarctic krill from p,p'-DDE body residues of 0.2 mmol/kg p.w., which is in agreement with findings for adult krill and temperate aquatic species. The finding of comparable body residue-based toxicity of p,p'-DDE between polar and temperate species supports the tissue residue approach for environmental risk assessment of polar ecosystems. Copyright Â© 2011 Elsevier Ltd. All rights reserved.",
      "We examined the association of dietary lignan intake with estrogen receptor negative (ER-) and ER positive (ER+) breast cancer risk in a breast cancer case-control study. Among premenopausal women only, there was a reduced risk of ER- breast cancer for those in the highest compared to the lowest quartile of lignan intake suggesting that the observed negative association of lignans with breast cancer may be limited to ER- tumors.",
      "Dietary interventions involving antioxidants are of interest for reducing inflammation, improving joint motion, and altering pain perception. We evaluated the effect of oral consumption of a fruit and berry blend on pain and range of motion (ROM). This open-label clinical pilot study involved 14 study participants with limitations in ROM that was associated with pain and affected daily living. Participants included but were not limited to those with age-related osteoarthritis. Study participants consumed 120 mL MonaVie Active® fruit juice, predominantly containing açai pulp (Euterpe oleracea Mart.) and other fruit concentrates, daily for 12 weeks. Study participants were assessed at baseline and 2, 4, 8, and 12 weeks by structured nurse interviews, pain and activities of daily living (ADL) questionnaires, blood samples, and ROM assessment. Pain was scored by using a visual analogue scale. ROM was assessed by using dual digital inclinometry as recommended by American Medical Association guidelines. Consumption of the juice resulted in significant pain reduction, improved ROM measures, and improvement in ADLs. Serum antioxidant status, as monitored by the cell-based antioxidant protection in erythrocytes (CAP-e) assay, was improved within 2 weeks and continued to improve throughout the 12 weeks of study participation (P<.01). The inflammatory marker C-reactive protein was reduced at 12 weeks, but this change did not reach statistical significance. Lipid peroxidation decreased mildly at 12 weeks. The antioxidant status, as measured by the CAP-e bioassay, showed the best correlation with improvements in physical well-being (pain, ROM, and ADL). The significant association among increased antioxidant status, improved ROM, and pain reduction warrants further study.",
      "Animal work over the last three decades has generated a convincing body of evidence that a Western diet - one high in saturated fat and refined carbohydrates (HFS diet) - can damage various brain systems. In this review we examine whether there is evidence for this in humans, using converging lines of evidence from neuropsychological, epidemiological and neuroimaging data. Using the animal research as the organizing principal, we examined evidence for dietary induced impairments in frontal, limbic and hippocampal systems, and with their associated functions in learning, memory, cognition and hedonics. Evidence for the role of HFS diet in attention deficit disorder and in neurodegenerative conditions was also examined. While human research data is still at an early stage, there is evidence of an association between HFS diet and impaired cognitive function. Based upon the animal data, and a growing understanding of how HFS diets can disrupt brain function, we further suggest that there is a causal link running from HFS diet to impaired brain function in humans, and that HFS diets also contribute to the development of neurodegenerative conditions. Crown Copyright © 2013. Published by Elsevier Ltd. All rights reserved.",
      "In this study, a panel of normal human prostate cells (HPCs) and tumor cells derived from metastases were studied by (1)H NMR spectroscopy to determine whether the malignant transformation of HPCs results in the elevation of choline compounds. Although an elevated choline signal has been observed previously in clinical studies, the contribution of the different Cho compounds to this elevation, as well as their quantification, has not been established until now. Here we have shown that HPCs derived from metastases exhibit significantly higher phosphocholine as well as glycerophosphocholine levels compared with normal prostate epithelial and stromal cells. Thus the elevation of the choline peak observed clinically in prostate cancer is attributable to an alteration of phospholipid metabolism and not simply to increased cell density, doubling time, or other nonspecific effects. Androgen deprivation of the androgen receptor-positive cell lines resulted in a significant increase of choline compounds after chronic androgen deprivation of the LNCaP cell line and in a decrease of choline compounds after a more acute androgen deprivation of the LAPC-4 cell line. These data strongly support the use of proton magnetic resonance spectroscopic imaging to detect the presence of prostate cancer for diagnosis, to detect response subsequent to androgen ablation therapy, and to detect recurrence.",
      "Alternative and complementary therapeutic approaches, such as the use of a wide array of herbal, nutritional, and physical manipulations, are becoming popular for relieving symptoms of osteoarthritis (OA). The present study evaluated the efficacy of soy protein (SP) supplementation in relieving the pain and discomfort associated with OA. One hundred and thirty-five free-living individuals (64 men and 71 women) with diagnosed OA or with self-reported chronic knee joint pain not attributed to injury or rheumatoid arthritis were recruited for this double-blind, placebo-controlled, parallel design study. Study participants were assigned randomly to consume 40 g of either supplemental SP or milk-based protein (MP) daily for 3 months. Pain, knee range of motion, and overall physical activity were evaluated prior to the start of treatment and monthly thereafter. Serum levels of glycoprotein 39 (YKL-40), a marker of cartilage degradation, and insulin-like growth factor-I (IGF-I), a growth factor associated with cartilage synthesis, were assessed at baseline and at the end of the study. Overall, SP improved OA-associated symptoms such as range of motion and several factors associated with pain and quality of life in comparison to MP. However, these beneficial effects were mainly due to the effect of SP in men rather than women. Biochemical markers of cartilage metabolism further support the efficacy of SP in men as indicated by a significant increase in serum level of IGF-I and a significant decrease in serum level of YKL-40 compared to MP. This study is the first to provide evidence of possible beneficial effects of SP in the management of OA. Examining and verifying the long-term effects of SP on improving symptoms of OA, particularly in men, is warranted.",
      "Background Curcumin extracts of turmeric are proposed to produce health benefits. To date, human intervention studies have focused mainly on people with existing health problems given high doses of poorly absorbed curcumin. The purpose of the current study was to check whether in healthy people, a low dose of a lipidated curcumin extract could alter wellness-related measures. Methods The present study was conducted in healthy middle aged people (40–60 years old) with a low dose of curcumin (80 mg/day) in a lipidated form expected to have good absorption. Subjects were given either curcumin (N = 19) or placebo (N = 19) for 4 wk. Blood and saliva samples were taken before and after the 4 weeks and analyzed for a variety of blood and saliva measures relevant to health promotion. Results Curcumin, but not placebo, produced the following statistically significant changes: lowering of plasma triglyceride values, lowering of salivary amylase levels, raising of salivary radical scavenging capacities, raising of plasma catalase activities, lowering of plasma beta amyloid protein concentrations, lowering of plasma sICAM readings, increased plasma myeloperoxidase without increased c-reactive protein levels, increased plasma nitric oxide, and decreased plasma alanine amino transferase activities. Conclusion Collectively, these results demonstrate that a low dose of a curcumin-lipid preparation can produce a variety of potentially health promoting effects in healthy middle aged people.",
      "BACKGROUND: Rapid socioeconomic development in Japan since the beginning of the Seven Countries Study in 1958 has brought remarkable changes in lifestyle and dietary patterns. We investigated the relationship between time trends in nutrient intake and serum cholesterol levels in a Japanese cohort of the Seven Countries Study, in Tanushimaru, a typical farming town on Kyushu Island. METHODS: Subjects totaled 628 in 1958, 539 in 1977, 602 in 1982, 752 in 1989, and 402 in 1999, and all of the subjects were men aged 40-64 years. Eating patterns were evaluated by 24-hour dietary recall from 1958 through 1989, and by a food frequency questionnaire in 1999. We also measured serum cholesterol levels in each health examination. RESULTS: The total daily energy intake decreased from 2837 kcal in 1958 to 2202 kcal in 1999. The carbohydrate intake in percentage of total daily energy intake decreased markedly, from 84% in 1958 to 62% in 1999, in contrast to large increases during this period in protein intake (from 11% to 18%) and fat intake (from 5% to 20%). In proportion to the dramatic change in protein and fat intake, serum cholesterol levels showed large increases (from 152.5mg/dl to 194.2 mg/ dL). CONCLUSIONS: In spite of such big dietary changes toward a westernized diet, the incidence of coronary artery disease in a rural Japanese area remains low. However, careful surveillance is needed in the future because of the remarkably increasing intake of fats, especially saturated fatty acids."
    ],
    "relevance_map": {
      "0": 1,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 1,
      "8": 1,
      "9": 0
    },
    "query_id": "query_6"
  },
  {
    "query": "pork",
    "docs": [
      "OBJECTIVE: workers in slaughterhouses and processing plants that handle pigs, and pork butchers/meatcutters have been little studied for health risks associated with employment, in spite of the fact that they are potentially exposed to oncogenic and non-oncogenic transmissible agents and chemical carcinogens at work. We report here on an update of mortality in 510 workers employed in abattoirs and processing plants that almost exclusively handled pigs and pork products. METHODS: standardized mortality ratios (SMRs) were estimated for the cohort as a whole, and in subgroups defined by race and sex, using the corresponding US general population mortality rates for comparison. Study subjects were followed up from January 1950 to December 2006, during which time 45% of them died. RESULTS: mortality was significantly increased overall in the cohort. A statistically significant excess of deaths was observed for colon and lung cancers in the entire cohort, SMR=2.7 (95% CI, 1.2-5.1), SMR=1.8 (95% CI, 1.1-2.7), respectively. Significant SMRs in the cohort as a whole were also observed for senile and pre-senile psychotic conditions (SMR=5.1, 95% CI, 1.4-13.1), and pneumonia (SMR=2.6, 95% CI, 1.3-4.8). An observed excess of subarachnoid hemorrhage was seen mainly in whites (SMR=10.1, 95% CI, 1.2-36.3). There was a suggestion of an excess of deaths from ischemic heart disease also, but the elevated SMR was confined to men and was not statistically significant. CONCLUSION: this study confirms the excess occurrence of lung and colon cancers, and stroke previously reported in this occupational group. New findings are the excess of risk for senile and pre-senile psychotic conditions and pneumonia, which together with the excess of colon cancer appear specific for pig/pork workers, as they were not evident in much larger studies of workers in abattoirs and processing plants handling cattle and sheep. However, caution should be exercised in interpreting these findings, since some of them could have occurred by chance, resulting from our examination of a large number of causes of death in multiple study subgroups. For the moment, the significance of these findings remains unknown until they are confirmed in larger studies of adequate statistical power. Studies that will take into account possible occupational and non-occupational confounding factors are needed. Copyright © 2011. Published by Elsevier Inc.",
      "In Japan dramatic lifestyle changes occurred after World War 2. To examine the experience of Japan as a clue to the etiology, trends in the mortality rates of testicular and prostatic cancers from 1947 to 1998 were related to changes in dietary practices. The male population born before 1945 had a peak in death from testicular cancer in their thirties or forties, whereas those born after 1946 had a peak in their twenties. The death rate of prostatic cancer increased 25-fold almost linearly after the war. The intake of milk, meat, and eggs increased 20-, 9-, and 7-fold, respectively, after the war. In connection with the development and growth of testicular and prostatic cancers in Japan, particular attention should be paid to milk, because the increase in its consumption in this country is a recent occurrence and because milk contains considerable amounts of estrogens plus saturated fats.",
      "Non-alcoholic fatty liver disease (NAFLD) is the most common liver disease in the United States. While the American Association for the Study of Liver Diseases guidelines define NAFLD as hepatic steatosis detected either on histology or imaging without a secondary cause of abnormal hepatic fat accumulation, no imaging modality is recommended as standard of care for screening or diagnosis. Bedside ultrasound has been evaluated as a non-invasive method of diagnosing NAFLD with the presence of characteristic sonographic findings. Prior studies suggest characteristic sonographic findings for NAFLD include bright hepatic echoes, increased hepatorenal echogenicity, vascular blurring of portal or hepatic vein and subcutaneous tissue thickness. These sonographic characteristics have not been shown to aid bedside clinicians easily identify potential cases of NAFLD. While sonographic findings such as attenuation of image, diffuse echogenicity, uniform heterogeneous liver, thick subcutaneous depth, and enlarged liver filling of the entire field could be identified by clinicians from bedside ultrasound. The accessibility, ease of use, and low-side effect profile of ultrasound make bedside ultrasound an appealing imaging modality in the detection of hepatic steatosis. When used with appropriate clinical risk factors and steatosis involves greater than 33% of the liver, ultrasound can reliably diagnose NAFLD. Despite the ability of ultrasound in detecting moderate hepatic steatosis, it cannot replace liver biopsy in staging the degree of fibrosis. The purpose of this review is to examine the diagnostic accuracy, utility, and limitations of ultrasound in the diagnosis of NAFLD and its potential use by clinicians in routine practices.",
      "The treatment of bacterial infections is increasingly complicated by the ability of bacteria to develop resistance to antimicrobial agents. Antimicrobial agents are often categorized according to their principal mechanism of action. Mechanisms include interference with cell wall synthesis (e.g., beta-lactams and glycopeptide agents), inhibition of protein synthesis (macrolides and tetracyclines), interference with nucleic acid synthesis (fluoroquinolones and rifampin), inhibition of a metabolic pathway (trimethoprim-sulfamethoxazole), and disruption of bacterial membrane structure (polymyxins and daptomycin). Bacteria may be intrinsically resistant to > or =1 class of antimicrobial agents, or may acquire resistance by de novo mutation or via the acquisition of resistance genes from other organisms. Acquired resistance genes may enable a bacterium to produce enzymes that destroy the antibacterial drug, to express efflux systems that prevent the drug from reaching its intracellular target, to modify the drug's target site, or to produce an alternative metabolic pathway that bypasses the action of the drug. Acquisition of new genetic material by antimicrobial-susceptible bacteria from resistant strains of bacteria may occur through conjugation, transformation, or transduction, with transposons often facilitating the incorporation of the multiple resistance genes into the host's genome or plasmids. Use of antibacterial agents creates selective pressure for the emergence of resistant strains. Herein 3 case histories-one involving Escherichia coli resistance to third-generation cephalosporins, another focusing on the emergence of vancomycin-resistant Staphylococcus aureus, and a third detailing multidrug resistance in Pseudomonas aeruginosa--are reviewed to illustrate the varied ways in which resistant bacteria develop.",
      "The incidence of neonatal vitamin B12 (cobalamin) deficiency because of maternal deficiency was determined by surveying state newborn screening programs. Thirty-two infants with nutritional vitamin B12 deficiency were identified (0.88/100,000 newborns). Pregnant women should be assessed for their risk of inadequate intake/malabsorption of vitamin B12. Copyright (c) 2010 Mosby, Inc. All rights reserved.",
      "Salmonella enterica is one of the most common causes of foodborne illness in the United States. Although salmonellosis is usually self-limiting, severe infections typically require antimicrobial treatment, and ceftriaxone, an extended-spectrum cephalosporin (ESC), is commonly used in both adults and children. Surveillance conducted by the National Antimicrobial Resistance Monitoring System (NARMS) has shown a recent increase in ESC resistance among Salmonella Heidelberg isolated from food animals at slaughter, retail meat, and humans. ESC resistance among Salmonella in the United States is usually mediated by a plasmid-encoded bla(CMY) β-lactamase. In 2009, we identified 47 ESC-resistant bla(CMY)-positive Heidelberg isolates from humans (n=18), food animals at slaughter (n=16), and retail meats (n=13) associated with a spike in the prevalence of this serovar. Almost 90% (26/29) of the animal and meat isolates were isolated from chicken carcasses or retail chicken meat. We screened NARMS isolates for the presence of bla(CMY), determined whether the gene was plasmid-encoded, examined pulsed-field gel electrophoresis patterns to assess the genetic diversities of the isolates, and categorized the bla(CMY) plasmids by plasmid incompatibility groups and plasmid multi-locus sequence typing (pMLST). All 47 bla(CMY) genes were found to be plasmid encoded. Incompatibility/replicon typing demonstrated that 41 were IncI1 plasmids, 40 of which only conferred bla(CMY)-associated resistance. Six were IncA/C plasmids that carried additional resistance genes. pMLST of the IncI1-bla(CMY) plasmids showed that 27 (65.8%) were sequence type (ST) 12, the most common ST among bla(CMY)-IncI1 plasmids from Heidelberg isolated from humans. Ten plasmids had a new ST profile, ST66, a type very similar to ST12. This work showed that the 2009 increase in ESC resistance among Salmonella Heidelberg was caused mainly by the dissemination of bla(CMY) on IncI1 and IncA/C plasmids in a variety of genetic backgrounds, and is likely not the result of clonal expansion.",
      "Scope Observational studies have evaluated the relationship between green tea intake and cancers of the ovary and endometrium, but we are not aware of the published studies on green tea intake and risk of human papillomavirus (HPV)-related cancers of the cervix, vagina, or vulva. Methods and results A critical review of the published literature on tea intake and risk of ovarian and endometrial cancers was conducted. In meta-analyses, we report inverse associations for green tea intake and risk of ovarian cancer (odds ratio [OR] = 0.66; 95% confidence interval [CI]: 0.54, 0.80), and for green tea and risk of endometrial cancer (OR = 0.78, 95% CI: 0.62, 0.98). There was no association for black tea and ovarian cancer risk (OR = 0.94, 95% CI: 0.87, 1.02) and a positive association with endometrial cancer risk (OR = 1.20, 95% CI: 1.05, 1.38). We summarized the experimental evidence supporting the antiviral and immunomodulatory activities of green tea catechins, and results from randomized clinical trials that demonstrated green tea catechin efficacy on treatment of cervical lesions and external genital warts. Conclusion Observational data support a protective role of green tea on risk of ovarian and endometrial cancers. Observational data are needed to evaluate whether green tea reduces risk of human papillomavirus-related cancers.",
      "There is limited research examining the relationship of candy consumption by adults on diet and health. The purpose of this study was to determine total, chocolate, or sugar candy consumption and their effect on energy, saturated fatty acid and added sugar intake, weight, risk factors for cardiovascular disease, metabolic syndrome (MetS), and diet quality in adults 19 years and older (n = 15,023) participating in the 1999-2004 National Health and Nutrition Examination Survey. Twenty-four-hour dietary recalls were used to determine intake. Covariate-adjusted means ± SE and prevalence rates were determined for candy consumption groups. Odds ratios were used to determine the likelihood of cardiovascular risk factors and MetS. A total of 21.8%, 12.9%, and 10.9% of adults consumed total, chocolate, and sugar candy, respectively. Mean daily per capita intake of total, chocolate, and sugar candy was 9.0 ± 0.3, 5.7 ± 0.2, and 3.3 ± 0.2 g, respectively; intake in consumers was 38.3 ± 1.0, 39.9 ± 1.1, and 28.9 ± 1.3 g, respectively. Energy (9973 ± 92 vs 9027 ± 50 kJ; P < .0001), saturated fatty acid (27.9 ± 0.26 vs 26.9 ± 0.18 g; P = .0058), and added sugar (25.7 ± 0.42 vs 21.1 ± 0.41 g; P < .0001) intake were higher in candy consumers than nonconsumers. Body mass index (27.7 ± 0.15 vs 28.2 ± 0.12 kg/m(2); P = .0092), waist circumference (92.3 ± 0.34 vs 96.5 ± 0.29 cm; P = .0051), and C-reactive protein (0.40 ± 0.01 vs 0.43 ± 0.01 mg/dL; P = .0487) levels were lower in candy consumers than nonconsumers. Candy consumers had a 14% decreased risk of elevated diastolic blood pressure (P = .0466); chocolate consumers had a 19% decreased risk of lower high-density lipoprotein cholesterol (P = .0364) and a 15% reduced risk of MetS (P = .0453). Results suggest that the current level of candy consumption was not associated with health risks. Copyright © 2011 Elsevier Inc. All rights reserved.",
      "Black rice and its pigment fraction have shown anti-atherogenic activities in several animal models, but whether their beneficial effects will recur in humans remains unknown. The aim of the present study is to investigate the influence of black rice pigment fraction (BRF) supplementation on selected cardiovascular risk factors in patients with coronary heart disease (CHD). Sixty patients with CHD aged 45-75 years were recruited from the Second Affiliated Hospital of Sun Yat-Sen University in Guangzhou, China and randomly divided into two groups. In the test group, the diet was supplemented with 10 grams of BRF derived from black rice for 6 months; While in the placebo group, the diet was supplemented with 10 grams of white rice pigment fraction (WRF) derived from white rice. At baseline, plasma antioxidant status and the levels of inflammatory biomarkers and other measured variables were similar between two groups. After 6 months' intervention, compared to WRF supplementation, BRF supplementation greatly enhanced plasma total antioxidant capacity (TAC) (p=0.003), significantly reduce plasma levels of soluble vascular cell adhesion molecule-1 (sVCAM-1) (p=0.03), soluble CD40 ligand (sCD40L) (p=0.002) and high sensitive C-reactive protein (hs-CRP) (p=0.002) in the test group. No significant changes were observed in plasma total superoxide dismutase (T-SOD) activity, lipids level and carotid artery intima-media thickness (IMT) between two groups. These results may suggest that BRF could exert cardioprotective effects on patients with CHD by improving plasma antioxidant status and inhibiting inflammatory factors.",
      "Contamination of retail chicken meat by Extended Spectrum Beta-Lactamase (ESBL) producing bacteria likely contributes to the increasing incidence of infections with these bacteria in humans. This study aimed to compare the prevalence and load of ESBL positive isolates between organic and conventional retail chicken meat samples, and to compare the distribution of ESBL genes, strain genotypes and co-resistance. In 2010, 98 raw chicken breasts (n=60 conventional; n=38 organic) were collected from 12 local stores in the Netherlands. Prevalence of ESBL producing micro-organisms was 100% on conventional and 84% on organic samples (p<0.001). Median loads of ESBL producing micro-organisms were 80 (range <20-1360) in conventional, and <20 (range 0-260) CFU/25 g in organic samples (p=0.001). The distribution of ESBL genes in conventional samples and organic samples was 42% versus 56%, respectively (N.S.), for CTX-M-1, 20% versus 42% (N.S.) for TEM-52, and 23% versus 3% (p<0.001) for SHV-12. CTX-M-2 (7%), SHV-2 (5%) and TEM-20 (3%) were exclusively found in conventional samples. Co-resistance rates of ESBL positive isolates were not different between conventional and organic samples (co-trimoxazole 56%, ciprofloxacin 14%, and tobramycin 2%), except for tetracycline, 73% and 46%, respectively, p<0.001). Six of 14 conventional meat samples harbored 4 MLST types also reported in humans and 5 of 10 organic samples harbored 3 MLST types also reported in humans (2 ST10, 2 ST23, ST354). In conclusion, the majority of organic chicken meat samples were also contaminated with ESBL producing E. coli, and the ESBL genes and strain types were largely the same as in conventional meat samples. Copyright © 2011 Elsevier B.V. All rights reserved."
    ],
    "relevance_map": {
      "0": 0,
      "1": 0,
      "2": 0,
      "3": 1,
      "4": 0,
      "5": 1,
      "6": 0,
      "7": 0,
      "8": 0,
      "9": 1
    },
    "query_id": "query_7"
  },
  {
    "query": "Chronic Headaches and Pork Tapeworms",
    "docs": [
      "Background The physical health status of vegetarians has been extensively reported, but there is limited research regarding the mental health status of vegetarians, particularly with regard to mood. Vegetarian diets exclude fish, the major dietary source of eicosapentaenoic acid (EPA) and docosahexaenoic acid (DHA), critical regulators of brain cell structure and function. Omnivorous diets low in EPA and DHA are linked to impaired mood states in observational and experimental studies. Methods We examined associations between mood state and polyunsaturated fatty acid intake as a result of adherence to a vegetarian or omnivorous diet in a cross-sectional study of 138 healthy Seventh Day Adventist men and women residing in the Southwest. Participants completed a quantitative food frequency questionnaire, Depression Anxiety Stress Scale (DASS), and Profile of Mood States (POMS) questionnaires. Results Vegetarians (VEG:n = 60) reported significantly less negative emotion than omnivores (OMN:n = 78) as measured by both mean total DASS and POMS scores (8.32 ± 0.88 vs 17.51 ± 1.88, p = .000 and 0.10 ± 1.99 vs 15.33 ± 3.10, p = .007, respectively). VEG reported significantly lower mean intakes of EPA (p < .001), DHA (p < .001), as well as the omega-6 fatty acid, arachidonic acid (AA; p < .001), and reported higher mean intakes of shorter-chain α-linolenic acid (p < .001) and linoleic acid (p < .001) than OMN. Mean total DASS and POMS scores were positively related to mean intakes of EPA (p < 0.05), DHA (p < 0.05), and AA (p < 0.05), and inversely related to intakes of ALA (p < 0.05), and LA (p < 0.05), indicating that participants with low intakes of EPA, DHA, and AA and high intakes of ALA and LA had better mood. Conclusions The vegetarian diet profile does not appear to adversely affect mood despite low intake of long-chain omega-3 fatty acids.",
      "Background Few studies have focused on the cognitive morbidity of neurocysticercosis (NCC), one of the most common parasitic infections of the central nervous system. We longitudinally assessed the cognitive status and quality of life (QoL) of patients with incident symptomatic NCC cases and matched controls. Methodology/Principal Findings The setting of the study was the Sabogal Hospital and Cysticercosis Unit, Department of Transmissible Diseases, National Institute of Neurological Sciences, Lima, Peru. The design was a longitudinal study of new onset NCC cases and controls. Participants included a total of 14 patients with recently diagnosed NCC along with 14 healthy neighborhood controls and 7 recently diagnosed epilepsy controls. A standardized neuropsychological battery was performed at baseline and at 6 months on NCC cases and controls. A brain MRI was performed in patients with NCC at baseline and 6 months. Neuropsychological results were compared between NCC cases and controls at both time points. At baseline, patients with NCC had lower scores on attention tasks (p<0.04) compared with epilepsy controls but no significant differences compared to healthy controls. Six months after receiving anti-parasitic treatment, the NCC group significantly improved on tasks involving psychomotor speed (p<0.02). QoL at baseline suggested impaired mental function and social function in both the NCC and epilepsy group compared with healthy controls. QoL gains in social function (p = 0.006) were noted at 6 months in patients with NCC. Conclusions/Significance Newly diagnosed patients with NCC in this sample had mild cognitive deficits and more marked decreases in quality of life at baseline compared with controls. Improvements were found in both cognitive status and quality of life in patients with NCC after treatment. Author Summary Neurocysticercosis (NCC) is one of the most common parasitic infections of the central nervous system. Cognitive changes have been frequently reported with this disease but have not been well studied. Our study team recruited a group of new onset NCC cases and a matched set of healthy neighborhood controls and new onset epilepsy controls in Lima, Peru for this study. A neuropsychological battery was administered at baseline and at 6 months to all groups. Brain MRI studies were also obtained on NCC cases at baseline and at 6 months. Newly diagnosed patients with NCC had mild cognitive deficits and more marked decreases in quality of life at baseline compared with controls. Improvements were found in both cognitive status and quality of life in patients with NCC after treatment. This study is the first to assess cognitive status and quality of life longitudinally in patients with NCC and provides new data on an important clinical morbidity outcome.",
      "Tea (Camellia sinensis, Theaceae) and tea polyphenols have been studied for the prevention of chronic diseases, including obesity. Obesity currently affects >20% of adults in the United States and is a risk factor for chronic diseases such as type II diabetes, cardiovascular disease, and cancer. Given this increasing public health concern, the use of dietary agents for the prevention of obesity would be of tremendous benefit. Whereas many laboratory studies have demonstrated the potential efficacy of green or black tea for the prevention of obesity, the underlying mechanisms remain unclear. The results of human intervention studies are mixed and the role of caffeine has not been clearly established. Finally, there is emerging evidence that high doses of tea polyphenols may have adverse side effects. Given that the results of scientific studies on dietary components, including tea polyphenols, are often translated into dietary supplements, understanding the potential toxicities of the tea polyphenols is critical to understanding their potential usefulness in preventing obesity. In this review, we will critically evaluate the evidence for the prevention of obesity by tea, discuss the relevance of proposed mechanisms in light of tea polyphenol bioavailability, and review the reports concerning the toxic effects of high doses of tea polyphenols and the implication that this has for the potential use of tea for the prevention of obesity. We hope that this review will expose areas for further study and encourage research on this important public health issue.",
      "OBJECTIVE: This study investigated the effects of a soy-based low-calorie diet on weight control, body composition, and blood lipid profiles compared with a traditional low-calorie diet. METHODS: Thirty obese adults (mean body mass index 29-30 kg/m(2)) were randomized to two groups. The soy-based low-calorie group consumed soy protein as the only protein source, and the traditional low-calorie group consumed two-thirds animal protein and the rest plant protein in a 1200 kcal/d diet for 8 wk. A diet record was kept everyday throughout the study. Food intake was analyzed before and after the study. Anthropometric data were acquired every week, and biochemical data from before and after the 8-wk experiment were compared. RESULTS: Body weight, body mass index, body fat percentage, and waist circumference significantly decreased in both groups (P < 0.05). The decrease in body fat percentage in the soy group (2.2%, 95% confidence interval 1.6-2.8) was greater than that in the traditional group (1.4%, 95% confidence interval -0.1 to 2.8). Serum total cholesterol concentrations, low-density lipoprotein cholesterol concentrations, and liver function parameters decreased in the soy-based group and were significantly different from measurements in the traditional group (P < 0.05). No significant change in serum triacylglycerol levels, serum high-density lipoprotein cholesterol levels, and fasting glucose levels was found in the soy or traditional group. CONCLUSION: Soy-based low-calorie diets significantly decreased serum total cholesterol and low-density lipoprotein cholesterol concentrations and had a greater effect on reducing body fat percentage than traditional low-calorie diets. Thus, soy-based diets have health benefits in reducing weight and blood lipids.",
      "BACKGROUND: Anecdotal reports and a single case-control epidemiological survey have suggested an association between the helminthic disease neurocysticercosis and primary headache. The present study was undertaken to determine whether neurocysticercosis is more common among patients with primary headaches than in other neurological disorders. METHODS: We determined the prevalence of neurocysticercosis in a cohort of patients with primary headache who were seen at our institution over a 20-year period. We used as controls all people from the same cohort with four major different categories of neurological disorders, including cerebrovascular disease, degenerative disorders of the CNS, head trauma, and primary brain tumors. We evaluated differences in the prevalence of neurocysticercosis between patients and controls. RESULTS: Forty-eight of 1017 patients with primary headache and 31 of 1687 controls had neurocysticercosis (4.7% vs 1.8%, p < 0.0001). Calcified parenchymal brain cysticerci were more frequent among patients with primary headache than in those with cerebrovascular disease (4.7% vs 1%, p < 0.001), degenerative disorders of the CNS (4.7% vs 2.4%, p < 0.05), and head trauma (4.7% vs 2.3%, p < 0.05). There were no significant differences, however, for the subset of controls with primary brain tumors (4.7% vs 3.5%), a condition that has also been associated with neurocysticercosis. CONCLUSIONS: There is a relationship between calcified neurocysticercosis and primary headache disorders. It is possible that periodic remodeling of cysticercotic calcifications, with liberation of antigens to the brain parenchyma, contributes to the occurrence of headache in these patients.",
      "Due to the increased demand and consumption of bottled water in the United States, there has been a growing concern about the quality of this product. Retail outlets sell local as well as imported bottled water to consumers. Three bottles for each of 35 different brands of bottled water were randomly collected from local grocery stores in the greater Houston area. Out of the 35 different brands, 16 were designated as spring water, 11 were purified and/or fortified tap water, 5 were carbonated water and 3 were distilled water. Chemical, microbial and physical properties of all samples were evaluated including pH, conductivity, bacteria counts, anion concentration, trace metal concentration, heavy metal and volatile organics concentration were determined in all samples. Inductively coupled plasma/mass spectrometry (ICPMS) was used for elemental analysis, gas chromatography with electron capture detector (GCECD) as well as gas chromatography mass spectrometry (GCMS) were used for analysis of volatile organics, ion chromatography (IC) and selective ion electrodes were used for the analysis of anions. Bacterial identification was performed using the Biolog software (Biolog, Inc., Hayward, Ca, USA). The results obtained were compared with guidelines of drinking water recommended by the International Bottled Water Association (IBWA), United States Food and Drug Administration (FDA), United States Environmental Protection Agency (EPA) and the World Health Organization (WHO) drinking water standard. The majority of the analyzed chemicals were below their respective drinking water standards for maximum admissible concentrations (MAC). Volatile organic chemicals were found to be below detection limits. Four of the 35 brands of the bottled water samples analyzed were found to be contaminated with bacteria.",
      "The importance of dietary sulforaphane in helping maintain good health continues to gain support within the health-care community and awareness among U.S. consumers. In addition to the traditional avenue for obtaining sulforaphane, namely, the consumption of appropriate cruciferous vegetables, other consumer products containing added glucoraphanin, the natural precursor to sulforaphane, are now appearing in the United States. Crucifer seeds are a likely source for obtaining glucoraphanin, owing to a higher concentration of glucoraphanin and the relative ease of processing seeds as compared to vegetative parts. Seeds of several commonly consumed crucifers were analyzed not only for glucoraphanin but also for components that might have negative health implications, such as certain indole-containing glucosinolates and erucic acid-containing lipids. Glucoraphanin, 4-hydroxyglucobrassicin, other glucosinolates, and lipid erucic acid were quantified in seeds of 33 commercially available cultivars of broccoli, 4 cultivars each of kohlrabi, radish, cauliflower, Brussels sprouts, kale, and cabbage, and 2 cultivars of raab.",
      "A method for culturing cysticerci that allows successful evagination and growth of scolexes from metacestodes of Taenia solium was used to study the survival of cysticerci subjected to low temperatures. Refrigeration of pork muscle infested with cysticerci at temperatures above 0 degrees C did not affect the parasites' survival in culture. Conversely, freezing of meat prevented survival of cysts. A practical procedure to kill cysticerci is the storage of pork muscle for four days at -5 degrees C, three days at -15 degrees C, or one day at -24 degrees C. These simple measures would help prevent the most frequent parasitosis of man's central nervous system.",
      "Background: Vegetarianism is associated with a lower risk of cardiovascular disease. However, studies of arterial function in vegetarians are limited. Methods: This study investigated arterial function in vegetarianism by comparing 49 healthy postmenopausal vegetarians with 41 age-matched omnivores. The arterial function of the common carotid artery was assessed by carotid duplex, while the pulse dynamics method was used to measure brachial artery distensibility (BAD), compliance (BAC), and resistance (BAR). Fasting blood levels of glucose, lipids, lipoprotein (a), high-sensitivity C-reactive protein, homocysteine, and vitamin B12 were also measured. Results: Vegetarians had significantly lower serum cholesterol, high-density and low-density lipoprotein, and glucose compared with omnivores. They also had lower vitamin B12 but higher homocysteine levels. Serum levels of lipoprotein (a) and high-sensitivity C-reactive protein were no different between the two groups. There were no significant differences in carotid beta stiffness index, BAC, and BAD between the two groups even after adjustment for associated covariates. However, BAR was significantly lower in vegetarians than in omnivores. Multiple linear regression analysis revealed that age and pulse pressure were two important determinants of carotid beta stiffness index and BAD. Vegetarianism is not associated with better arterial elasticity. Conclusion: Apparently healthy postmenopausal vegetarians are not significantly better in terms of carotid beta stiffness index, BAC, and BAD, but have significantly decreased BAR than omnivores. Prevention of vitamin B12 deficiency might be beneficial for cardiovascular health in vegetarians.",
      "Bisphenol A (BPA) and bisphenol B (BPB) concentrations were determined in peeled canned tomatoes of different brands bought in Italian supermarkets. Tomato samples analyzed were packaged in cans coated with either epoxyphenolic lacquer or low BADGE enamel. A solid phase extraction (SPE) was performed on C-18 Strata E cartridge followed by a step on Florisil cartridge. Detection and quantitation were performed by a reversed phase high-performance liquid chromatography (RP-HPLC) method with both UV and fluorescence detection (FD). On the total of 42 tested tomato samples, BPA was detected in 22 samples (52.4%), while BPB was detected in 9 samples (21.4%). BPA and BPB were simultaneously present in 8 of the analyzed samples. The levels of BPA found in this study are much lower than the European Union migration limits of 3 mg/kg food and reasonably unable to produce a daily intake exceeding the limit of 0.05 mg/kg body weight, established by European Food Safety Authority."
    ],
    "relevance_map": {
      "0": 0,
      "1": 1,
      "2": 0,
      "3": 0,
      "4": 1,
      "5": 0,
      "6": 0,
      "7": 1,
      "8": 0,
      "9": 0
    },
    "query_id": "query_8"
  },
  {
    "query": "Treating Asthma With Plants vs. Supplements?",
    "docs": [
      "This article describes the nutrient and elemental composition, including residues of herbicides and pesticides, of 31 soybean batches from Iowa, USA. The soy samples were grouped into three different categories: (i) genetically modified, glyphosate-tolerant soy (GM-soy); (ii) unmodified soy cultivated using a conventional \"chemical\" cultivation regime; and (iii) unmodified soy cultivated using an organic cultivation regime. Organic soybeans showed the healthiest nutritional profile with more sugars, such as glucose, fructose, sucrose and maltose, significantly more total protein, zinc and less fibre than both conventional and GM-soy. Organic soybeans also contained less total saturated fat and total omega-6 fatty acids than both conventional and GM-soy. GM-soy contained high residues of glyphosate and AMPA (mean 3.3 and 5.7 mg/kg, respectively). Conventional and organic soybean batches contained none of these agrochemicals. Using 35 different nutritional and elemental variables to characterise each soy sample, we were able to discriminate GM, conventional and organic soybeans without exception, demonstrating \"substantial non-equivalence\" in compositional characteristics for 'ready-to-market' soybeans. Copyright © 2013 The Authors. Published by Elsevier Ltd.. All rights reserved.",
      "Following a heart-healthy diet to lower cholesterol levels is often assumed to be difficult, to be burdensome, and to have a negative impact on quality of life (QOL). The purpose of this study was to evaluate the impact of medical nutrition therapy (MNT) versus usual care (UC) for hypercholesterolemia on patient satisfaction and QOL. Ninety ambulatory care patients (60 men and 30 women), age 28 to 66, were randomly assigned to receive either MNT from dietitians using a National Cholesterol Education Program-based protocol or UC from their physicians. Patients who received MNT reported no difference in QOL related to the taste or enjoyment of food compared with UC patients. However, the MNT group reported initial improvements in QOL related to the convenience and cost of following a low-fat diet when compared with the UC group. The MNT group also reported significant and lasting improvements in perceived QOL related to self-care compared with the UC group. MNT patients were more satisfied with the interaction at visits, knowledge and ability to manage their cholesterol, eating habits, appearance, time spent exercising, and life in general. Moreover, MNT patients did not report any negative impact related to following a low-fat diet in regard to feeling restricted by diet; interference with lifestyle activities; or difficulty planning, purchasing, or preparing meals or eating away from home. Contrary to popular belief there is no apparent reduction but rather an improvement in some measures of QOL and patient satisfaction with MNT for hypercholesterolemia.",
      "Attention deficit hyperactivity disorder (ADHD) is one of the most common behavioral disorders in children. Symptoms of ADHD include hyperactivity, low frustration tolerance, impulsivity, and inattention. While the biological pathways leading to ADHD are not clearly delineated, a number of genetic and environmental risk factors for the disorder are recognized. In the early 1970s, research conducted by Dr. Benjamin Feingold found that when hyperactive children were given a diet free of artificial food additives and dyes, symptoms of hyperactivity were reduced. While some clinical studies supported these findings, more rigorous empirical studies conducted over the next 20 years were less positive. As a result, research on the role of food additives in contributing to ADHD waned. In recent years, however, interest in this area has revived. In response to more recent research and public petitions, in December 2009 the British government requested that food manufacturers remove most artificial food dyes from their products. While these strictures could have positive effects on behavior, the removal of food dyes is not a panacea for ADHD, which is a multifaceted disorder with both biological and environmental underpinnings. © 2011 International Life Sciences Institute.",
      "BACKGROUND: Antioxidant-rich diets are associated with reduced asthma prevalence in epidemiologic studies. We previously showed that short-term manipulation of antioxidant defenses leads to changes in asthma outcomes. OBJECTIVE: The objective was to investigate the effects of a high-antioxidant diet compared with those of a low-antioxidant diet, with or without lycopene supplementation, in asthma. DESIGN: Asthmatic adults (n = 137) were randomly assigned to a high-antioxidant diet (5 servings of vegetables and 2 servings of fruit daily; n = 46) or a low-antioxidant diet (≤2 servings of vegetables and 1 serving of fruit daily; n = 91) for 14 d and then commenced a parallel, randomized, controlled supplementation trial. Subjects who consumed the high-antioxidant diet received placebo. Subjects who consumed the low-antioxidant diet received placebo or tomato extract (45 mg lycopene/d). The intervention continued until week 14 or until an exacerbation occurred. RESULTS: After 14 d, subjects consuming the low-antioxidant diet had a lower percentage predicted forced expiratory volume in 1 s and percentage predicted forced vital capacity than did those consuming the high-antioxidant diet. Subjects in the low-antioxidant diet group had increased plasma C-reactive protein at week 14. At the end of the trial, time to exacerbation was greater in the high-antioxidant than in the low-antioxidant diet group, and the low-antioxidant diet group was 2.26 (95% CI: 1.04, 4.91; P = 0.039) times as likely to exacerbate. Of the subjects in the low-antioxidant diet group, no difference in airway or systemic inflammation or clinical outcomes was observed between the groups that consumed the tomato extract and those who consumed placebo. CONCLUSIONS: Modifying the dietary intake of carotenoids alters clinical asthma outcomes. Improvements were evident only after increased fruit and vegetable intake, which suggests that whole-food interventions are most effective. This trial was registered at http://www.actr.org.au as ACTRN012606000286549.",
      "To assess the physiologic effects of cherry consumption, we measured plasma urate, antioxidant and inflammatory markers in 10 healthy women who consumed Bing sweet cherries. The women, age 22-40 y, consumed two servings (280 g) of cherries after an overnight fast. Blood and urine samples were taken before the cherry dose, and at 1.5, 3 and 5 h postdose. Plasma urate decreased 5 h postdose, mean +/- SEM = 183 +/- 15 micro mol/L compared with predose baseline of 214 +/- 13 micro mol/L (P < 0.05). Urinary urate increased postdose, with peak excretion of 350 +/- 33 micro mol/mmol creatinine 3 h postdose compared with 202 +/- 13 at baseline (P < 0.01). Plasma C-reactive protein (CRP) and nitric oxide (NO) concentrations had decreased marginally 3 h postdose (P < 0.1), whereas plasma albumin and tumor necrosis factor-alpha were unchanged. The vitamin C content of the cherries was solely as dehydroascorbic acid, but postdose increases in plasma ascorbic acid indicated that dehydroascorbic acid in fruits is bioavailable as vitamin C. The decrease in plasma urate after cherry consumption supports the reputed anti-gout efficacy of cherries. The trend toward decreased inflammatory indices (CRP and NO) adds to the in vitro evidence that compounds in cherries may inhibit inflammatory pathways.",
      "BACKGROUND: Allergic diseases have risen in prevalence over recent decades. The aetiology remains unclear but is likely to be a result of changing lifestyle and/or environment. A reduction in antioxidant intake, consequent to reduced intake of fresh fruits and vegetables, has been suggested as a possible cause. OBJECTIVE: To investigate whether dietary antioxidant intake at age 5 was related to atopy at 5 and 8 years of age amongst children in an unselected birth cohort. METHODS: Children were followed from birth. Parents completed a validated respiratory questionnaire and children were skin prick tested at 5 and 8 years of age. Serum IgE levels were measured at age 5. At age 5, antioxidant intake was assessed using a semi-quantitative food frequency questionnaire (FFQ). A nutrient analysis program computed nutrient intake, and frequency counts of foods high in the antioxidant vitamins A, C and E were assessed. RESULTS: Eight hundred and sixty-one children completed both the respiratory and FFQ. Beta-carotene intake was associated with reduced risk of allergic sensitization at age 5 [0.80 (0.68-0.93)] and 8 [0.81 (0.70-0.94)]. In addition, beta-carotene intake was negatively associated with total IgE levels (P = 0.002). Vitamin E intake was associated with an increased risk of allergic sensitization [1.19 (1.02-1.39)], only at age 5. There was no association between antioxidant intakes and wheeze or eczema. CONCLUSION: Increased beta-carotene intake was associated with a reduced risk of allergic sensitization and lower IgE levels, in 5- and 8-year-old children. Dietary antioxidants may play a role in the development of allergic sensitization.",
      "Objective: To determine if a supplement of soy protein improves body composition, body fat distribution, and glucose and insulin metabolism in non-diabetic postmenopausal women compared to an isocaloric casein placebo. Design: Randomized, double-blind, placebo-controlled 3-month trial Setting: Clinical Research Center Patients: 15 postmenopausal women Interventions: CT scans at L4/L5, dual energy x-ray absorptiometry (DXA), hyperglycemic clamps Main outcome measures: Total fat, total abdominal fat, visceral fat, subcutaneous abdominal fat, and insulin secretion. Results: Weight by DXA did not change between groups (+1.38 ± 2.02 kg for placebo vs. +0.756 ± 1.32 kg for soy, p=0.48, means ± S.D.). Total and subcutaneous abdominal fat increased more in the placebo compared to the soy group (for differences between groups in total abdominal fat: +38.62 ± 22.84 cm2 for placebo vs. −11.86 ± 31.48 cm2 for soy, p=0.005; subcutaneous abdominal fat: +22.91 ± 28.58 cm2 for placebo vs. −14.73 ± 22.26 cm2 for soy, p=0.013). Insulin secretion, visceral fat, total body fat, and lean mass did not differ between groups. Isoflavone levels increased more in the soy group. Conclusion: A daily supplement of soy protein prevents the increase in subcutaneous and total abdominal fat observed with an isocaloric casein placebo in postmenopausal women.",
      "Allergic disorders encompass skin, food and respiratory allergies. Sensitization to a normally harmless allergen results in the immune system being biased to a predominant T-helper type 2 response. Re-exposure to the same allergen leads to a robust secretion of allergy-related mediators that eventually triggers symptoms. Our understanding of these disorders has enabled the search of therapeutic approaches that can either modulate the sensitization process or impact on allergic mediators, thus helping manage allergic symptoms. Polyphenols are one such class of compounds that are found in foods and plant sources and have been investigated for their anti-allergic effect in different disease models and in human clinical trials. Their anti-inflammatory profile is known to impact on the recruitment of immune cells to the skin and in preventing the development of secondary infections following disruption of the skin barrier. The interaction of polyphenols with proteins can modulate the process of allergic sensitization and their direct effect on allergic effector cells such as mast cells inhibit mediator release, resulting in the alleviation of symptoms. In addition, their endogenous anti-oxidant ability limits the extent of cellular injury from free radicals during the allergic insult. Overall, polyphenols hold promise as anti-allergy agents capable of influencing multiple biological pathways and immune cell functions in the allergic immune response and deserve further investigation. The objective of the current review is to summarize the key findings and progress made in studying polyphenols as anti-allergic ingredients. Special emphasis is placed in this review to highlight key physiological, cellular and signalling pathways implicated in the mechanism of action of different polyphenols in the context of allergic disorders and their manifestations. © 2011 Blackwell Publishing Ltd.",
      "The objective of this study was to determine the prevalence of enterohemorrhagic Escherichia coli (EHEC), E. coli O157, Salmonella, and Listeria monocytogenes in retail food samples from Seattle, Wash. A total of 2,050 samples of ground beef (1,750 samples), mushrooms (100 samples), and sprouts (200 samples) were collected over a 12-month period and analyzed for the presence of these pathogens. PCR assays, followed by culture confirmation were used to determine the presence or absence of each organism. Of the 1,750 ground beef samples analyzed, 61 (3.5%) were positive for EHEC, and 20 (1.1%) of these were positive for E. coli O157. Salmonella was present in 67 (3.8%) of the 1,750 ground beef samples. Of 512 ground beef samples analyzed, 18 (3.5%) were positive for L. monocytogenes. EHEC was found in 12 (6.0%) of the 200 sprout samples, and 3 (1.5%) of these yielded E. coli O157. Of the 200 total sprout samples, 14 (7.0%) were positive for Salmonella and none were positive for L. monocytogenes. Among the 100 mushroom samples, 4 (4.0%) were positive for EHEC but none of these 4 samples were positive for E. coli O157. Salmonella was detected in 5 (5.0%) of the mushroom samples, and L. monocytogenes was found in 1 (1.0%) of the samples.",
      "The brain is a highly compartmentalized organ exceptionally susceptible to accumulation of metabolic errors. Alzheimer's disease (AD) is the most prevalent neurodegenerative disease of the elderly and is characterized by regional specificity of neural aberrations associated with higher cognitive functions. Aluminum (Al) is the most abundant neurotoxic metal on earth, widely bioavailable to humans and repeatedly shown to accumulate in AD-susceptible neuronal foci. In spite of this, the role of Al in AD has been heavily disputed based on the following claims: 1) bioavailable Al cannot enter the brain in sufficient amounts to cause damage, 2) excess Al is efficiently excreted from the body, and 3) Al accumulation in neurons is a consequence rather than a cause of neuronal loss. Research, however, reveals that: 1) very small amounts of Al are needed to produce neurotoxicity and this criterion is satisfied through dietary Al intake, 2) Al sequesters different transport mechanisms to actively traverse brain barriers, 3) incremental acquisition of small amounts of Al over a lifetime favors its selective accumulation in brain tissues, and 4) since 1911, experimental evidence has repeatedly demonstrated that chronic Al intoxication reproduces neuropathological hallmarks of AD. Misconceptions about Al bioavailability may have misled scientists regarding the significance of Al in the pathogenesis of AD. The hypothesis that Al significantly contributes to AD is built upon very solid experimental evidence and should not be dismissed. Immediate steps should be taken to lessen human exposure to Al, which may be the single most aggravating and avoidable factor related to AD."
    ],
    "relevance_map": {
      "0": 0,
      "1": 0,
      "2": 0,
      "3": 1,
      "4": 0,
      "5": 1,
      "6": 0,
      "7": 1,
      "8": 0,
      "9": 0
    },
    "query_id": "query_9"
  }
]