[
  {
    "query": "Religion simply justifies reactionary views which many find offensive. There is no reason for vitriol to be tolerated just because it presents a mask of religion.  Views on issues such as abortion, women, and what constitutes an acceptable family expressed by those who are extremely religious are simply bigoted views which are given credibility by being wrapped in a cassock.  It is in the nature of religious belief that any set of views can adopt a religious justification and there is no objective measure against which to hold the views. For example the homophobic views which have common currency in many churches can be contrasted with a gay liberation trend discernible in others. In the light of this, it makes sense to judge the views on their own basis, regardless of the religiosity surrounding them.  The views expressed by Harry Hammond, and others [1] , need to be stripped of their religious veneer and shown that at their heart they are simply offensive. There is absolutely no reason why LGBT people should have to endure vitriol and condemnation as they go about their daily lives. It is a useful exercise to consider how we would respond to a secular speaker saying that the actions of two people who were in love with each other should condemn them to torment and suffering. Oddly however, the moment this is done in the name of God, it somehow becomes acceptable.  [1] Blake, Heidi. “Christian Preacher Arrested for Saying Homosexuality is a Sin”. The Daily Telegraph, 2 May 2010.",
    "docs": [
      "This argument only works under the assumption that we live in a society where divorce does not exist. If a person enters into a marriage without full awareness of what they have committed to and later need to get out of that marriage, they are free to.  Being able to leave a marriage, though, does not make marriage a meaningless charade, as the proposition claims. It is still more difficult to leave a marriage than it is to leave a non-marital committed relationship and so it makes a big difference.",
      "The state has had no historical role in sex education to no ill effect, so should it develop one now.  Sexuality should not be within the purview of the state. The state maintains order and security and provides essential services. Sex education does not fall within its responsibility. Sexuality is for many people deeply personal and should be respected as such; young people should be allowed to explore their sexuality independently and with the guidance of family, not under the watching eye of the state. [1] Sex education programs reduce sexuality to biology and fail to adequately address the emotional elements of sexuality in a way that is not seen as a joke by often-immature students. Inevitably teachers’ personal opinions on sexuality will bleed into their teaching, as will that of the state officials that set the teaching standards for the subject. In this way there is always a normative judgment in sex education that will be seen as the state mandating certain sexual behaviour and practice. This fundamentally attacks the rights of individuals to develop their mode of sexual expression independent of the nanny state’s instruction and can irrevocably harm peoples’ sexual identity.  [1] Lord, Condom Nation, 2009",
      "Mobile phones lead to increased independence  Mobile phones bring us increased independence. Being able to use a mobile phone is clearly a basic skill to allow children to be independent. It means that they are not dependent on an adult being with them for parents to know where they are. The main reason for parents being unwilling to let children out on their own is fear for their safety. This is a fear that mobiles help prevent. This increased independence has other benefits, such as teaching us to be responsible for ourselves.",
      "defence house believes all nations have right nuclear weapons Government legitimacy is defined in its most limited form as the ability to provide security and stability within its jurisdiction. It seems fair to say that international institutions and states with a stake in international order, as most do, will have an interest in keeping nuclear weapons out of the hands of failing and failed states, which do not retain the same legitimacy of states that can provide the baseline of security to their people. Furthermore, the openness created by the public recognition of the right to nuclear weapons will allow advanced countries to offer assistance in security and protection of nuclear stockpiles, making it less likely that nuclear weapons will fall into the hands of terrorists.",
      "Other taxes try to change behaviour  Taxes that try to change people’s behaviour on things that are not liked have been used since the 16th century, and are commonly applied to alcohol, smoking and gambling.  In the US, when cigarette prices went up 4%, use dropped by 10% [11]. As this worked with tobacco, which creates similar health problems to obesity, this tried and tested strategy can work.  Research has shown that when the price of unhealthy food goes up, people eat less of it [12]. A fat tax would make people healthier.",
      "Such progress has been self-serving, with many of the economic gains made by Han Settlers. Secondly it has come at the cost of Tibetan culture and the very national identity that Tibetans hold dear.  It is also absurd to suggest that these gains would disappear upon independence. Tibet would likely seek to continue to trade with China, and if that is not possible, there would be opportunities to gain investment from India or the West. The benefits of such trade could then be used to help the Tibetans themselves rather than Han settlers. As Ten Zin Samphel, a leader of the Tibetan community in Britain remarks \"At the moment, the economic development is for the benefit of the Chinese… If Tibet were free, we could develop it ourselves.\" [1]  [1] McGivering, Jill, ‘China’s quandary over Tibet’s future’, BBC News, 20 March 2008,",
      "Gay marriage is good for society  Gay marriage has clear and tangible positive effects on societies where it is permitted. There are now ten countries that allow gay marriage, with no obvious or noticeable detriment to society at large. As Chris Ott reports from Massachusetts, one of few US states to grant gay marriage rights, ‘predictably, the sky hasn’t fallen…ensuring equality doesn’t mean there’s less to go around for everyone else’ 1. Further to that, gay marriage encourages gay adoption, granting a home and a loving environment for an increasing number of orphaned or unwanted children worldwide. The evidence also suggests that gay parenting is ‘at least as favourable’ as those in heterosexual families, eroding fears that the adopted children will be worse with gay parents 2 . The economist Thomas Kostigen also argues gay marriage is a boost for the economy, ‘weddings create revenue of all sorts…even if a marriage doesn’t work out that helps the economy too. Divorces cost money’ 3. Finally, and most simply, societies benefit from the net utility of their citizens, to allow and even encourage gay marriage ensures that those gay citizens wishing to celebrate their love are able to do so, in an environment conducive to their mutual happiness.  1. Ott, (2005)  2. Short, Riggs, Perlesz, Brown, &amp; Kane, (2007), p.25  3. Kostigen, (2009)",
      "living difference house would penalise religious hate speech Religious belief is the most widely used and historically enduring framework for discussion of the universe around us and our place and role within it. Pretending that it not part of civic discourse is simply living in a fantasy world. The views expressed by Hammond are widely and genuinely held and deserve to be heard. Those who oppose them should, of course, be free to do so. Simply banning their expression doesn’t make the views go away. However impossible opposing sides in this argument may believe it to be, the other side could be right, that gives them the right to be heard [1] .  [1] Tatchell, Peter, ‘Lords are right to limit homophobic hatred law’, 10 July 2009.",
      "ary teaching international africa house believes lack investment teachers Fundamentally, structures cannot be changed without development. Human capital however, provides a means of development. Studies have shown the positive role human capital - a composite measure of education and knowledge - has on a nation’s development.  The AfDB have shown that enhanced human capital amongst Africa’s young population is empowering change - promoting good governance and post-conflict recovery; and intrinsic to economic growth (Diawara, 2011). In other words teachers need investment to educate the youths in order to overcome these barriers to universal education.",
      "primary secondary health health general house would provide breakfast all 0 Government should focus on the most needy  A primary responsibility of the government is for reducing inequality and ensuring that everyone has a basic living standard. A basic living standard includes food. As a result providing breakfasts should be for those who are most in need of a helping hand from government. Those who are wealthier and can afford their own breakfast do not need this help so any such breakfast policy should be means tested to only apply to those who need it. This is the case with the United States School Breakfast Program."
    ],
    "relevance_map": {
      "0": 0,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 1,
      "8": 0,
      "9": 0
    },
    "query_id": "query_0",
    "num_docs": 10
  },
  {
    "query": "The people are interested in the health of their leader  The health of the leader of the state is an issue that the people and the media inevitably want to know about. There will always be a lot of interest in it. Occasionally this can be played by the administration as with Kissinger saying he was ill and using time to fly to Beijing to arrange for Nixon’s visit without press attention. But most of the time keeping things from the press is purely negative; it drives rumors.  This was the case of John Atta Mills, people were not allowed to know about his health. The presidential staff and communication members constantly lied about his health but there were two reports that he had died. Mills spent time in a US hospital, on returning to Ghana, he was made to jog around the airport to show the media that he was healthy. 1  1 Committee for Social Advocacy, 'Who and what killed President John Evans Atta Mills?', Modern Ghana, 13 August 2012,",
    "docs": [
      "free speech and privacy health general international africa politics The media always want a good story; they are interested in the health of celebrities when there is no clear reason why they should have any right to this private information. The health of the leader is not something that the press or public needs to know about unless it is an illness that is likely to affect the president’s capacity to make decisions. A government’s decision should not be based upon the possibility that information on the leader’s health will leak and should take a consistent line that it is a private matter or provide a bare minimum of information.",
      "NATO allows burden-sharing and specialization amongst its members  For many members, maintaining a fully operational military that has all the required capabilities (air, sea and land plus required logistics) is impossible: they don’t have enough budget, manpower or political will to maintain a full military. NATO allows members to share their burdens and to specialise. Examples of this are NATO’s AWACS-aircraft (Airborne Warning &amp; Control System) and NATO’s Strategic Airlift Capability. Both are instances of NATO-allies pooling resources and sharing burdens. [1]  [1] NATO. AWACS: NATO’s ‘eye in the sky’.",
      "Foreign policy should follow the will of the people  Sanctions are not the will of the American people but of a small minority of embittered Cuban Americans in Florida who are being pandered to due to their importance in elections in a swing state. [1] Congressman Charles Rangel argues that the only success of the sanctions policy has been to “appease the Republican constituency in Florida”. [2] National opinion generally expresses no preference or opposes the ban, in a 2009 CBS poll asking \"Do you think the United States should or should not re-establish diplomatic and trade relations with Cuba?\" 67% said should. [3] Sanctions remaining in place is electioneering government at its worst, domestic interest groups controlling government foreign policy. As Karl Rove has admitted \"When people mention Cuba to me, it makes me think of three things: Florida, Florida, and Florida.\" [4]  [1] Griswold, Daniel, ‘Four Decades of Failure: The U.S. Embargo against Cuba’, 2005.   [2] DeYoung, Karen, ‘Sanctions Against Cuba Are Excessive, GAO Says’, 2007.   [3] Pollingreport.com, ‘Cuba’.   [4] Rosenthal, Joel H., ‘The Cuba Wars: Fidel Castro, the United States and the Next Revolution’, 2009.",
      "eral philosophy political philosophy house would limit right trial jury some First, there are checks in place to help prevent biased decisions and second, the less objective nature of juries is not necessarily bad. First, in most jury systems, a judge can overturn a guilty verdict if s/he believes that the jury made a faulty decision1. Judges can also order retrials in cases of guilty verdicts, if they believe there were procedural errors. Furthermore, in most countries there is a phase of the jury selection process in which both the prosecution and defence can object to a juror; in many countries each side gets a specific number of these unconditional 'peremptory challenges.' That allows blatantly biased jurors to be excluded. Perhaps most importantly, at least with juries there are multiple people making the decision, as opposed to a sole judge: there is no reason to assume that a lone judge will be less biased, just because of his 'professional training.' But second, having a subjective body making the decision is not necessarily bad. We obviously don't want people to be swayed by unchecked prejudices, but one of the points of having a jury is that it allows all parts of the community to participate in the judicial process and provide input that disconnected and often homogenous government officials cannot. For example, the Diplock courts established in 1970s Northern Ireland eliminated juries, and along with them, jury bias. This resulted in higher conviction rates for violent offenders, but also had the negative effect of excluding the Catholic minority from the administration of justice (and judge bias remained, as evidence by the failure of the courts to eliminate the gap between Catholic and Protestant conviction rates).2  1Andrew D. Stine, P.A. \"Can a Judge Overturn a Jury Vedict?\"  2Laura K. Donohue, \"Terrorism and Trial by Jury: The Vices and Virtues of British and American Criminal Law\"",
      "Reality shows are real; they are real people operating without scripts and often, live. The fact that characters are often cast to encourage disagreements or tension does not take away from the reality of the program, in fact it only adds to it. The unrealistic settings of shows like Big Brother and Survivor do not take away from the educational value of observing how they cope. In fact, without such shows, most people would have little concept of how a group of strangers would be able to survive, co-operate and develop in such environments. As Time describes, 'they provoke, they offend but at least it's trying to do something besides help you get to sleep'. The insight therefore into the human condition is invaluable, and it is little surprise that viewers are eager to watch such programs. What is real is not always the same as what is normal, the events on Survivor Island are no less real for being in an unrealistic setting.",
      "political philosophy politics government society house believes socialism dead Trying to pretend that absolutely anyone who disagrees in some way with the architects of the banking bubble can be described as a Socialist is simply taking things too far.  Many people are suffering as a result of austerity measures and it is interesting that in countries with left wing governments the protests support the right and vice versa. This has nothing to do with the emergence of Socialism for the 21st century – however desperately the Socialists of the 20th century may wish it.  The closest even the most ardent supporters of the current protests can get is that ‘things should be different’ other than that it tends to be a round of decidedly nineteenth century solutions to nineteenth century problems",
      "Engagement will still occur. The software exists to aid in uprisings, which is the endpoint of the regime, or at least a signal of its imminent change. It is a play that Western governments should back on a human as well as political level. The subsidies and incentives, furthermore, can be sufficient to compensate companies if things do indeed go sour. This would be expected, in fact, since the companies, acting rationally will have to be coaxed into producing and supplying this technology.",
      "europe politics government local government house believes northern ireland We are at peace now. The Good Friday Agreement has created stability, with the exception of occasional outbreaks but nothing like the horror of The Troubles. We do not need re-unification to have stability. In fact, the positive outcome that might happen is unsure and not a reason worth gambling on.  It is likely that there will be conflict in the beginning. Such a huge move will come to Unionists as a shock and without knowing how much power they will have, having to answer to Dublin, it is likely that paramilitary activities will flare up again. This will, of course, spark off IRA and other Republican attacks. If escalations get worse, the British may intervene as well as the Irish army and there may be an entire repeat of The Troubles.",
      "Banning the burning of flags does not in any way ban opinions about the state or the ideals the flag represents. Arson is an essential tool in the quest for reform. Rather than using such methods that do more to offend than to inform, protestors should focus on actually starting measured discourse in a way that is not simply offensive.",
      "education general secondary crime policing house supports random drug testing Drug users' decisions are influenced by an irrational desire to fulfil the chemical need they feel (to get their 'high'). As a consequence many drug users in schools will simply look for ways to evade drug testing regimes that are put in place. This is a problem as drug testing is most likely to catch cannabis users (the most widely-used drug among teenagers) [1] , as cannabis endures longer in the body than other more dangerous drugs such as heroin and cocaine. This can potentially lead would-be cannabis users to switch to these harder drugs, most of which generally have significantly shorter detection times and/or are less likely to be tested for. [2] This harm clearly outweighs the benefits of catching or deterring a few more cannabis users.  [1] Department of Health. “Statistics on young people and drug misuse: England, 2003”.   [2] Rosenbaum, Marsha. “Safety First: A Reality-Based Approach to Teens and Drugs”. Drug Policy Alliance. January 1, 2007"
    ],
    "relevance_map": {
      "0": 1,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "query_1",
    "num_docs": 10
  },
  {
    "query": "Self-determination can destabilise nation states, sometimes with very destructive consequences.  If we accept self-determination as such an important principle that it trumps all others, this will encourage people to self-identify along nationalistic, racial or religious lines, at a time in human development when we are moving away from racist and nationalist ideologies. Nationalism is about difference, which flies in the face of the idea of the global citizen. Taken to its extremes, it encourages increased conflict, separatist terrorism. For example, the ethnic conflicts that led to the breakup of Yugoslavia in the 1990s were fuelled by nationalist ideologies and the stressing of the differences between ethnic and religious groups that made up that country.",
    "docs": [
      "human rights international law politics government warpeace house would recognise The deterrent effect of the Court ensures wide-spread and equal adherence to international law.  Upon signing the Rome Statute in 1996, U.N. Secretary General Kofi Annan stated that 'the establishment of the Court is still a gift of hope to future generations, and a giant step forward in the march towards universal human rights and the rule of law'1. Such statements demonstrate the impact the Court could potentially have, as a body that simultaneously cherishes sovereignty and protects national courts whilst offering a means by which criminals in states unable or unwilling to prosecute will still be brought to justice. As the natural and permanent heir to the process started at Nuremberg in the wake of World War II2, the ICC ensures that the reach of law is now universal; war criminals, either in national or international courts, will be forced to trial as a result of the principle of universal jurisdiction1. The deterrent effect of such a court is obvious and a warning to those who felt they were operating in anarchic legal environments.  1 Amnesty International. (2007, September). Fact Sheet: International Criminal Court. Retrieved May 11, 2011  2 Crossland, D. (2005, November 23). Nuremberg Trials a Tough Act to Follow. Retrieved May 11, 2011, from Spiegel International",
      "Implies ultimate power on the part of the state  The words “under God” reaffirm individual rights of American citizens as divine and coming from above the state. These words show that taking away these rights is not even within the conceivable grasp of the state. Removal of these words puts power back into the hands of the state and reinforces the state as the ultimate authority over what happens to its people. (The American Center for Law and Justice 2004)",
      "The creation of such a law would strengthen trends toward paternalist law making  When couples choose not to get married, perhaps because one party is not willing to do so, this does not indicate the same commitment to each other. Where there are considerable disparities in income or wealth couples may have no desire to divide their assets and the choice not to get married may reflect this. Those who desire financial protection can choose to marry but the state should not intervene when couples do not make this choice, beyond ensuring that provision is made for children. Such intervention undermines the autonomy of individuals within cohabiting couples because it suggests that they cannot make these decisions competently for themselves.",
      "That system is based on security risk, not the actual offence per se. There is no extra punitive value attached to the offence in terms of prison conditions for the pure reason of the offence.  The reason why those inmates are kept separate is for their own safety (capital punishment should not be meted out by other prisoners!), not based on any ideal of punishment.",
      "international law philosophy political philosophy politics government house believes In many cass, it is not self-determination that causes tensions, but the lack of opportunity for minorities to choose their own future. Conflicts and civil wars generally take place not because people want self-determination but because they are not allowed it. In the Yugoslav example, if the Milosevic government had recognised the right of the country's component ethnic groups to self-determination, rather than seeking forcibly to suppress it, then there would have been no armed conflict. In contrast, by the time Montenegro sought to secede from Serbia, the now-democratic Serb government accepted their right to do so, and the split was carried out without bloodshed1.  1 \"Montenegro declares independence\", BBC News, 4 June 2006.",
      "Forced evictions are following, and imposing, the law. A heavy hand is need for rights to be granted to all in the future. A majority of informal settlements are also illegal, future cities in Africa need to be built on a sense of legality and law.",
      "White Christmases may not be common any more but we can still dream of them. The scientists say that climate change is warming the world and many places that used to get snow in winter (e.g. Moscow, New York) will see it much more rarely in future. But our desire for a white Christmas just like the ones we used to know symbolizes our awareness of climate change. This issue could help shift public opinion in favor of tackling global warming.",
      "Linking Christmas with snow denies it to some countries  Dreaming of a white Christmas also suggests that some countries have a special relationship with Christmas (e.g Finland, Norway), and that hot countries (e.g. largely Christian Kenya, Ethiopia and Mexico) or Southern hemisphere countries (e.g. Australia, Argentina, South Africa) cannot celebrate Christmas properly — surely the opposite of the true Christmas message.",
      "government house believes governance united states should be split between two Checks and balances  By having both parties in charge of different parts of the Government, there can be a greater degree of scrutiny over policy as the opposition party will force the president to justify his policies.  Under single-party rule, there is a risk of a President being able to push through his/her agenda with little oversight from a legislative branch that is largely in agreement with the policy. One need only look to authoritarian governments the world over to see that governments with too much power are likely to abuse that power.  Divided Government provides a check on the executive, preventing agendas to be pushed through, allowing for compromise to be made between the two major parties, ensuring that the best possible policy for Americans is enacted. As Benjamin Franklin wrote “It is not enough that your Legislature should be numerous; it should also be divided.” [1]  [1] Franklin, Benjamin, Writings, ‘III. On the Legislative Branch.’ 10:55 – 60, 1789,",
      "Lack of control  Rupert Murdoch has an immense empire and if we believe his testimony obviously did not have as much control over his publications, or take as much responsibility for them, as he should have done. Murdoch himself has claimed “someone took charge of a cover-up we were victim to and I regret that.\" This was a cover up within the News of the World and News International that kept Murdoch out of the loop and misinformed on phone hacking, showing that he was unable to keep control over his businesses when he was the one with ultimate responsibility for the actions of that company. [1] The commons culture committee concluded that Murdoch was essentially negligent \"at all relevant times Rupert Murdoch did not take steps to become fully informed about phone-hacking, he turned a blind eye and exhibited wilful blindness to what was going on in his companies and publications.\" [2]  [1] BBC News, ‘Leveson Inquiry: Murdoch admits missing hacking ‘cover-up’, 26 April 2012.  [2] Culture, Media and Sport Committee, ‘News International and Phone-hacking’, House of Commons, Eleventh Report of the Session 2010-12, Vol.1, 1 May 2012, p.70"
    ],
    "relevance_map": {
      "0": 0,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 1,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "query_2",
    "num_docs": 10
  },
  {
    "query": "“After three years, it is clear that President Obama’s budget-busting policies have not created jobs and have only added to our debt,”  The Obama administration has been profligate with taxpayers’ money, has failed to deal with the economic crisis and has increased the debt. His policies on health care show that he is more interested in controlling people’s lives than he is in encouraging enterprise and industry. It’s the same story that is always heard from Democrats; they say that they’re interested in encouraging business but instead all they really want to focus on is getting the government involved in as many areas of life as possible – especially in the running of the market. After three years in office Obama has done nothing to improve the life chances of the American people, growth and employment have stagnated, GDP growth has been under 1% per year while unemployment is up to 9.1% from 7.8%, [i] while regulation and taxation have blossomed.  [i] Kristol, William, ‘Weekly Standard: Obama No FDR ON Unemployment’, npr, 2 September 2011,",
    "docs": [
      "CIRP would place power in the hands of authoritarian governments  The intention for the creation of CIRP is to give more power to governments, and particularly to authoritarian governments that wish much greater control over the internet. If CIRP is meant to enable “enhanced cooperation to enable governments, on an equal footing, to carry out their roles and responsibilities in international public policy issues pertaining to the Internet” [1] this may result in CIRP becoming an international organisation that would impose censorship on the internet. This is practically an inevitable result as the main tool of government is regulation. In the case of the internet such regulation will mean more controls on what users can and cannot do online.  The result is likely to be similar to the U.N. Human Rights Council where many of the world’s biggest human rights abusers are regularly elected and Israel and the U.S. are constantly investigated while a blind eye is turned to many abuses. [2] At the very least such control will provide an enabler that will allow countries that want to censor the internet to shelter behind the international organisation. India’s Minister of Communications and Information Technology Kapil Sibal has said the solution to this problem of objectionable content online should be permanent \"That will only happen when we talk to all the stakeholders and form such a mechanism under which any objectionable content is removed,\" [3]  [1] ‘Full text: India’s United Nations proposal to control the Internet’, IBNLive, 21 May 2012.  [2] Ayalon, Danny, ‘Theater of the Absurd’, Foreign Policy, 30 March 2012.  [3] Julka, Harsomran, ‘Internet censorship: India to push for internet regulation at United Nations’, The Economic Times, 24 August 2012.",
      "punishment house would make fines relative income Given, particularly, that it is those with the most money who are most likely to deem the fine ‘worth it’, this would be mitigated by the increased deterrent: the rich will now face substantially greater penalties.",
      "marriage society gender family house would ban arranged marriages eu countries Such understandings of arranged marriages are insensitive and misleading. The reality of many arranged marriages is far from the one presented here. Often individuals do have a say in who they marry, and although parents may make the first move in introducing the potential bride and groom, many would not insist the marriage go ahead if the two personalities do not sync. [1] Parents often see it as a partnership between themselves and their children to decide who would be a future suitable spouse, with all sides having a say in the arrangement.  Arranged marriages are also a cultural norm in many societies, and to impose an outright ban on such an entrenched practice with so many nuances and variations would be a deeply insulting and ignorant gesture.  [1] Acharya Ingrum, Pri, ‘The Reality of Arranged Marriages’ -  (accessed on 21 September 2012)",
      "rnational africa law human rights international law government leadership voting A delay is necessary for national security  Kenya is at risk of terrorist attack. Al-Shabab, a group linked to Al Qaeda have launched a number of attacks against Kenya. In addition to the Westgate massacre, there have been grenade attacks on bus terminals [1] and suicide bombings in refugee camps [2] .  Kenya’s waters are also used by Somali based pirates as a ground for attacks on international shipping, including possibly targeting ships travelling towards the port of Mombasa.  It is more important to the international community to have credible action taken in order to protect the Kenyan people from terrorism. This needs a strong Kenyan government – which means that there cannot be a change due to an international trial.  [1] Associated Press, “Two grenade blasts rattle Nairobi; 1 dead”, USA Today, 25/10/2011   [2] Ombati, Cyrus, “Terror suspects die after bombs explode on them”, Standard Digital News,",
      "crime policing international law house believes icc should have its own enforcement An ICC enforcement arm would be quicker  If international criminals are to be caught it needs to be clear that there is an organisation with the responsibility and authority to catch them. This is especially important when the criminal in question is able to slip across borders to avoid the national authorities in one state as Joseph Kony has done as the ICC would be able to cross borders itself and coordinate the response from multiple countries. The importance of an organisation that is able to catch international criminals can be highlighted by the experience of the International Criminal Tribunal for the Former Yugoslavia where despite a Memorandum of Understanding relating to the detention of war criminals in Bosnia NATO denied it had the power to make arrests so leading to patrols actively avoiding wanted men to avoid a situation in which they might have to engage in arrests. [1] A lack of clarity over whether an organisation can enforce its warrants for arrest results in arrests not being made. Ultimately the ICTY was successful because this situation was resolved with the creation of multinational police forces backed up with traditional NATO military power if necessary leading to the arrest of 126 individuals. [2]  [1] Zhou, Han-Ru, ‘The Enforcement of Arrest Warrants by International Forces From the ICTY to the ICC’, Journal of International Criminal Justice, Vol.4, 2006, pp.202-18,  pp214-6  [2] Ibid, p.203",
      "economic policy tax politics government house doesnt trust republicans economy The Obama administration received one of the worst political legacies in US history. A broken economy, half a trillion dollars’ worth of debt, two expensive wars, a sick healthcare system and much more besides. In just three short years he has stopped the country haemorrhaging Money in Iraq and Afghanistan, introduced a healthcare system based on medical need rather than the ability to pay and has made progress in improving the economy. Although things are still difficult for many Americans and there are not enough jobs, the idea that having the Republicans back in the Whitehouse is clearly untrue. They were in large part responsible for creating the economic mess in the first place with reckless over-spending and unjustified tax hikes. They turned one of the best economic inheritances in history on its head, leaving the country broke, in debt and with nowhere to go.",
      "Wind energy provides for price stability in the long-term, wind will be with us for the duration  The critical, and increasing, issue of a reliance on fossil fuels is that the price is not only increasing but is doing so in an unpredictable manner. Oil and gas in particular are subject to the political whim of some of the world’s most unpredictable regimes. Wind, by contrast, is produced domestically or, where it is exported, is produced in stable European nations.  Given the choice between negotiating with Chavez’s Venezuela or Putin’s Russia for oil and gas or with Belgium or Germany for wind energy is really not a difficult choice.  Critically, in addition, any form of mineral-dependent energy is based on a resource that will deplete – be that coal or uranium. Wind, by contrast, is the ultimate sustainable resource.",
      "It is important to honour the memory of the men who fell in the wars in the defence of their nation. War poetry is a fundamental tool to this end.  War poetry, although foreign to our own experiences of peacetime, enables us as readers to gain insight into the minds of the terrified men who fought for our freedom. Wilfred Owen suffered from shellshock as a result of fighting in the war. In his poem Mental Cases, he describes his time and experiences at Craiglockhart psychiatric hospital in Scotland, where he and Siegfried Sassoon (another WW1 poet) were treated for the condition; \"Who are these? Why sit they here in twilight? Wherefore rock they, purgatorial shadows\" (lines 1-2)1In our time of peace, we will never be able to fully empathise with their terrifying experiences, or successfully decode every observation, but we must read some of their poetry in order to appreciate the true and full horrors of war. We must do this out of respect for those who died for our freedom, and as such war poetry must be taught in schools. 1 Owen Owen, Wilfred, \"Mental Cases\", Wilfred Owen,accessed 1 September 2011.",
      "ic policy eurozone crisis finance international europe politics government The situation in Ireland, Italy, Spain and Portugal is not as extreme as that faced by Greece. It is therefore highly unlikely that a Greek default would have as severe a domino effect as the opposition suggests. Greece is the main source of political and economic uncertainty in the Eurozone, and their departure would ease the situation, facilitate investors and allow for the Eurozone to rally strongly. [1]  [1] Ruparel, Raoul and Persson, Mats: “Better off Out? The short-term options for Greece inside and outside of the euro”, June 2012, Open Europe, 2012",
      "Increased global security  The presence of US military equipment and counter-terrorism forces in Africa will result in greater security for the rest of the world. Many of the terrorist groups which have existed in the ‘ungoverned’ spaces of Africa have an international agenda. Al-Qaeda and other groups have used Africa as a base to plan attacks against the West, such as the 2004 Madrid bombing [1] . The disruption and eradication of these groups is therefore beneficial as it will prevent these groups from acting freely on the international stage.  [1] Lyman, P. N., ‘The War on Terrorism in Africa’ pg.2"
    ],
    "relevance_map": {
      "0": 0,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 1,
      "6": 0,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "query_3",
    "num_docs": 10
  },
  {
    "query": "In the current environment, moves to make English the official language are specifically targeted at Hispanic immigrants  Historically, efforts to declare English the official language tend to come up when certain elements in the American body politic become threatened. It became an issue in the First World War, when resentment rose against German immigrants, and the present movement, though nominally not signalling anyone out, is clearly aimed at Hispanics.  This can be inferred from the fact that they are by far the largest non-English linguistic group in the country, and on occasion such views have been let slip, as the leader of one of the largest lobbying groups for a National Language did.[1]  Even if such legislation is not aimed specifically at Hispanics, everyone will assume that it is, and many Hispanics will nevertheless believe that they are the intended targets.  The practical result of this will be the alienation of the Hispanic population as many Hispanics see themselves under attack, which will cause many Hispanics to concentrate together, undermining many of the arguments for assimilation the government has made.  Furthermore, to the extent it stigmatizes Spanish speakers as the ‘other’, it may well encourage bullying against Hispanic students, and discrimination against those who can’t speak English, who are a far larger group than those who chose not to speak it.  [1] ‘English Only Movement FAQ File’, Mass. English Plus,",
    "docs": [
      "Internment without trial fails to make society safer.  Giving the government the power to detain suspects without due process of law will not in fact make society any safer. The proposition's arguments rely upon the accuracy of secret intelligence, which supposedly identifies individuals planning terrorist acts, but which cannot be revealed in open court. Past examples suggest that such intelligence is often deeply flawed. For example, when internment was introduced in Northern Ireland in 1971 over 100 of the 340 original detainees were released within two days when it was realised much of the Special Branch intelligence that had been used to identify them was incorrect 1. Recent intelligence failures in the campaign against Al-Qaeda point to the difficulties western intelligence services have in penetrating and understanding non-white groups, while intelligence on Iraq's weapons programmes was also clearly flawed. So not only will many of the wrong people be unjustly locked up, many dangerous ones will be left at liberty.  1 West, C. (2002, January 2). Internment: methods of interrogation. Retrieved May 12, 2011, from BBC News:",
      "U.S. anti-drugs policy focuses on the supply of drugs not the root problem of demand  For the last two decades the USA has been focused on the supply side of reducing the drugs trade. Making it a 'war on drugs' forces a fight back from the drugs cartels leading to gunfights and instability in the countries en route. This happened in Columbia, in Peru and now in Mexico. The focus on supply, or else the containment of drugs in Mexico, is shown by the Obama's US-Mexico border policy press release that devotes a lot more space to extra boarder security to catching the drugs as they reach the US compared with one small paragraph on demand. [1] The U.S. war on drugs focusing on supply and transit routes has clearly failed and has been failing for decades. Back in 1992 Peruvian President Alberto Fujimori declared the war a failure while claiming that between 1980 and 1990, when the U.S. was engaging in military efforts to stop production and transportation, coca production increased tenfold. [2]  [1] Napolitano, Janet et al. ‘Administration Officials announce U.S.-Mexico Border Security Policy: A comprehensive response &amp; commitment’, The White House, 24 March 2009.  [2] Williams, Ray B., ‘Why “The War on Drugs” Has Failed’, Psychology Today, 6 June 2011.",
      "A large and diverse collective defence for would be impossible to command and develop  It does not take an in-depth analysis to imagine the issues, on the ground and at HQ, such as army would face. There would be communication issues, would the force use French, Spanish or English? There would be accountability questions [1] , who would be in charge and who would pay for resources? Finally, there would be hostilities within the army and potentially inherent racism between the nations involved. Such a force would not be effective in a combat situation, and valuable lives and resources would be wasted.  [1] Ioannides, I. (4 September, 2002). The European Rapid Reaction Force: Implications for Democratic Accountability. Accessed September 7, 2011 from:",
      "global house believes united nations has failed The United Nations is no more corrupt than any large organisation, much less national governments, and far more transparent than many comparable institutions.  It is true that the Human Rights Council contains some nations with bad records on civil liberties but it is surely better to engage with such regimes and shame them into slowly improving their human rights standards, than simply excluding them from UN organs and losing any influence over how they treat their citizens.",
      "ployment tax education university house would fund provision higher education A graduate tax put into an independent trust fund could in fact conversely help universities gain more academic freedom than they have now. They would be more free from market constraints which may restrict them, for example universities could be able to offer courses which may only be taken all be a very small fringe and would not usually be financially viable to run but which are culturally beneficially to have experts in if not useful economically. The argument that the state could interfere with the running of universities under a graduate tax system is erroneous, universities would still retain current levels of freedom from the government as the trust fund would be independent from government decision making and would be controlled by the stakeholders including universities meaning that they could worry a bit less about funding and exercise more independence on academic issues leading to better universities which are concentrating on their students’ needs and not just their own.",
      "culture general education education general house would make english official It may well be that some people backing the push to make English the official language have questionable motives, but the movement should be evaluated based on its results.  Right now Hispanics are already stigmatized, whether on one hand as temporary labourers unable to speak English and therefore destined for the worst jobs, or as an invading horde planning to conquer the United States.  For better or worse, the self-segregation of the community reinforces many of these beliefs, while it also prevents their kids from learning English. If this policy helps to break this self-segregation up, and the children of Hispanic Immigrants become as American as the children of German immigrants became in the early 20th century then their opportunities will be greatly increased.",
      "Referendums can lend greater validity to political outcomes  Particularly on contentious or controversial issues. Laws passed by public approval in this way will be less open to challenge, with all sides having to accept the will of the electorate. This is especially true of minority or coalition governments who may face accusations that they do not have a mandate for certain policies, [1] or situations where minority groups are exercising their right to self-determination. [2]  [1] May, Colin. “Canada’s Questionable ‘Coalition’”. C2C Canada Journal of Ideas. 22nd June 2009.   [2] Tierney, Stephen. “Referendums today: Self-determination as constituent power?”. European Journal of International Law blog, February 9th 2011.",
      "The current war on terror is not comparable to past wars during which Habeas Corpus was suspended. Both the Civil War and World War II were openly declared wars of limited duration following invasions by hostile forces. The “war on terror” is nebulous and open-ended. In any case, history has harshly judged arbitrary detentions during wartime. Lincoln’s Civil War detentions and Roosevelt’s Japanese internment camps of the 1940s are embarrassing chapters in US national history. The fact that former presidents improperly suspended Habeas Corpus is all the more reason to exercise caution now. Additionally, the suspension of Habeas Corpus by the UK in 1971 arguably strengthened the cause of the IRA, and made it easier for the organisation to recruit members. Western governments should be careful not to repeat the mistakes of the past",
      "Making bullying a legal issues does not incentivise robust enforcement of anti bullying rules by schools  Schools are educational establishments that parents trust to protect and educate their children. Teachers and school administrators are those who should be keeping a watchful eye on the students in their care and intervene before harm comes to them. If bullying occurs at school, then that school has failed in its duties. In fact, in cases where suicides occurred, it has often later come to light that a bullying culture was widely tolerated at the school, and that school staff that knew about it did nothing to prevent it, with tragic results [1] . To prosecute the bullies would shift responsibility from the woeful failure of the adults around them, who should have known better and done more than the children in their care.  [1] Bazelon, Emily. “What Really Happened to Phoebe Prince? Entry 1”. Slate. July 20. 2010.",
      "Beauty contests are patriarchal  Beauty contests promote an ideal of female beauty to which only a minority of women can realistically aspire, but which adds to the pressure on all women to conform to it. This can be harmful to women by encouraging dieting, eating disorders and cosmetic surgery, or simply by making them feel inadequate and ugly by comparison to this ‘ideal’ that is promoted. Moreover, these contests force the models and contestants to look even slimmer and perfect all the time, thus encouraging anorexia and bulimia.  Naomi Wolf argues that \"in terms of how we feel about ourselves physically, we may actually be worse off than our un-liberated grandmothers.\" Why? Because of how \"cruelly images of female beauty have come to weigh upon us.\" [1] This pressure has therefore forced a backwards step that reduces freedom of women when in almost every other area of life there have been great advances.  [1] Naomi Wolf, ‘The Beauty Myth’."
    ],
    "relevance_map": {
      "0": 0,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 1,
      "6": 0,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "query_4",
    "num_docs": 10
  },
  {
    "query": "Would it work?  The most fundamental question for any policy is whether it would actually work if implemented? In this case it seems to be doubtful that in practice arming the rebels would be enough to allow them to prevail. It will simply be helping to even the odds; providing enough arms to prevail over a fully equipped army that is supplied by Iran and Russia would require a truly colossal effort. No one is seriously going to consider providing M1 Abrams tanks to overcome Syrian armour when there are even concerns about providing anti-aircraft missiles. Even supporters of arming the rebels such as Senator John McCain say \"this alone will not be decisive\". All arming the rebels does then is make the government appear to be doing something (in a bad way since it is an unpopular policy), and stick a toe in the water (also bad as that may lead to escalating commitments), and another decision point six months down the line. [1]  [1] Lynch, Marc, ‘Shopping Option C for Syria’, Foreign Policy, 14 February 2013",
    "docs": [
      "Identity cards can assist in the efficient monitoring of immigration  Illegal immigration is an enormous problem in Western nations. The UK estimates that there are more that one million illegal immigrants living in Britain [1] , likely around 2.2 million [2] . For America, this number could be as high as 11 million [3] . Identity cards would mean that, even if illegal immigrants did succeed in crossing the border, they would most likely be found out because they could not pass routine security checks required on an everyday basis because they would not have been issued an identity card. Given that illegal immigration is frequently linked to international crime such as trafficking [4] , this is clearly a problem which we need to address in a new way.  [1] The Times. ‘UK home to 1m illegal immigrants.’ Published 25/04/2010. Accessed from  on 10/09/11.  [2] The Times. ‘UK home to 1m illegal immigrants.’ Published 25/04/2010. Accessed from  on 10/09/11.  [3] The New York Times. ‘Number of illegal immigrants in US fell, study says.’ Published 01/09/2010. Accessed from  on 10/09/11.  [4] Accessed from  on 10/09/11.",
      "The Gaza Strip and West Bank cannot agree on a government so who should the UN recognise, Hamas or Fatah?  If the Palestinian people cannot agree on who speaks for them then what is the rest of the world to make of the situation? One of the defining attributes of statehood is a single, stable government that can, in some meaningful way, be said to have control over the lands within that designated territory. This was set out in article 1 of the Montevideo convention that a state should possess “a ) a permanent population; b ) a defined territory; c ) government; and d) capacity to enter into relations with the other states.” [i] Only the permanent population criteria is unequivocally met by Palestine.  The Palestinian Authority can barely be said to speak for itself let alone the people it claims to represent. By recognizing one faction over another, the UN would be taking sides in an internal, domestic affair. Abbas is not asking the UN to recognize Palestine, he’s asking it to recognize him rather than Hamas.  [i] International Conference of American States, ‘Montevideo Convention on the Rights and Duties of States’, 26 December 1933,",
      "Poverty means more crime  Despite many problems that Africa has to face, one of the biggest is its extreme poverty. Currently more than 48.5% of the population of Sub-Saharan Africa lives on less than 1.25 dollars a day (1). As a result of this poverty people’s security is being threatened on two main levels.  On the first level of analysis, poverty can lead to crime. Poverty can create desperation to provide for family or yourself. As poverty is widespread in Africa, there are many people who are willing to steal, threaten, abduct or kill someone, in order to have something to eat. At 17.4 per 100,000 citizens, more than double the world average, Africa has the highest homicide rate among all regions of the world.(2) The other side of this is that a poor state can’t provide the level of policing that richer states can, a people in poverty usually results in a poor government. This in turn means that the police force is small, badly trained and underfunded so not fit for preventing crime.  On the second level of analysis, desperate people are much easier to manipulate. This makes them easy targets for military groups in Africa who are searching for members to fight for their causes. It is not coincidental that we have so many militias and juntas in Africa, such as Somali Pirates, AQAP, AQIM, Al-Shabab, Touareg( Mali), Boko Haram(Nigeria), M23 and dozens of others. The militias offer those in poverty what they need most, food, shelter, and protection in return for their “services”. Poverty provides an additional benefit for these groups due to the stark difference between potential reward, such as from piracy or winning control of mines, and a normal income. As with the drugs trade the lure of the fast buck can be used to encourage risk-taking.  In conclusion, poverty both enables crime and encourages militia groups.  (1) The World Bank, ‘Poverty’, data.worldbank.org, 2013,   (2) Me, Angela, et al., ‘2011 Global Study on Homicide trends, contexts, data’, United Nations Office on Drugs and Crimes, 2011,",
      "economy general environment climate environment general pollution house would An additional run-way would not necessarily result in a large increase in noise pollution as this would depend on where the runways are located. If the runway was established to the West of its current location incoming planes would cross over areas not occupied by as planes would fly over the M25, the Poyle industrial estate, the Wraysbury reservoir and part of Stanwell Moor. On the other hand all the runways could be moved to the other side of the M25 and closely spaced potentially reducing the noise level over what it is at the moment even with three or four runways. [1] Therefore the noise complaints argument is overstated. No airport will ever be silent but with proposals to increase the number of airbus A380s, which are half as noisy as the 747 when taking off and only produce a quarter of the noise when landing, the noise argument really does lose a lot of credit. [2] We should also remember that a third runway will ease capacity problems so potentially allowing the first and last flights to be at more sociable hours than is currently the case.  [1] Leunig, Tim, ‘A bigger and quieter Heathrow is the answer to our aviation capacity problem’, The Spectator, 5 October 2012,   [2] Heathrow Media Centre, ‘Heathrow set to more than triple its A380 fleet by 2020’, 25 October 2012,",
      "Both countries are among the most prosperous economies in the entire world and have nothing to gain from EU membership. Through their EEA and EFTA memberships, as well as bilateral deals with Brussels, both Norway and Switzerland have access to the Single Market and are fully integrated into the European economy. While it may be true that the European Union is generous to Norway and Switzerland it is also in the EU’s interest to add Norway and Switzerland to the European Common Market even if not as full members. The chances of the European Union cancelling such agreements are remote as international agreements and trade rely on trust between partners so other partners of the EU would worry that their treaties might also be cancelled.",
      "But the program in Brazil is biased towards rural communities versus cities. In the two largest cities in only 10% of families are enrolled versus 41% in the rural areas of Brazil [1] . To consider the program effective it needs to work equally with all members of the poor, which it does not.  [1] 'How to get children out of jobs and into school', The Economist​, 29 July 2010,",
      "How can it be that only tobacco companies get singled out and told not to advertise their products, while many others (such as prescription drugs) are allowed to market their products? There are many products which are hugely dangerous, take alcohol for example. Whilst drinks can be advertised, in the UK they must also carry a drink responsibly warning. Why can tobacco companies not do the same especially when you consider how much more immediate the danger from alcohol is?",
      "It could be done in much the same way as with sportsman where ‘exceptional achievement’ is recognised concept and, while difficult to define, is easy to apply. As long as the whole process takes place transparently it should ensure that it is not abused. The issue is not so much introducing exemptions to the universality of the current system but, rather, ensuring the transparency of the process.  There are already abuses of the system with the children of the powerful, the so called ‘sons of gods’ often finding ways around the law. That is not a difficulty of definition, it’s simple corruption.",
      "global middle east house would arm syrian rebels We cannot know whether this policy will work until it is tried. The Free Syrian Army has been remarkably successful so far capturing large swathes of the country and taking the fight to the regime in the capital Damascus. [1] With more sophisticated weaponry to naturalise the tanks, warplanes, helicopters of the regime the Free Syrians may well be able to finish the job.  [1] BBC News, ‘Syria: Mapping the insurgency’, 4 December 2012",
      "economic policy international africa society gender house believes feminisation The effects of unemployment  Unemployment has been linked to several health and wellbeing effects. Firstly, the psychological impact of unemployment involve a range of issues - from confidence to mental well-being. Issues of mental health problems - such as depression, suicide, anxiety, and substance abuse, need recognition in Africa. The impact of mental health may not only be on the individual, but dispersed within families and across generations. Secondly, unemployment may result in a loss of social networks and networking skills. The power of social capital, or networks, in reducing vulnerability has been widely noted. Therefore encouraging women to participate within the labour market ensures new networks are built and retained through the vital communication skills used. Finally. unemployment may affect physical health status.  Unemployment may place individuals in a downward spiral, making it harder to re-enter the job market."
    ],
    "relevance_map": {
      "0": 0,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 1,
      "9": 0
    },
    "query_id": "query_5",
    "num_docs": 10
  },
  {
    "query": "Affirmative action perpetuates prejudice  Affirmative action causes prejudice against minorities in society.  The existence of affirmative action creates a de-facto assumption that anyone of that particular minority must have gotten where they are not on their own merit, but simply because they are that particular minority. This causes people to resent the minority group for getting for “free” what people feel they had to work hard for. People feel as though that minority is getting a “free-ride” and are inherently less worthy of what they achieve.  This is damaging on a societal level because minorities who receive affirmative action are assumed to be less qualified and less valuable than others in society simply because many of them are aided by affirmative action policies. This not only creates damaging stereotypes, but also causes resentment and backlash from others in society who view affirmative action as simply unfair.  This is best demonstrated by the backlash in America in the mid-1990s over the existence of affirmative action policies [1] .  [1] Aka, Philip. \"Affirmative Action and the Black Experience in America.\" American Bar Association. 36.4 (2009): Print.",
    "docs": [
      "Minimum sentences have only a theoretical impact on crime rates; in reality they make no difference. The pro makes two major assumptions; first, that criminals have reasonably accurate perceptions of the legal code. Second, the pro assumes that harsh penalties have a psychological impact on potential criminals. Interviews with convicted felons found that a mere 22% even thought they knew what the punishment would be. Another 18% did not know at all, and more than a third reported that they had not thought about punishment at all at the time of the crime. [1] Thus minimum sentences are not sufficiently well publicized to have a significant deterrent effect. Furthermore, substantial evidence demonstrates that additional severity has a relatively small deterrent effect. Criminals respond much more to the chance of getting caught rather than the consequences that occur if they get caught; if a criminal’s chance of getting caught is 10%, the deterrent effect is virtually zero. [2] Thus mandatory sentences do not have a substantial deterrent effect.  [1] Bruce Western, Punishment and Inequality in America, Russell Sage Foundation, NY, 2006, 178.  [2] Western, 179.",
      "Murdoch is morally unfit to run a powerful media company.  Those running media corporations should be morally upright people who control their media companies in the public interest as these are organisations that potentially have a lot of influence through their control of information. This is however not at all how Rupert Murdoch ran News Corp or his newspapers.  Murdoch has been running his empire in pursuit of power and to advance a right wing agenda. [1] His influence was such that even naturally left wing parties such as New Labour under Tony Blair stuck to right wing or wing orthodoxies in order to keep the support of the Murdoch press. [2] Murdoch was therefore pushing narrow interests rather than the public interest. Murdoch’s News Corporation has shown their lack of moral scruples not just by engaging in industrial scale hacking but also by its determination to use its contacts to close down investigations by parliament or the police as well as being willing to destroy evidence and lie when giving evidence. Tom Watson MP has gone so far as to accuse Murdoch of being “the first mafia boss in history who didn’t know he was running a criminal enterprise”. [3]  The attitude of the person at the top towards how their company and its staff should conduct themselves informs how they do conduct themselves and engage in their business. It is the owners and the management that create the corporate culture which in Murdoch tabloids meant profits at all costs and doing anything to get a story. [4]  [1] Puttnam, David, ‘News Corporation has sought to undermine elected governments’, guardian.co.uk, 28 April 2012.  [2] Holehouse, Matthew, ‘The Blairs and the Murdochs: a special relationship’, The Telegraph, 22 February 2012.  [3] The Economist, ‘Stringfellows: A British MP’s long-awaited account of investigating the Murdoch empire’, 28 April 2012.  [4] Grayson, David, ‘Phone hacking: what corporate responsibility could have done to stop it’, Guardian Professional, 25 July 2011.",
      "crime policing international law house believes icc should have its own enforcement An ICC police would be able to provide independent assistance to these states to aid those that do not have enough resources. The ICC has a poor track record of capturing suspects. This is not due to a lack of trying by the ICC – in some cases, it is due to the lack of trying of states such as those that have played host to Omar Al-Bashir. While individual states do, and should, have a role to play in enforcement, in some cases they are unwilling or unable to arrest suspects. Just as the ICC is there if a state is unable or unwilling to try an individual, they can have a role if they are unable or unwilling to arrest them.",
      "It is unreasonable for the law to expect unmarried couples to plan for when they separate: people within relationships tend to be optimistic about the prospects of their relationships. They do not expect to split up, and most choose cohabitation to see if the relationship is going to work out at all. Making agreements about property at this stage can seem unromantic and unnecessary. USA Today writes: “For young couples who have never been married, cohabiting may seem like a hassle-free way of testing a relationship before tying the knot. And for those who already have been through a divorce, who have children or other significant assets, cohabiting may seem like a way to avoid costly legal entanglements if the relationship doesn't work out.” [1]  [1]",
      "defence science science general house supports development missile defence A robust missile defense shield will provide the protection previously afforded by the doctrine of Mutually Assured Destruction, allowing the US to dismantle much of its dangerous nuclear arsenal  With a fully functioning missile defense shield deployed, nuclear-armed ballistic missiles become obsolete, unable to ever reach their targets. This means countries’ strategic obsession with second-strike capacity, the ability to return fire with nuclear weapons should they be attacked by them (Mutually Assured Destruction), will cease to be an issue, as first-strikes are destined to be wiped out before they hit a single target. What this means is that countries with missile defense systems can feel secure without the need of retaining massive nuclear arsenals. This will alleviate the pressure to have stockpiles of warheads and will promote disarmament. Mutually Assured Destruction has become a far less secure strategy as nuclear proliferation has occurred to states with different strategic conceptions. This has been seen in the United States, which since its full adoption of the Aegis system has actively pursued a policy of reaching a new accord with Russia on nuclear arms reduction. This culminated in 2010 with the signing of the New START (Strategic Arms Reduction Treaty), an accord to reduce the number of strategic nuclear missile launchers by half (Associated Press, 2011). This new step toward nuclear disarmament could not be politically possible in the United States without a replacement defense, which only a national missile defense system can provide.",
      "Military objectives are more important than that of protecting cultural property.  Ultimately the debate between conservation of cultural heritage and the need to secure a military advantage in times of conflict, comes down to a comparison of two different kinds of goods. One the one hand we have cultural goods that are beneficial for aesthetic and educational purposes, and on the other we have more tangible goods that are often sough through military endeavours. When the latter are particularly pressing and important goods, such as the need to prevent genocide, or distribute famine relief or defend one’s security, these benefits far outweigh the benefits of preserving our world cultural heritage. Although it is regrettable that cultural property of significant value may be damaged, it is incomparable to the damage caused by mass killing of individuals or mass curtailing of human rights. The safeguarding of basic human rights such as the right to life, the right to be free from fear, enslavement or torture etc. is a prerequisite for one to be able to appreciate and learn from items, sites and monuments of high cultural and historical value. For these reasons, military and humanitarian objectives must come first, ahead of the need to safeguard cultural property.",
      "ucation secondary university philosophy religion minorities house believes use This resentment already exists in society, and as explained in counterargument two, in many specific environments, affirmative action is its own cure.  On a wider societal level, this prejudice will not be created by affirmative action, but already exists. Simply because people may not particularly like the idea of affirmative action and get a bit resentful about it is not a good enough reason to let these minorities be denied the opportunities and lives they deserve.",
      "economy general international africa house believes women are key africas Women provide a platform for economic development  Where women in Africa are treated more as equals and are being given political power there are benefits for the economy. Africa is already surging economically with 6 out of the world’s ten fastest growing economies in the past decade being a part of sub-Saharan Africa [1] .  While some of the fastest growing economies are simply as a result of natural resource exploitation some are also countries that have given much more influence to women. 56% of Rwanda’s parliamentarians are women. The country’s economy is growing; its poverty rate has dropped from 59% to 45% in 2011 and economic growth is expected to reach up to 10% by 2018. Women become the driving force of the socio-economic development after the 1994 genocide with many taking on leadership roles in their communities. [2]  In Liberia, since Ellen Johnson Sirleaf took the presidency seat on January 2006, notable reforms have been implemented in the country to boot the economy, and with visible results. Liberia’s GDP has grown from 4.6% in 2009 to 7.7% by the end of 2013.  Men in Africa on the other hand have often lead their countries into war, conflict, discord, and the resulting slower economic growth. Men fight leaving women behind to tend the household and care for the family. Giving women a greater voice helps encourage longer term thinking and discourages conflict, one of the main reasons for Africa’s plight in the second half of the 20th century. The feminisation of politics has been identified by Stephen Pinker as one of the causes for a decline in conflict. [3] When peace brings economic growth women will deserve an outsize share of the credit.  [1] Baobab, ‘Growth and other things’, The Economist, May 1st 2013   [2] Izabiliza, Jeanne, ‘The role of women in reconstruction: Experience of Rwanda’, UNESCO,   [3] Pinker, S., The Better Angels of Our Nature: Why Violence Has Declined, 2011",
      "Tactical voting is legitimate within the democratic process.  The proposition highlights how tactical voting can be affected by opinion polls. However there is nothing wrong with tactical voting. In fact, it is a crucial feature of a democracy that citizens are not only able to vote for the government they want, but also for the type of opposition that that government will face. Tactical voting also avoids wasted votes under the First-Past-the-Post system Britain and America both use. To enable tactical voting, opinion polls are necessary to inform voters what way they should vote if they wish to vote tactically. That this may sometimes lead to mistakes, is an unfortunate but necessary by-product. Banning opinion polls can therefore have unintended results. In the 1981 French Presidential election once the seven day ban started Chirac’s campaign suggested that their campaign was taking off and he would go through to the second round – which would make it two conservatives in the run off. This frightened communist party supporters into voting tactically to support Mitterand when there may well have been no need. [1]  [1] Bains, Paul, et al., ‘ Public opinion polls: do they do more harm than good?’, Proceedings of the 56th International Statistical Institute Conference, 22-29 August, 2007, Lisboa, Portugal, www.hansardsociety.org.uk/files/folders/3069/download.aspx",
      "Failing a law degree can be extremely costly.  Law School as a choice has to be weighed against its opportunity cost: what else could someone do with three years and $120,000? How might the long term benefits of this activity weigh up against the consequent benefits of time spent at law school?  This is an especially important consideration for those interested in careers outside of the legal profession. Spending some of that tuition subsidizing an internship on Capitol Hill or with a Think Tank or Lobbying firm would be far more likely to lead to later employment in politics than earning a JD and likely offer a politically interested potential law student a far more entertaining and enjoyable experience. Joining the Peace Corp or working for an international non-Profit would both impress the State Department more and be far cheaper than a law degree."
    ],
    "relevance_map": {
      "0": 0,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 1,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "query_6",
    "num_docs": 10
  },
  {
    "query": "Animals shouldn’t be harmed  The difference between us and other animals is a matter of degree rather than type [2]. Their bodies resemble ours, as do their ways of conveying meaning. They recoil from pain, appear to express fear of a tormentor, and appear to take pleasure in activities; a point clear to anyone who has observed a pet dog on hearing the word “walk”.  We believe other people experience feelings like us because they are like us in appearance and behaviour. An animal sharing our anatomical, physiological, and behavioural characteristics is surely likely to have feelings like us.  If people have a right to not be harmed, we must ask ourselves what makes animals different? If animals feel what we feel, and suffer like us, to condemn one to testing because of them being of a different species is similar to racism or sexism.[3]",
    "docs": [
      "The Palestinian cause has no shortage of advocates in the UN this would add nothing to the discussion  The entire Arab League is already perfectly capable of speaking for the Palestinian cause in the United Nations. There are established nations whose leaders have not addressed a full meeting of the General Assembly as frequently as leaders of the Palestinian cause, even the leader of the PLO, Mahmoud Abbas has addressed the General Assembly as he did in September 2011. [i] It is the only geo-political issue that routinely impacts upon the conduct of the elections of other nations, the plight of the Palestinian issue is the stuff of newspaper headlines around the world while other, arguably more serious, concerns go unvoiced. It is difficult to see how admitting Palestine as a member state would bring any more focus to the issue in practical terms.  [i] ‘Full transcript of Abbas speech at UN General Assembly’, Haaretz.com, 23 September 2011,",
      "Nuclear waste can be used in other forms of power generation  There are new kinds of nuclear reactor such as ‘Integral Fast Reactors’, which can be powered by the waste from normal nuclear reactors (or from uranium the same as any other nuclear reactor). This means that the waste from other reactors or dismantled nuclear weapons could be used to power these new reactors. The Integral Fast Reactor extends the ability to produce energy roughly by a factor of 100. This would therefore be a very long term energy source.1  The waste at the end of the process is not nearly as much of a problem, as it is from current reactors. Because the IFR recycles the waste hundreds of times there is very much less waste remaining and what there is has a much shorter half-life, only tens of years rather than thousands. This makes storage for the remainder much more feasible, as there would be much less space required.2  Till, Charles, ‘Nuclear Reaction Why DO Americans Fear Nuclear Power’, PBS,   Monbiot, George, ‘We need to talk about Sellafield, and a nuclear solution that ticks all our boxes’, guardian.co.uk, 5 December 2011,",
      "Murdoch is effective at selling news  The first criteria for fitness to control a media company should be the ability to bring people the kind of content that they want to consume at a price they are willing to pay. Murdoch is undoubtedly good at this. When he took over the Sun in 1969 the sun was selling just over a million copies a day but by 1976 circulation was up to 3.7 million. [1] Murdoch has been very successful at selling newspapers, a declining industry, and has been supportive of both down market tabloids and quality broadsheets. That the News of the World up to its closure and The Sun have remained Britain’s most popular newspapers shows Murdoch is an effective media proprietor and fit to bring news to the people. If he was not customers would vote with their money.  [1] ‘The newspaper industry’, Monopolies and Mergers Commission, 1985, p.5",
      "Video games are an outlet for childhood aggression  Video games are a useful outlet for childhood aggression. As psychologist Cheryl Olson writes, kids 'use games to vent anger or distract themselves from problems.'1 Play violence has always been a natural part of growing up, especially for boys. In the past it was considered normal for young people to act out violent fantasies in harmless way, for example with toy guns in games of cops and robbers, cowboys and Indians, war, pirates, etc. These games were often inspired by films, television or comic books and magazines, just as computer games commonly are today. Now that these traditional activities are frowned upon and \"enlightened\" parents prevent children from having toy guns, aggressive play has simply moved indoors, on to the computer screen instead. Suppressing these natural instincts is not only pointless, it is probably more dangerous to remove yet another harmless outlet for aggression from the young.  1 Schaffer, A. (2007, April 27). Don't Shoot. Retrieved June 2, 2011, from Slate:",
      "Impossible to Stop.  Governments might as well accept that allowing retailers to sell grey goods has benefits because government will never be able to completely prevent such imports. Government regulation may prevent most retailers from selling grey goods but it won't stop all. For example Tesco in the UK sold cut price Levi jeans for years, and fought Levi Strauss in the courts for four years to try and keep selling them.1 If even the biggest retailers are willing to sell grey goods unless stopped by the courts many smaller ones will be getting through the net. Moreover consumers will simply buy the goods elsewhere, particularly online. The government should instead legalise the import of grey goods so that it can make sure that these imports are of a high standard and do not break any other standards  1 BBC News, 'Tesco defeated in cheap jeans battle', 31 July 2002,",
      "Incentives are the best way to produce effective, affordable software  The West has clear reasons to seek to provide the software necessary for anonymity to people involved in uprisings, and it has the means. Western countries are the most advanced technologically and have been the leaders in creating and developing the internet and thus they are best suited to producing and disseminating this technology. Firstly, as they are more advanced in software development, the products they distribute will be much more difficult for the target regimes’ to hack or subvert to their own advantage, or at least significantly more difficult to than were it produced in any other locale. 1 Secondly, the efficient production of software requires special industry clusters. These exist almost exclusively in the West. Silicon Valley, for example is the high tech capital of the world, and were companies there incentivized to produce software for the participants of uprisings it would be a simple matter of efficient distribution, which these firms are best in the world at doing. The need for subsidy is also clear. People involved in uprisings tend not to have huge amounts of disposable income, so to date there has been little market for the production of these sorts of software devices. With a subsidy from Western governments the incentive is created and a top quality product that will save lives and make the uprising more likely to succeed is born.  1 Paul, I. and Zlutnick, D. “Networking Rebellion: Digital Policing and Revolt in the Arab Uprisings”. The Abolitionist. 29 August 2012.",
      "animals science science general ban animal testing junior The right of a human not to be harmed is based not on appearance but on not harming others. Animals don’t participate in this.  Animals won’t stop hunting because of the pain and feelings of other animals. Even if animal testing were to be abolished people would still eat meat, and kill animals for other less worthwhile reasons than animal testing.",
      "Independent campaign groups.  The resolution ignores the possibility that negative campaigns may occur outside of a partisan context. In India [i] and Korea [ii] , grass roots campaigns without specific party or ideological ties have been used to highlight corruption among electoral candidates and legislative incumbents. These campaigns are arguably an expression of democratic political freedom, with individual citizens banding together to enforce core democratic norms. However, as the example of the Citizen’s Solidarity movement in South Korea shows, because such actions inevitably involve questioning the character and conduct of politicians running for election, they frequently fall foul of laws designed to restrict negative campaigning.  Similar problems are encountered by the professional press. Even in countries with liberal electoral and libel law regimes, the press frequently find themselves accused of political bias if they attempt to highlight mendacity or wrongdoing by a particular candidate. Unless the wrongdoing in question is particularly severe, western journalists may find themselves in the position of their Singaporean counterparts – held accountable for “electoral crimes”, libel or contempt of court by a body of law that treat political institutions as sacrosanct and denies that scrutiny of those institutions’ officer holders is necessary.  [i] “No modern-day Mahatma”. The Economist, 27 April 2011.   [ii] “Korea’s art of negative campaigning.” The Economist, 6 April 2000.",
      "While there is value in other artists exploring their own creativity by means of others’ work, it does not give them an overriding right. Rather, artists should have a meaningful control over how their art is disseminated and viewed in the world, as it is ultimately their creation. Furthermore, the protections copyright affords means that the responses that do arise must be more creative and novel in and of themselves, and not simply hackneyed riffing on existing work. This helps to benefit the arts by ensuring that there is regular innovation and change.",
      "Economically compatible  There is a huge potential for economic cooperation between two of the biggest states in the world. Russia desperately needs investment and technology to modernize its economy. The USA can offer this and more. It has helped Russia to get into the World Trade Organization, [1] to integrate it into the global economy, put pressure on Russian companies to drop their corrupt ways and adopt modern modes of operation. Russia also has plenty of chips to bring to the table. Pumping seven million barrels a day, Russia is second only to the Saudis in oil production. The Bush team saw Russia as a source for crude oil should U.S. relations with Saudi Arabia deteriorate, this is why at the Moscow summit in May, 2002, Bush and Putin launched “an energy dialogue to strengthen the overall relationship between our countries, and to enhance global energy security, international strategic stability, and regional cooperation.” [2] The United States has invested whenever it could in Russian oil and gas despite the difficulties private companies like Yukos have faced with government tax demands. For example in October 2001, Exxon Mobil announced that the Sakhalin 1 project was profitable and outlined the company’s plans to invest $30 billion by 2030. [3]  [1] Kirk, ‘Full Statement by Ambassador Kirk Regarding the Invitation to Russia to Join the WTO’, Office of the United States Trade Representative, December 2011,   [2] William Ratliff, ‘Russia’s Oil in America’s Future: Policy, Pipelines, and Prospects, Hoover Institution, 1/9/03,  accessed 04/5/11  [3] Tamara Troyakova and Elizabeth Wishnick, ‘Integration or Disintegration: Challenges for the Russian Far East in the Asia-Pacific Region, p.18.  accessed 6/5/11"
    ],
    "relevance_map": {
      "0": 0,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 1,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "query_7",
    "num_docs": 10
  },
  {
    "query": "Growing partisanship  The current political climate makes divided government difficult anyway. The terms of debate in American politics is based on a perceived ‘culture war’ between liberals and conservatives over what it means to be American, something that has been exacerbated by 24-hour news and a proliferation of partisan blogging.  This makes agreements on core issues difficult to achieve and this has become apparent in recent years, with opposition to Barack Obama’s $1 trillion stimulus package helping to spawn the Tea Party movement [1] that has helped move the Republican Party to the right, making the compromise required for effective divided government unachievable. [2]  While it has been most noticeable recently the US political climate has been becoming more polarized for the last twenty-five years. This polarization helps to create gridlock and less public policy. [3] The stasis in Congress created by the dogmatic Republicans winning the House in the 2010 mid-terms shows how America’s political climate is now much more suited to Single-Party Government, allowing for much more effective decision making than divided government.  [1] Ferrara, Peter, ‘The tea Party Revolution’, The American Spectator, 15 April 2009,   [2] Rawls, Caroline, ‘Moderate Republicans Lament GOP Shift Further Right’, newsmax, 27 July 2011,   [3] McCarty, Nolan, ‘The Policy Consequences of Partisan Polarization in the United States’, bcep.haas.berkeley.edu/papers/McCarty.doc",
    "docs": [
      "africa global house believes former colonial powers should pay reparations Reparations would effectively right the economic imbalance caused by colonialism.  Given that much of the motive for colonisation was economic, many former colonies have suffered damage to their natural resources [1] or human resources, [2] which has left them less able to sustain a healthy economy. Colonists targeted countries with rich natural resources and little ability to defend themselves from invasion and manipulation. By this method, they could supply their own markets with the natural resources which they had already exploited at home [3] , and find cheap (or free) human labour for their markets [4] . Given that powerful countries such as Britain [5] and France [6] gained their own economic prosperity through the exploitation of the economic potential of the colonies, it is entirely appropriate and logical that they should pay reparations as compensation. In this way, the economic disparity between former colonies and colonists would be equalised.  [1] Accessed from  on12/09/11  [2] Accessed from  on 12/09/11  [3] Accessed from  12/09/11  [4] Accessed from  on 12/09/11  [5] Accessed from  on 12/09/11  [6] ‘The Haitian Revolution and its Effects’. Patrick E. Bryan. Accessed from  on 12/09/11.",
      "The inability to use advanced technologies merely forces non-democracies to utilize more unsavoury methods to achieve their aims  If it is the aim of an undemocratic regime to use advanced surveillance technology to gather intelligence on, and ultimately crush, dissent it will find other means of doing so. Their calculus of survival is not changed, only their available methods. Their first port of call will be the more advanced non-democracies that might be able to supply comparable surveillance equipment. China’s military and surveillance technology is fast catching up to that of the West, and makes an appealing alternative source for equipment. [1] The only difference is that the Chinese have no compunction at all about how the technology is used, meaning worse outcomes for pro-democracy groups who run afoul of them. When this strategy fails regimes can turn to the tried and tested models of past decades, using physical force and other less technological modes of coercion to cow dissent. Again, this form of repression is quite effective, but it is also much more painful to those on the receiving end. Given the options, democracies supplying surveillance technology may be the best option for dissidents in undemocratic countries.  [1] Walton, G. “China’s Golden Shield: Corporations and the Development of Surveillance Technology in the People’s Republic of China”. International Centre for Human Rights and Democratic Development. 2001.",
      "The argument here presented by the proposition that the majority of people in US are fed up with the war, true. But that is because they were not the ones facing abuse at the Taliban hands or fighting a civil war which resulted in the killing of 100,000, but the minority will be slaughtered if this is allowed to happen. [1] This genocide in the making should not be allowed to happen. This will also lead to a civil war. Though the minorities are exhausted but they broke it and have a moral imperative to fix it. A lot of people have come out in support of the \"western\" forces, they will face retribution and future attempts to win hearts and minds will fail when the fickleness of our resolve is exposed. This is a slippery slope if we slide down there is no telling how far down we will fall. This should be the centre of the discussion; our opponents want to put popularity before lives and security and which is wrong.  [1] Dexter Filkins, «Overture to Taliban Jolts Afghan Minorities», The New York Times, published June 26, 2010,",
      "Braille should be offered the same protection as minority languages.  The issue of the protection of minority languages is a difficult one for most governments as it is usually argued that most speakers of such languages also make use of the dominant language and, where they don’t, they should learn for their own good. For example French speakers in Canada must also learn English. [i] However, there are senses and experiences that are uniquely held within a community and expressed within those languages. In many ways Braille functions in similar ways, a shared experience between those who read it, a bond between users and, for the most part, denied to outsiders. By its nature, it is tactile and speaks in a way that is not true of audiobooks prepared for a wider market. In purely practical terms there is relatively little difference between reading speeds in Braille and listening to audiobooks (about 130 against 150 wpm). [ii] Learning Braille also has immense practical benefits, not least of which is being employable, 90% of those who are braille literate are employed compared to 33% of blind people who are braille illiterate. [iii]  It seems simply strange to insist that those who have already lost one form of access to the wider world – indeed the method most widely used in that world – should be denied another simply because it is deemed to be cheaper, easier or ‘better for them’. Indeed such an action is deeply redolent of the debate over minority languages. Although not all of the blind community prefers to use Braille, many of them do and that would seem sufficient reason to respect it as an important way in which they interact with the world, and receive and impart ideas – the twin pillars of free speech [iv] .  [i] Burnaby, Barbara J., ‘Language Policy’, The Canadian Encyclopedia, 1996,   [ii] Reading Braille. RIDB Crenwick Centre.  [iii] Ouellette, Matthew David, ‘Low Cost, Compact Braille Printing Head For Use in Handheld Braille Transcribing Device’, Mechanical Engineering Master's Theses. Paper 41. p.2   [iv] Guidelines on the use of minority languages in the broadcast media. Minority Rights Group International.",
      "The opinions of foreign governments and the international community have frequently failed to have any real impact upon the situation 'on the ground' in Tibet. For example, The US joined most other UN members in condemning the Chinese 'aggression' and 'invasion' of Tibet in 1950, however the Chinese exerted their authority there anyway. [1] The international community will therefore acquiesce with whatever is decided between Tibet and China – they will applaud any deal or condemn any repression but this will not affect the positions of either side. Rather, what matters is what the Tibetan population support, and there is good reason to believe that the 'Middle Way' does not satisfy them. Many younger Tibetans would prefer that the Dalai Lama push for total independence, an regret that he did not pursue a more confrontational path with China over the 2008 Olympics. [2]  [1] The Office of Tibet, New York. “Historical Overview”. The Office of Tibet, New York.   [2] Bell, Thomas. “Tibetans criticise Dalai Lama's 'middle way'”. The Telegraph. 18 March 2008.",
      "Football has operated successfully for over 100 years without GLT. Two assistant referees were introduced in 1891, 28 years after the rules of association football were coined; a fourth official was introduced in 1991; and FIFA recently introduced two additional assistant referees in Europa League games. Football has demonstrated that it is willing and capable to adjust to the demands of wider exposure without having to resort to GLT.",
      "government house believes governance united states should be split between two The reason why a febrile atmosphere has emerged in recent years is because both red and blue single-party governments have made unpopular decisions without the necessary checks being place upon it. This has made people disenchanted with the political system and made them think that it is only looks out for ideological elites, causing a backlash in the form of the Tea Party and Occupy movements. [1]  Divided Government combats this by helping to re-establish consensus between the parties over what is best for America, ensuring that policies have the consent of a majority of people, thus preventing the overtly ideological backlashes seen recently.  [1] Miles, Chris, ‘What the Tea Party and Occupy Wall Street Have in Common’, policymic,",
      "disease health general sex sexuality house believes employees should be compelled It’s in the interests of employers  It’s in the interests of employers. A long, incurable and debilitating condition has stricken one of their employees. They will have to make provision for possible sickness cover and replacement workers, potentially for medical and/or retirement costs. HIV can make people tired and can lead to being sick more often as it means the immune system will not be able to fight off infections as well as it normally would. [1] The employee’s productivity might be reduced to the point at which their continued employment is no longer viable. If things are made difficult for employers with HIV positive workers, then they are less likely in the future to employ people who (they suspect) are HIV positive. Employers must be listened to in this debate – in many HIV-stricken countries, they’re the last thing between a semi-functioning society and complete economic and social collapse. Traditional rights ideas such as concerns about privacy of medical records are less important than the benefit to society of being able to cope with the unique problem of HIV more effectively.  [1] Dickens, Carol, ‘Signs of HIV, AIDS symptoms’, AIDS Symptoms,",
      "traditions law human rights international law society family house would require The ICC is not likely to target children or the leaders of marginalised communities when prosecuting the use of child soldiers. Officials of states parties who play a role in commanding and deploying military units can be held liable for failing to prevent the use of child soldiers at a local level.  If the agony of their circumstances forces a community to recruit ever younger boys into its militia, then officers, ministers or heads of state, along with the commanders of non-state actors, can be brought to trial for allowing children to be used as soldiers. This will be the case whether these individuals do so negligently or by omission. A guilty party need not engage in a positive act.  ICC prosecutors and judges exercise their discretion in order to avoid the types of injustice that the proposition describes. The lack of prosecutions relating to the ad-hoc use of child soldiers by pro-independence groups in South Sudan underlies this fact [i] .  Moreover, the ICC is bound by the principle of complementarity, an obligation to work alongside the domestic courts and legislators of the states that refer potential war crimes to the international community. If a state’s corpus of law allows for a margin of appreciation in judging the actions of isolated and endangered communities, these principles must also be reflect in the investigation and inquiries conduct by the ICC.  Complementarity enables the ICC to function with the flexibility and insight that proposition assume it lacks.  [i] “Raised by war: Child Soldiers of the Southern Sudanese Second Civil War”, Christine Emily Ryan, PhD Thesis, University of London, 2009",
      "africa politics politics general house believes lesotho should be annexed Annexation is not needed where there is already extensive cooperation between the countries  Lesotho and South Africa already cooperate on a wide variety of issues. If we look at the example of the law system; the two systems are almost the same and all but one of the Justices on the Court of Appeal in Lesotho are South African jurists. [1] Moreover, there are at least four inter-governmental organizations that maximize the trade, help and social connections between the two states. Starting with the African Union, going on to the Southern African Development Community [2] that promotes socio-economic cooperation as well as political and security cooperation, moving to the Southern African Customs Union [3] and the Common Monetary Area. Lesotho is not only helped by SA but this is happening without them having to let go of their national identity and history. In much the same way as different nations, large and small, benefit from the EU so the countries of Southern Africa can benefit from some integration without the negative consequences of complete annexation with the loss of control that would bring.  [1] U.S. Department of State, ‘Lesotho (10/07)’, state.gov,   [2] Southern African Development Community Official website   [3] ‘Continued economic reforms would attract more foreign investment’, World Trade Organisation, 25 April 2003,"
    ],
    "relevance_map": {
      "0": 0,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 1,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "query_8",
    "num_docs": 10
  },
  {
    "query": ": Main purpose of UN, to prevent war, has clearly not been achieved.  The UN was set up with the express purpose of preventing global wars, yet it has done absolutely nothing to prevent them. Indeed, the UN has often served merely as a forum for countries to abuse and criticise each other, rather than resolve disputes peacefully.  In some cases, such as the 2003 invasion of Iraq, UN resolutions have arguably been used as a justification for wars, rather than to prevent them. Research shows that the number of armed conflicts in the world rose steadily in the years after 1945 and has only begun to plateau or fall since the end of the Cold War. [1]  [1] Harrison, Mark &amp; Wolf, Nikolaus. “The Frequency of Wars”. University of Warwick, 10th March 2011.",
    "docs": [
      "global house believes united nations has failed It is unfair to say that the United Nations has failed just because conflict has not been eradicated from the world. The causes that drive nations to war with one another often cannot be resolved by diplomatic means; to set global peace as the test for the UN’s efficiency is clearly unfair. Nonetheless the UN has served as an effective forum for behind the scenes diplomacy in many international crises. It has come to the aid of countries when attacked, as in the examples of [South] Korea and Kuwait in 1950 and 1990 respectively; it has also kept the peace in, for example, the former Yugoslavia, Cyprus and East Timor. The fact that armed conflicts around the world have become less common since 1990 is, arguably, at least partly down to the good offices of the United Nations.",
      "overnments still successfully censor information. Take China for example. Often the government shuts down Facebook and Twitter, arrests bloggers, and takes down content. Terms like ‘Tiananmen Square’ and ‘Inner Mongolia’ provide no search results because of the protests that have gone on there1 Governments’ ability to censor information is advancing. Therefore the idea that the internet promotes the flow of unbiased information is not necessarily true, which counters the claim that the internet promotes democracy. Further, the internet is not always used for access to Western news sources, but instead, over 500 million sites in the indexes of search engines are pornographic. In 2003 25% of internet use was for accessing porn. Five of the twenty most visited internet sites are download sites for video games and porn 2. The internet is not largely used for access to information, but instead other forbidden resources, and therefore cannot be directly linked to democratic development.  1. Shirong, Chen, \"China Tightens Internet Censorship Controls\", BBC, 2011  2. Change.org, \"Petition to Unsubscribe America from Internet Porn\", 2011,",
      "As stated in side proposition’s first argument, the age at which retirement becomes mandatory can be flexible. The state will always be able to raise or lower the retirement age in response to demographic factors, such as the rate at which diseases of senescence begin to appear in the general population. Spain [i] and France [ii] have already passed laws raising the age at which individuals can qualify for a state pension. Proposition side’s arguments do not run contrary to this type of action.  If the general fitness, wellbeing and life expectancy of the population increases, the age of retirement can be raised in response. An increase in the retirement age can be made relative to a population’s average lifespan.  If an adult’s working life is extended, then the amount of time that they spend paying tax will also be extended. This increase in tax income will offset some of the financial burden associated with an increasingly long-lived population. Moreover, as opposition point out, advances in treatments for diseases linked to senescence have effectively reduced the amount of time that individuals reaching the ends of their lives will spend as dependents.  The late entry into the labour market of many young adults can be blamed on an ill-advised attempt by the UK and other European states, to use universities to deliver courses unsuited to being taught in a free-form academic context. Many subjects, especially those based on engineering, mechanics and construction require immediate engagement with real-world Apprenticeships and training schemes that emphasise placements within industry and hands-on teaching of core skills will do more to address the needs of the young adult work force than current forms of post-eighteen education. Concerns raised by both state and industry about late entry into the work force can be adequately addressed by bringing the world of work into the classroom at a much earlier stage.  [i] “Spain to raise retirement age to 67.” The New York Times, 27 January 2011.   [ii] “Pension rallies hit French cities.” BBC News online, 7 September 2010.",
      "media and good government house believes community radio good Radio is cheap to produce and easily accessible.  Community radio relies on the power of its ideas and the thirst for those ideas among its audience. It accepts the notion that it is the exchange of information and views, freely given and received, that is more important than the ideas themselves.  It doesn’t require massive budgets and radio waves can be received on equipment that costs pennies; more importantly it can be shared.  For all of its pretensions of accessibility the devices used to access the Internet tend to be expensive and they also tend not to be shared – unlike radios [i] .  To give some context to this, even paying Western prices, a small radio station can be started for as little as $10,000 with monthly costs of $1,000 [ii] . Some of that, of course, relates to government issued licences, clearly this does not apply if the station is planning to be ignored by the authorities. These costs can be further reduced when the founders have a pre-existing knowledge of radio engineering or work with a partner organisation such as the BBC World Service or the various NGOs who specialise in the field [iii] .  [i] Plunkett, John, Community radio: A rare success story. The Guardian. 9 March 2009.  [ii] Prometheus Radio Project.  [iii] Wikipedia. Community Radio.",
      "States should not possess such destructive, cataclysmic weapons  Nuclear weapons are, by their very nature, indiscriminate and disproportional; any weapon which could not possibly be used in a responsible manner should not be permitted. Over the past fifty years, we have seen a general tendency towards limited warfare and precision weapons, allowing military objectives to be achieved with minimal loss of civilian life. The entire point of nuclear weapons, however, is their massive, indiscriminate destructive power. Their use could kill tens of thousands of civilians directly, and their catastrophic environmental after-effects would harm many more all around the world. These effects could never be morally acceptable, particularly as the basis of one’s national security strategy. They place ‘humanity and most forms of life in jeopardy of annihilation’ (Krieger, 2003). No state or leader can be entrusted, morally, with a power and responsibility that could come close to annihilating humanity.",
      "Economic downturn would cause a surge of immigration  People leave Mexico because of poor employment opportunities, the wall would likely hurt the economy of Mexico and create a surge of immigration. Building the wall has a negative effect on natural resources as well as businesses in the area. Also it would discourage investment in Mexico because it would look like a serving of the partnership between the US and Mexico. Any hit to the Mexican economy would likely increase illegal immigration, despite the wall’s construction.",
      "Legalization would free up resources that could be devoted to eliminating sex trafficking  Some markets in sex should be blocked. Markets that involve child labor, forced labor or sex, and forced migration and detention, should be stopped and those who organize and profit from such markets should be prosecuted. As with any service, it is critically important that no one is forced to work or to continue working, either through the threat of harm or through fraud and deception. It is also critically important that children are protected from sexual predators, and are excluded from all aspects of sex businesses. Forced labor and child sexual abuse involve violations of basic human rights that all societies are expected to protect.  Voluntary, adult sex work is significantly different from trafficking, and law enforcers need to distinguish market exchanges involving consensual sex among adults from market exchanges involving forced sex among adults or involving minors. By legalizing voluntary, adult sex work, law enforcers and rights protectors could focus their efforts on eliminating markets that involve the sexual abuse of adults or children. Additionally, clients of sex business would have the choice of patronizing legal business, and therefore would be less likely to patronize inadvertently a business that relies on forced or child labor.",
      "sex sexuality international africa religion church morality house believes Protects people from spending eternity in Hell.  It is important to remember that the Catholic Church believe that barrier contraception is against God and that using it will condemn people to Hell. Therefore, even if the Church's stance on condoms is harmful, which the proposition does not accept that it is, it is less harmful than people spending an eternity suffering. In this context, therefore, the most responsible thing for the Catholic Church to do is to forbid the use of condoms and, thereby, save people from Hell1. 1 Pope Paul VI. \"Humanae Vitae.\" 1968.",
      "Violent Video Games cause Violent Behaviour  Video games exist as an interactive medium. The player has control over their character and many of their character’s actions whereas in a book or movie, the audience does not. This means that the player can become invested emotionally in characters to a greater extent because of the autonomy afforded to each character.  Given that this is true it becomes more difficult to ensure dissociation between the real world and the game world with which the player interacts. With the growing drive towards realism of videogame graphics, game environments are able to look incredibly similar to real life, further blurring the distinction.  If this is the case, then a person who visits violence upon another person within a game universe feels the same emotions as someone who does so within real life, and therefore may be desensitised to real-life violence. Whilst game producers would claim that is not their aim and that their games do not cause this desensitisation, many have been actively pursuing technologies that allow for greater immersion within their game-worlds.  If this is the case then acts of violence may fail to register the same level of shock or revulsion in a person than they usually do. Given that this is true, people who play video games become more able to harm others or less likely to intervene to prevent harm.  In terms of actual evidence, there is very little to back up this analysis. Most studies supporting the concept have been debunked by others. [1]  [1] Anderson, Craig &amp; Bushman, Brad. Effects of violent video games on aggressive behavior, aggressive cognition, aggressive affect, physiological arousal, and prosocial behavior: A meta-analytic review of the scientific literature. Psychological Science, 2001, 12: 353-359",
      "ment international africa society immigration minorities youth house would Policies towards a free labour market will create unity.  National borders are a result of Africa’s colonial history. The boundaries constructed do not reflect meaning or unite ethnic groups across the continent. The border between Togo and Ghana alone divides the Dagomba, Akposso, Konkomba and Ewe peoples. [1] Therefore encouraging freedom of movement across Africa will erase a vital component of Africa’s colonial history.  The erasing of boundaries, for labour markets, will have significant impacts for rebuilding a sense of unity, and reducing xenophobic fears, of which have been politically constructed.  A sense of unity will motivate citizens to reduce disparities and inequalities of poverty.  [1] Cogneau, 2012, pp.5-6"
    ],
    "relevance_map": {
      "0": 1,
      "1": 0,
      "2": 0,
      "3": 0,
      "4": 0,
      "5": 0,
      "6": 0,
      "7": 0,
      "8": 0,
      "9": 0
    },
    "query_id": "query_9",
    "num_docs": 10
  }
]